[{"name":"Tim Murray (@Timotay)","date":"2016-06-15T10:58:30.000Z","content":"    <p><strong>I used to know. . .</strong><br>how to do brand identity work. Or at least, I thought I did. It involved locking myself and a small team in a room for a long time and unveiling the results at the end in a big “ta-da.” Now, I’m about to kick off an open design process for the Mozilla brand identity, and it’s going to turn everything on its head.</p><p>&nbsp;</p><p><b>The Old Way: Controlled and Consistent </b></p><p>As creative director at retail giant Target, I was lucky to work with agencies and internal teams that developed dozens of brands, some of them now worth billions. In hindsight, our process was pretty straightforward. The merchants identified the market opportunity, marketing did research and gathered insights to come up with brand positioning, and our creative team led design.</p><p>The design phase lasted for months and included qualitative and quantitative testing to reach a data-driven consensus. After that, we had a tidy solution ready to stamp on packaging and signage and launch with a TV and print campaign. The stone tablets came down from the mountain, and we enforced the law of the brand.</p><p>Only a tiny percentage of our end users had a say in how the brand would look. We treated these customer focus groups and eye-tracking tests like a necessary nuisance to validate what our superior experience and intuition dictated as the right design for the brand. We were the experts. Engagement with the rest of our users consisted of them putting the freshly branded product into their shopping basket (or not) and, with our prodding, telling their friends about their purchase at spin class and on Facebook.</p><p>&nbsp;</p><div id=\"attachment_61\" style=\"width: 310px\" class=\"wp-caption alignleft\"><img class=\"wp-image-61 size-medium\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/06/4931937747_aa4c850fec_b-300x200.jpg\" width=\"300\" height=\"200\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/06/4931937747_aa4c850fec_b-300x200.jpg 300w, https://blog.mozilla.org/opendesign/files/2016/06/4931937747_aa4c850fec_b-600x399.jpg 600w, https://blog.mozilla.org/opendesign/files/2016/06/4931937747_aa4c850fec_b-1000x665.jpg 1000w, https://blog.mozilla.org/opendesign/files/2016/06/4931937747_aa4c850fec_b.jpg 1024w\" sizes=\"(max-width: 300px) 100vw, 300px\"><p class=\"wp-caption-text\"><b>Train wheel in Wakkanai, Motohiro Sunoichi</b></p></div><p><b>Setting off to an Unknown Destination </b></p><p>Now, I am a stranger in a strange land. I work for Mozilla, the nonprofit that’s fighting for an equal Internet for everyone and the parent brand for the open-source Firefox browser. Over 30,000 volunteers contribute to our cause by writing code, translating web pages, and building community with other open-source advocates in cities and villages around the world. We offer a radical invitation to participate, and we show our work, even when it’s incomplete or messy.</p><p>I’m responsible for leading the development of a new brand identity for Mozilla. Today our style guide consists of a wordmark and a handful of muted colors—creative assets not up to the challenge of modern social communication. Mozilla keeps getting tangled up with Firefox, its main product. With the absence of a brand system, our communities and teams have spun up their own logos to celebrate their existence on T-shirts, stickers, and websites. And our wordmark doesn’t do justice to our fight for a free and open internet.</p><p>This is just the sort of chaos I would have loved to untangle at Target. With the help of a big creative agency partner, the brand outcome could almost be predetermined at the outset: a design solution that could be imposed on the masses, applied and policed with care. At Mozilla though, our independent maker mindset ignores hierarchical dictats in a constant search for the new. A top-down brand might well be ignored or rejected by the community we champion.</p><p>&nbsp;</p><p><b>A Few Lines in the Sand</b></p><p>As we interviewed some of the world’s best brand identity agencies for this assignment, it became clear that we would have to do this work in an unconventional way. As Mozilla we have permission—and an obligation—to work in the open and engage as many citizen-designers around the world who want to contribute. Our agency pick, London-based johnson banks, was equally enthusiastic about trying something new.</p><p>It dawned on us: the process will become the project. We’ll let go of a controlled outcome and have faith that what emerges will work. (<i>Let go</i>. Simply writing those words scares the bejeezus out of me.)</p><p>A few rules for our sandbox:</p><ul><li><b>We won’t default to a crowd-sourced solution.</b> Engagement will come in the idea generation phase, the critique of the work, and in how it gets used by Mozillians.</li><li><b>We will still guide and curate the work as transparently as possible</b>, just as we do with Firefox and the other open-source projects at Mozilla.</li><li><b>We’ll keep the wheels on the bus.</b> We’ll have a timeline with milestones and an end date.</li><li><b>We’ll aim for a flexible brand system</b> recognizable as Mozilla so that we can gain the awareness that comes from repeated exposure.</li><li><b>We won’t vote on the outcome.</b> The clicks of the crowd won’t drumpf all.</li></ul><p>What might this process look like? We’re already asking talented folks in our Mozilla community design group to generate ideas. We’re publishing our process on this blog and our Medium channel, where we’ll welcome feedback. We will record or live-stream some working sessions and find or host live events where other designers can critique the work.</p><p>The journey is beginning, and you’re invited to come. All aboard!</p><p>&nbsp;</p><p><i>Contributions from the Mozilla Brand Advisory Group, Arianna Orland, Jordan Crane, Kevin Fann, and others influenced this post. </i></p><p><em>Main image credit: “Sun Tunnels, 1976” <a href=\"http://ecobrooklyn.com/earth-art-movement/\" target=\"_blank\">image source</a></em></p>      ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/branding-in-a-new-land/"},{"name":"akülü sandalye","date":"2016-06-23T00:00:00.000Z","content":"       <p>great article :)</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/branding-in-a-new-land/"},{"name":"Tim Murray (@Timotay)","date":"2016-06-23T00:00:00.000Z","content":"       <p>Many thanks!</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/branding-in-a-new-land/"}]