[
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-06-20T20:07:44.000Z",
    "content": "    <p>This is the fourth theme of a series of seven. We’ve developed these to help us decide on the future direction of the Mozilla brand, and now we want your thoughts as well.</p><p>This theme asks if Mozilla should stand for the linkage between a healthy (open, free, nonprofit) Internet and a world that is better for more people. Read the words, consider the pictures*, then ask yourself:<br>Does this reflect what Mozilla promises to the world?<br>Does this reinforce the experiences and values Mozilla delivers?<br>Does this communicate the ‘right’ image to the world?<br><a href=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/06/7-1.jpg\"><img class=\"aligncenter wp-image-83 size-full\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/06/7-1.jpg\" width=\"2590\" height=\"4673\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/06/7-1.jpg 2590w, https://blog.mozilla.org/opendesign/files/2016/06/7-1-300x541.jpg 300w, https://blog.mozilla.org/opendesign/files/2016/06/7-1-600x1083.jpg 600w, https://blog.mozilla.org/opendesign/files/2016/06/7-1-1000x1804.jpg 1000w\" sizes=\"(max-width: 2590px) 100vw, 2590px\"></a><br>Please use the comments below to let us know what you think.</p><p>* The images you see on these boards are for illustrative purposes only. Don’t take offense if we’ve used an image of your company or project – please be flattered.</p>      ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/for-good/"
  },
  {
    "name": "Rob Pape",
    "date": "2016-06-21T09:43:00.000Z",
    "content": "       <p>This is a friendlier direction and think stands for Mozillas principles of helping and making the web for all and freeing it.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/for-good/"
  },
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-06-21T16:08:00.000Z",
    "content": "       <p>We believe that a more accessible internet that empowers people will contribute to making the world more connected and promote freedom. Is “A better web means a better world.” provocative and energizing enough to engage new audiences?</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/for-good/"
  },
  {
    "name": "Alex Davis",
    "date": "2016-06-23T10:39:00.000Z",
    "content": "       <p>I’ve looked over all 7 brand ideas (2 or 3 times) and this appeals to me the most because it uses a positive message to convey it’s ideas. This one is more like “glass half full” rather than “half empty”.</p> <p>Although no individuals or personalities were included in this to reinforce the brand, it’s easy to associate “For Good” to people like Ghandi, Martin Luther King and Barrack Obama. These are people that wanted change but usually spoke about it in a positive manner (or at least that how I remember them). Their most famous quotes talk more about their dreams of good bright futures than focusing on the bad of today.</p> <p>“You must not lose faith in humanity. Humanity is an ocean; if a few drops of the ocean are dirty, the ocean does not become dirty.” -MG<br> “The future rewards those who press on. I don’t have time to feel sorry for myself. I don’t have time to complain. I’m going to press on.” -BO<br> “Change will not come if we wait for some other person or some other time. We are the ones we’ve been waiting for. We are the change that we seek.” -BO<br> “Darkness cannot drive out darkness; only light can do that. Hate cannot drive out hate; only love can do that.” -MLK<br> “Life’s most persistent and urgent question is, ‘What are you doing for others?'” -MLK<br> “I have decided to stick with love. Hate is too great a burden to bear.” -MLK</p> <p>The only thing I don’t completely agree with in this positioning is… “The profit motive is destroying the Internet. So take away the profit motive.” This isn’t a positive twist like the rest of the positioning. We also can’t forget that profit helped build the web. I think a more positive tone can be used to address this point. For example, “freedom over profit” or “Free web for all, not just for some” or “A free web profits everyone”.</p> <p>Great job on these 7 incredible brand and positioning ideas. I love that you “open sourced” it.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/for-good/"
  },
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-06-23T11:16:00.000Z",
    "content": "       <p>Thanks, Alex. Your citations around hope, optimism and human potential suggest a more positive future orientation for Mozilla. Thanks for articulating that path. You are not alone in sharing that feedback with us and we’re absorbing it and doing some rethinking as a result. Great thinking!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/for-good/"
  },
  {
    "name": "Tiffanie",
    "date": "2016-06-23T12:05:00.000Z",
    "content": "       <p>I agree with Alex – this one resonates with me the most. To me, the underlying message is very similar to other proposals but this one goes about it in a more positive, “the future is bright” kind of way.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/for-good/"
  },
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-06-23T13:29:00.000Z",
    "content": "       <p>Thanks, Tiffanie. Another voice for optimism.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/for-good/"
  },
  {
    "name": "Eric Shepherd",
    "date": "2016-06-23T19:42:00.000Z",
    "content": "       <p>This one isn’t bad, although telling people you’re opposed to profit on the web seems a little weird given all the benefits of e-commerce and such. :)</p> <p>And bits of this message can veer close to the boundary of what I can deal with on the super-saccharine side. Love and rainbows and such; it’s a little over the top.</p> <p>But we need to keep in mind, as I’ve alluded to on other themes, that not everyone is an activist. Not everyone cares about the same ideals. So we need to be careful about what we choose to make a big deal of.</p> <p>I do want to caution again about being very careful with what people and groups you choose to reflect your ideals. For example, I’ve seen imagery of President Obama in a few places on these themes, representing hope and change and such. But not everyone sees him that way; to other people he’s more a symbol of wishy-washy, ineffective leadership.</p> <p>Similarly, Ronald Reagan might be seen as an example of strength and leadership by some while to others he might represent carelessness and wastefulness. Different people will react different ways to these images, and given how polarizing politics can be, there’s far too much risk of annoying a disproportionately large percentage of possible users. So please, please be careful.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/for-good/"
  },
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-06-23T21:31:00.000Z",
    "content": "       <p>Thanks, Eric. Good point. We have yet to dig into the political associations of the American portion of our target audience, so we have no idea whether Obama or Reagan or someone else would be a positive influence on their appeal and understanding of Mozilla. Regardless, using U.S. politicians to shorthand certain values is not a great way to communicate to a global audience. We’ll likely stay away from individual politicians in our final brand identity.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/for-good/"
  },
  {
    "name": "Philipp Spiegel",
    "date": "2016-06-26T13:00:00.000Z",
    "content": "       <p>As the Mozilla Developer Network says: “Shared knowledge for the Open Web”. I am conviced by the idea of helping other people because I can do something good for them and not because I want to demand something in return. This slogan inspires me and I think that it is Mozilla’s core idea. </p> <p>In my eyes, Mozilla is an open community which realizes a great contribution to the web and pushes new open source technologies without profit in mind. It is about creating something good together and sharing it with everyone to change for the better. I would consider this as the most central principle of Mozilla. This theme probably fits the best to my idea of what Mozilla stands for: </p> <p>“Free to realize together a better web for all”</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/for-good/"
  },
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-06-26T21:44:00.000Z",
    "content": "       <p>Thanks, Philipp — both for your well-considered suggestion and your contribution to MDN. Your awareness of Mozilla’s role in developing new open-source technologies extends further than the average person, who may think that Mozilla is just another tech startup motivated by profit. Love your emphasis on “together.” Many people who use the Internet are unaware of the trade-offs they are making for the content they desire. To them, the Web doesn’t need to get better; it works just fine as it is. How important is it for Mozilla to educate those people about what’s good and bad about today’s Internet first, before we can ask them to be a part of the “together” we envision?</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/for-good/"
  },
  {
    "name": "André Jaenisch (@Ryuno-Ki)",
    "date": "2016-06-29T15:03:00.000Z",
    "content": "       <p>This one feels pretty abstract to me.</p> <p>“Good” is an antonym word (there’s almost always a “bad”). You could argue that it is chosen on purpose to make the reader think about what that “bad” thing might be …</p> <p>However, I’d not go for branding Mozilla as “good”. Like commented on other brand suggestions here on the blog, the same thing or person might got interpreted differently by different people. Obama was mentioned.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/for-good/"
  },
  {
    "name": "Seburo",
    "date": "2016-07-12T12:32:00.000Z",
    "content": "       <p>As a contributor to Mozilla (through SUMO), this brand identity is the one that I connect with the most.  Whilst we may be engaged in many different facets of the community, we are all connected by our desire to do what is right and what is good for the web, and the wider community of users and fellow Mozillians we interact with.</p> <p>Sure, different people will have different ideas of what is defined as “good”, and that will differ according to context, but it will be generally reflected by the themes identified in the diagram above.</p> <p>What I really like about this idea is that it has a level of flexibility compared to some of the more aggressive postures taken by some of the other ideas.  Whilst I agree that they form part of the Mozilla manifesto and that we should take an interest in them, I always feel a bit concerned when there is focus on privacy and the “surveillance state”, as these views can make us look a bit of a anti-government fringe outfit, which could alienate us.</p> <p>Yes, we would have to be careful with this brand (just look at Google with its “do no evil” approach!), but I think that this option sums up for me what Mozilla (and open source more generally) is all about.</p> <p>Whilst I fully appreciate that this process to build a new brand identity is a collaborative process of many parts, I appreciate the opportunity to contribute and am grateful of how it has crystallized my opinion of what we do at Mozilla.  Regardless of the final result, “For Good” is how I see what we do making the web open and free for all.</p> <p>Thank you.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/for-good/"
  },
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-07-12T22:59:00.000Z",
    "content": "       <p>Thanks for sending positive energy in this direction. For Good indeed.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/for-good/"
  }
]
