[
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-06-20T20:17:42.000Z",
    "content": "    <p>This is theme two of a series of seven. We’ve developed these to help us decide on the future direction of the Mozilla brand, and now we want your thoughts as well.</p><p>Theme two asks if Mozilla should be seen as your own personal guide to the Internet (but an ethical guide, not one there to harvest or to track). Read the words, consider the pictures*, then ask yourself:</p><p>Does this reflect what Mozilla promises to the world?<br>Does this reinforce the experiences and values Mozilla delivers?<br>Does this communicate the ‘right’ image to the world?<br><a href=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/06/5-1.jpg\"><img class=\"aligncenter wp-image-81 size-full\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/06/5-1.jpg\" width=\"2590\" height=\"4704\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/06/5-1.jpg 2590w, https://blog.mozilla.org/opendesign/files/2016/06/5-1-300x545.jpg 300w, https://blog.mozilla.org/opendesign/files/2016/06/5-1-600x1090.jpg 600w, https://blog.mozilla.org/opendesign/files/2016/06/5-1-1000x1816.jpg 1000w\" sizes=\"(max-width: 2590px) 100vw, 2590px\"></a><br>Please use the comments below to let us know what you think.</p><p>* The images you see on these boards are for illustrative purposes only. Don’t take offense if we’ve used an image of your company or project – please be flattered.</p>      ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/the-guide/"
  },
  {
    "name": "Diana M",
    "date": "2016-06-23T09:19:00.000Z",
    "content": "       <p>I prefer the “guide” approach – it’s less political and reflects how I think about Mozilla.  I’ve been using the Firefox browser forever and have also worked with several departments at Mozilla in San Francisco helping with staffing.  Open Source contributors are a diverse lot and trailblazers…very like guides.  This one gets my vote.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/the-guide/"
  },
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-06-23T11:17:00.000Z",
    "content": "       <p>Thanks, Diana. Several contributors have pointed out that The Guide feels really appropriate positioning for Firefox. Would you agree?</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/the-guide/"
  },
  {
    "name": "Allen Meyer",
    "date": "2016-06-23T15:30:00.000Z",
    "content": "       <p>This does feel appropriate for Mozilla but, I think Mozilla needs being more challenging of the status quo. Look at the popularity of challenger candidates in the American Presidential election. I believe this unease in the population will soon be reflected in the way people perceive the internet because of the dominance of a few companies.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/the-guide/"
  },
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-06-23T20:47:00.000Z",
    "content": "       <p>Thanks for your thoughts, Allen. One line in The Guide seems to suggest that Mozilla has a role in setting a standard for Internet discourse. While there’s a great need for civility online and Mozilla practices kind discourse, do you agree that we should go farther in guiding Internet users in their behavior online? Or was this part of The Guide description less important to you?</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/the-guide/"
  },
  {
    "name": "Josephine",
    "date": "2016-06-23T15:59:00.000Z",
    "content": "       <p>“The guide” can come off as constraining rather than trailblazing. Mozilla fosters exploration and independence and I don’t know if this title really captures that (even though ‘trailblazing’ is one of the additional words) . It can also come off as removed, like a tour guide who facilitates or a GPS that neutrally does the job and helps to get you places.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/the-guide/"
  },
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-06-23T20:51:00.000Z",
    "content": "       <p>Thanks for the comment, Josephine. If we were to pursue this direction, what steps might Mozilla need to take as an organization to be a more authentic guide to the Internet?</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/the-guide/"
  },
  {
    "name": "Eric Shepherd",
    "date": "2016-06-23T19:32:00.000Z",
    "content": "       <p>I like the “Guide” theme best, although some of the text is a little too Tony Robbins/self-help for me. I would like to find imagery about Firefox as the bold scout helping you find your way safely through the Web. The counterintelligence operative that keeps your information secure. The security guard that keeps bad guys and viruses out of your system. The sherpa showing you how to safely ascend to the pinnacle of success and helping you get there with everything you need to have with you to achieve your goals.</p> <p>I’ve often thought of Firefox as my sherpa in that way; wise and helpful, with great skill and knowledge of the Web. Mozilla is home to the Web’s guides and teachers; leaders and able assistants.</p> <p>This one is close for me. I think it shows enormous promise!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/the-guide/"
  },
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-06-23T21:27:00.000Z",
    "content": "       <p>Many people have referenced Firefox when commenting on this theme. Firefox functions well as the agent for the user while online. Could we decouple Mozilla from that to focus on the other ways it makes the Internet a healthy and growing ecosystem? That’s one of the challenges we have ahead of us, along with sharpening Firefox’s appeal as a user agent. Thanks for your enthusiasm for this one. There’s a lot to like here.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/the-guide/"
  },
  {
    "name": "Axel Hecht",
    "date": "2016-06-24T03:55:00.000Z",
    "content": "       <p>In the past, we’ve failed when we denied that Firefox is our core.<br> We will also fail when we restrict ourselves to just that, too.</p> <p>I can see that mozillians support this, with Firefox being on the tip of their tongue. But that’s not because Firefox is going good, it’s because we haven’t pushed that product hard enough for too long.</p> <p>I think that “Firefox” in the comments doesn’t stand for the thing you build in mozilla-central, but it stands for the ways in which we affect people by software we develop.</p> <p>I see guidance as the one major asset that mozilla brings whenever we touch individual human beings. And that’s true for Firefox Desktop, outreachy interns, and MDN (etc…).</p> <p>In that sense, I expect this theme to be prominent to mozilla, even in a scenario where we successfully disrupted our current core product.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/the-guide/"
  },
  {
    "name": "Allen Meyer",
    "date": "2016-06-24T11:20:00.000Z",
    "content": "       <p>I am wondering if flipping the order, such that the independent guide comes first, with an ethical ethos following: Civil disobedience for the internet, would it be too far to use the analogy of Rosa Parks?</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/the-guide/"
  },
  {
    "name": "abbas",
    "date": "2016-06-28T23:46:00.000Z",
    "content": "       <p>I have a concept design,how can i sent to you</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/the-guide/"
  },
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-06-29T09:35:00.000Z",
    "content": "       <p>That’s great to hear, Abbas. If you have a link to the source for the concept, such as a blog, shared doc, or site, you can put it here in the comments. If you would prefer to email your concept, please send it to <a href=\"/cdn-cgi/l/email-protection#683c251d1a1a09112825071201040409460b0705\"><span class=\"__cf_email__\" data-cfemail=\"085c457d7a7a69714845677261646469266b6765\">[email&nbsp;protected]</span></a>. Thanks!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/the-guide/"
  },
  {
    "name": "André Jaenisch (@Ryuno-Ki)",
    "date": "2016-06-29T15:44:00.000Z",
    "content": "       <p>“How do you behave ethically?” from the trial narrative.</p> <p>I wonder, whether this could get Mozilla in trouble with different parts of the audience.<br> There is no one global ethos I were aware of (maybe the Golden Rule as an exception).<br> Mozilla should refrain from digging into this topic too deeply.</p> <p>Take the announcement of Brendan Eich as CEO of Mozilla for example.<br> One sided argued his deeds were unacceptable. Others valued him for his contributions for the open web. Which side is ethically correct? (Rhetoric question).</p> <p>I think it will be a major challenge here to find a position which does not weaken Mozilla’s stand in the market.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/the-guide/"
  },
  {
    "name": "karlski",
    "date": "2016-07-01T07:06:00.000Z",
    "content": "       <p>There seems to be no/little mention of the concept of trust.<br>  To be a ‘guide’ you need to be trustworthy, beyond any form of moral reproach. The internet must trust your instinct to guide/steer/direct their steps through the warped badlands of the landscape, avoiding bandits, snakes and pitfalls.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/the-guide/"
  },
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-07-01T15:21:00.000Z",
    "content": "       <p>Thanks, karlski. I agree that trust would need to be a core underpinning of a Mozilla identity built around being an Internet guide but we might not choose to project it to the world. As a trait of brand character, trust is difficult to claim. Trust is proven through consistent action to the point that an audience has a good ability to predict how one will act. The louder a brand or a person professes to be trustworthy, paradoxically the more its motives are called into question. Is Mozilla trustworthy? Like everyone else, we would love to think so. The actions we’ve taken to nurture, celebrate, and protect the Internet are well documented. Candidly some have found that evolution in our core product or some particular judgment call we’ve made over the years has failed to match their initial perception of us, and we will have to earn back the trust of those people (or agree to disagree). We will continue to act in the best interest of the Internet and the individuals who use it and by doing so hope to sustain the trust that’s grown around us. That’s the best a Guide can do.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/the-guide/"
  }
]
