[
  {
    "name": "Michael Johnson",
    "date": "2016-09-16T00:04:46.000Z",
    "content": "    <p>Comments from the first round on ‘The Eye’ route confirmed a suspicion that the typography might suggest something we didn’t intend, so first we looked at ways to make this creature more approachable.</p><p><img class=\"alignleft size-large wp-image-425\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/jb_Mozilla_TheEye_investigation-1024x724.jpg\" alt=\"mj_tm_Moz_Nashville_edits for new pics.key\" width=\"1024\" height=\"724\"></p><p>&nbsp;</p><p>The, we took a step back and looked again for ways to hint at a ‘zilla (whilst not being too specific), and create the basis of a wide-ranging design scheme. After weeks of experiments and simplification, Dino 2.0 emerged.</p><p>Essentially this Dino is just a red chevron and some white type – but somehow that one raised eye can watch and blink in a very unique way. And those jaws can merrily chomp when needs be.</p><p>We see this Dino as someone who can straddle two narratives – one that can stand up, be counted, shout, bark and bite when needed – yet act as a figurehead for Mozilla’s maker community across the globe. We’re developing a kind of ‘agit’ toolkit for this route, with crude hand-drawn industrial typefaces, and a suitably red, white and black colour scheme.</p><p>We’ve discovered Dino 2.0 successfully change its spots for communities and countries too.</p><p><img class=\"alignleft size-full wp-image-436\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/Dino_2.0_chomping1.gif\" alt=\"dino_2-0_chomping1\" width=\"1128\" height=\"1076\"></p><p>&nbsp;</p><p><img class=\"alignleft size-large wp-image-431\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/jb_Mozilla-sept_A_dino_2-1024x724.jpg\" alt=\"jb_mozilla-sept_a_dino_2\" width=\"1024\" height=\"724\"><img class=\"alignleft size-large wp-image-430\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/jb_Mozilla-sept_A_dino_3-1024x724.jpg\" alt=\"jb_mozilla-sept_a_dino_3\" width=\"1024\" height=\"724\"><img class=\"alignleft size-large wp-image-429\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/jb_Mozilla-sept_A_dino_4-1024x724.jpg\" alt=\"jb_mozilla-sept_a_dino_4\" width=\"1024\" height=\"724\"><img class=\"alignleft size-large wp-image-428\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/jb_Mozilla-sept_A_dino_5-1024x724.jpg\" alt=\"jb_mozilla-sept_a_dino_5\" width=\"1024\" height=\"724\"><img class=\"alignleft size-large wp-image-427\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/jb_Mozilla-sept_A_dino_6-1024x724.jpg\" alt=\"jb_mozilla-sept_a_dino_6\" width=\"1024\" height=\"724\"><img class=\"alignleft size-large wp-image-426\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/jb_Mozilla-sept_A_dino_7-1024x724.jpg\" alt=\"jb_mozilla-sept_a_dino_7\" width=\"1024\" height=\"724\"></p><p>&nbsp;</p><p><iframe src=\"https://player.vimeo.com/video/182855838?loop=1&amp;title=0&amp;byline=0&amp;portrait=0\" width=\"820\" height=\"461\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>      ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Gervase Markham",
    "date": "2016-09-16T00:00:00.000Z",
    "content": "       <p>I’m really pleased that you are continuing to explore dino imagery, and aware of the risk that I would react badly to anything other than what we do at the moment :-) But I do think this dino is a bit cartoonish; he doesn’t have much gravitas. Do I want to go into a meeting at the EU Commission with this on my business card? I would worry they’d think I was representing a children’s TV channel. Perhaps there are other variants which wouldn’t make me think this, but I’m not sure this is there yet.</p> <p>Gerv</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Benjamin Smedberg",
    "date": "2016-09-16T00:00:00.000Z",
    "content": "       <p>Please can we give up on dinosaurs (or in this case, alligators)? Unless it becomes “cute”, it’s inherently a predatory and animalistic symbol. It’s the exact opposite of a community of people making the world better. Is “chomping” really the message we want to convey with our logo (Or in some variants here, shouting)?</p> <p>In addition, it’s not uncommon to hear comments about Mozilla/Firefox being “a dinosaur”. Please let’s not play to that image.</p> <p>We should have ditched the dinosaur years ago. This is by far my least favorite idea.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Chris H-C",
    "date": "2016-09-16T00:00:00.000Z",
    "content": "       <p>I love the dino-stapler!</p> <p>I see it as a secondary brand design, though… I can definitely see this being used like the lizard is used today: in cute and clever, mostly “insider”, contexts where people are ready for the whimsy.</p> <p>I don’t know that I can see it on the letterhead.</p> <p>I am going to bookmark the gif and the video, though, and use it to explain Mozilla to people I know.</p> <p>Maybe that’s evidence that I’m wrong — that this is an excellent brand design because it can be used to explain Mozilla to people… but I feel as though the audience would already have to be primed with knowledge _of_ Mozilla for it to work.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Gabriela Owens",
    "date": "2016-09-16T00:00:00.000Z",
    "content": "       <p>The ‘all hands’ dino looks tired or bored to me</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Les Orchard",
    "date": "2016-09-16T00:00:00.000Z",
    "content": "       <p>On the other hand, I feel like some whimsy at Mozilla has been one of our strengths. Who better to troll the giants than a chompy dino?</p> <p>That said, I do agree the Protocol option is better for gravitas and biz cards. Would be nice if we could have this one as a mascot for alternate branding for in-community events &amp; such</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "zam",
    "date": "2016-09-16T00:00:00.000Z",
    "content": "       <p>I am so pleased if All of us Mozillians make this changes a reality .. i want to get involved and make it happen.. !!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Helmut Wolff",
    "date": "2016-09-16T00:00:00.000Z",
    "content": "       <p>Mozilla is a name of inovation.</p> <div class=\"comment-image-box\"> <p class=\"comment-image-reloaded\"><a class=\"cir-image-link image-id-473\" href=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/mozilla-logo-round2-route2-2.jpeg\"><img width=\"600\" height=\"410\" src=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/mozilla-logo-round2-route2-2-600x410.jpeg\" class=\"attachment-baseline-mini-grid-thumb size-baseline-mini-grid-thumb\" alt=\"mozilla-logo-round2-route2-2\" sizes=\"(max-width: 768px) 600px, (max-width: 1000px) 160px, 300px\"></a></p> </div>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Jess",
    "date": "2016-09-17T00:00:00.000Z",
    "content": "       <p>I really like the overall look of this branding.  I think the Dino lends itself well to integration with all of Mozilla’s projects.  No matter how you change it (colour, addition of other objects) it is still recognisable as a part of the Mozilla brand.  </p> <p>It’s also something that can easily be replicated since it’s made up of simple shapes.</p> <p>My only criticism is the Dino with his eye half open looks a bit bored or stoned.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Teradyne Ezeri",
    "date": "2016-09-17T00:00:00.000Z",
    "content": "       <p>This is honestly my favorite. There’s so much that can be done with this design in general, and it gives off a very family-friendly vibe. It’s also /very/ eye-catching, and could easily be recognized with nothing more than a glance. The logos are inventive, the font just screams “fun”, and the chompy dino animation makes sense in context.</p> <p>The only thing that needs a bit of work is the MDN logo. The starburst look just doesn’t work. Perhaps have it holding a blueprint in its mouth, or having a blueprint design for the dino itself?</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Potch",
    "date": "2016-09-19T00:00:00.000Z",
    "content": "       <p>I love this. Human, quirky, and completely and utterly different from anything else out there!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Aaron",
    "date": "2016-09-19T00:00:00.000Z",
    "content": "       <p>This is one of my favorite options. Good because it can be used in different ways. But I also feel the Dino is too cartoony and can be a little more designed-out for more of a friendly corporate approach that would be more fitting to the Mozilla brand. The type can also use a helping hand. It feels a little off and maybe there is a way to keep it consistent throughout the entire wordmark.</p> <p>Good new start tho!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Brad Werth",
    "date": "2016-09-19T00:00:00.000Z",
    "content": "       <p>It’s cute. Without teeth, my initial read of the image was that it was a slate used to synchronize sound in filmmaking. Teeth might be good. The half-lidded eye looks bad in the still images because it looks asleep/stoned.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Dennis Schubert",
    "date": "2016-09-19T00:00:00.000Z",
    "content": "       <p>I really like the approach, but I wonder if the new font is necessary. Is using Fira an option? Using the “old” font in a new logo would make all the old imagery (and, FWIW, t-shirts!) still somewhat usable.</p> <div class=\"comment-image-box\"> <p class=\"comment-image-reloaded\"><a class=\"cir-image-link image-id-475\" href=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/jb_Mozilla-sept_A_dino_1.png\"><img width=\"600\" height=\"410\" src=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/jb_Mozilla-sept_A_dino_1-600x410.png\" class=\"attachment-baseline-mini-grid-thumb size-baseline-mini-grid-thumb\" alt=\"jb_Mozilla-sept_A_dino_1\" sizes=\"(max-width: 768px) 600px, (max-width: 1000px) 160px, 300px\"></a></p> </div>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Cameron Kaiser",
    "date": "2016-09-19T00:00:00.000Z",
    "content": "       <p>Definitely my preferred of the four. Animates well, distinctive, lends itself to lots of variations, and it’s a fun link to the past.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Steph W",
    "date": "2016-09-19T00:00:00.000Z",
    "content": "       <p>I can’t help loving this one.  I absolutely get what folks are saying about gravitas and it being a bit cartoonish / cute and for a little bit I agreed but I like:<br> * how it can resonate w/ kids<br> * the different designs in the tshirts<br> * the different color possibilities<br> * the Mozfest and All Hands versions<br> * the chomping tags</p> <p>I prefer:<br> * the Fira font or even the combination with Protocol… that way can be red background w/ moz://a for business cards / letterhead &amp; such but can also bring in the dino for more of a mascot use.<br> * to not see the lidded / tired dino.  </p> <p>Really hope to see something in the final that uses this.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Steve Fink",
    "date": "2016-09-20T00:00:00.000Z",
    "content": "       <p>It says “unhinged” to me. No comment as to whether that is good or bad.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "alexis burgess",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>I love this. Sorts out the issue of the eye in the previous iteration looking a bit like it was spying on you / about to eat you. It’s playful, and Mozilla thrives on playful experimentation and creativity – things that children are good at and gradually have driven out of them by corporate culture; It’s your point of difference. There is so much confidence in this logo. Compared to the other iterations, which seem to me clever visualisations of generic ideas (flames/connectivity) it stands out a mile.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Olias Gupta",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>I agree about using the Protcol 2.0 characters (://a) for this design, effectively combining the advantages of ideas 1 and 4 into one approachable and meaningful design.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Nick",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>Seems like this one is approachable but misses the geek crowd that Protocol brings in. Maybe they could be combined to allow the dino to become more of a bracket and stylistically become something like .</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Enrico",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>I disliked previous dino-design, but this is a huge improvement! I like it, it’s recognizable as Mozilla’s, it’s apt to variations and other uses (a set of emoticons?).</p> <p>The animation could probably be improved, even though I can’t tell why it looks “wrong” to me. Also, the font is nice, but if Mozilla plans on sticking to Fira Sans, it would look natural to have that in the logo instead.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Paul Tincknell",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>I like this for the whimsy and humor, and the history too. While I prefer the “moz://a” version the best, this one is a very close second, as it is very well done, and does look great on merchandise. Do keep the fully open eye over the version with the eyelid; it is important to maintain the readability of the word with a complete “o”.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Sam Whited",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>I’m a big fan of this logo; it’s simple, once you’ve seen it once it’s easy to recognize (with or without text since it’s a bit of a mascot as well as a logo), and it will translate well to large and small screens.</p> <p>I feel that this is one of the more flexible of the logo choices too; you can change the color, change the configuration (or remove) the eye, add a patern, etc. and it will still be recognizable. I’d be curious to see the MDN example above with all the eyes removed, I suspect it would be a lot cleaner in that particular example (having so many eyes feels a bit cluttered to me; just the plain geometric pattern might look better in the MDN example case).</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Sebastian",
    "date": "2016-09-23T00:00:00.000Z",
    "content": "       <p>This takes second place for me behind the Protocol design. It’s very recognizable and still very flexible. Minimalistic enough to be easily transferable to SVG and other vector formats. Don’t like the sleepy version very much.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Julius",
    "date": "2016-09-26T00:00:00.000Z",
    "content": "       <p>Hi!<br> I would prefer the dino because it has some kind of personality and is very versatile.<br> Moz://a (Protocol 2.0) is my second favorite because it expresses the connection between Mozilla and the web and its protocols. But the blue hue seems to come directly from the nineties…<br> Julius</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Myk Melez",
    "date": "2016-09-26T00:00:00.000Z",
    "content": "       <p>Although I like the original Mozilla dinosaur and appreciate this reimagining of it (perhaps the most of the current design directions), I’ve been nagged by the thought, as bsmedberg similarly noted, that an extinct creature is a troubling metaphor for a mature organization (and product).</p> <p>It recently struck me that while dinosaurs themselves have become extinct, their descendants continue to walk—and fly—among us in the form of those endothermic vertebrates popularly known as birds. And I wonder if there are evolutions ;-) of this design that make Dino 2.0 more birdlike (whether it becomes an actual bird, a flying dino, or just loftier, featherier, or otherwise birdlike in some way).</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Paul Burke",
    "date": "2016-09-28T00:00:00.000Z",
    "content": "       <p>This is a very whimsical direction. I’m a bit worried that the paths being explored are so divergent after months of work. Shouldn’t the decision already have been made whether to pursue more technical or more whimsical creative directions? Seems like the personality or attributes or whatever you want to call them should have been nailed down a bit more tightly.<br> Also, the exploration of ‘zilla designs makes me wonder – given that there isn’t massive attachment to the Mozilla name, was a name change considered? Maybe I missed this in previous blogs in which case, apologies. But it may have been worth at least exploring new names that might better communicate the same qualities you’re looking for the identity to express.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-09-28T00:00:00.000Z",
    "content": "       <p>Hi Paul, Changing the name Mozilla was not part of the scope of this work. Regardless, finding another name that is as distinctive and memorable would be a tall order, and would give up the recognition we currently enjoy. We’re attempting to move from recognition to understanding through our our strategy and brand work. Thanks for your comment.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Paul Burke",
    "date": "2016-09-29T00:00:00.000Z",
    "content": "       <p>Tim, thanks for the reply and clarification. Changing an established name can be worth it, but agreed – it isn’t easy and comes at a cost. Good luck with this endeavor!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Seburo",
    "date": "2016-09-28T00:00:00.000Z",
    "content": "       <p>Hi</p> <p>I like the idea of the return of the DIno logo.  Love it or loathe it, the mozilla is a key part of the heritage of Mozilla and I think that this is a good evolution of the design.</p> <p>I would recommend making two changes:</p> <p>1) Make the jaw length shorter and the depth of each jaw higher.  At the moment it looks like a big red crocodile, compacting it will give it more a red T-Rex (a close, non web browsing relation of Mozilla) feel.<br> 2) Lose the faux-Soviet poster typeface and the random capitalization.  It does not make the text very readable and feels a bit to political.</p> <p>I also agree with not using the eye lid.  Mozilla is wide awake, not half asleep!</p> <p>With some tweaks, this could be really good.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "André Jaenisch (@Ryuno-Ki)",
    "date": "2016-09-29T00:00:00.000Z",
    "content": "       <p>I’d draw the lower jaw in white with a black outline – and less tall. I hope this won’t increase the association with a stapler further!</p> <p>I enjoy this proposal. It’s warm and has some kind of character. I’m only worried about how it will perform on small sizes like a FavIcon or business card (or a mug).</p> <p>Regarding the font: It is not obvious to me, why some characters are written in lowercase while others are uppercase. I like how the M and the A round up the wordmark.</p> <p>And please, don’t write text with a rotation like in: <a href=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/jb_Mozilla-sept_A_dino_3-1024x724.jpg\" rel=\"nofollow\">https://blog.mozilla.org/opendesign/files/2016/09/jb_Mozilla-sept_A_dino_3-1024×724.jpg</a> It causes neck pain x_X</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "Robert Kaiser",
    "date": "2016-09-29T00:00:00.000Z",
    "content": "       <p>I love this one. It associates with the actual name (and its history). It keeps some of the revolutionary, unconventional spirit we’re coming from – though it should not just chomp up the “bad” stuff but also spit/shout out the “good” alternatives in the animation. Also I love how the “lizard” wording makes a re-appearance.<br> I also love how the regional suggestions play with graphic integration with regional metaphors and not just colors.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  },
  {
    "name": "amanda",
    "date": "2016-10-04T00:00:00.000Z",
    "content": "       <p>Love it! Has history and is own-able. Protocol is my number 1 but Dino 2.0 is a close second.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/route-four-dino-2-0/"
  }
]
