[{"name":"Tim Murray (@Timotay)","date":"2016-06-20T20:05:25.000Z","content":"    <p>This is the sixth theme in a series of seven. We’ve developed these to help us decide on the future direction of the Mozilla brand, and now we want your thoughts as well.</p><p>This theme puts Mozilla forward as the voice for freedom on the Internet (not one which is closed or firewalled). Read the words, consider the pictures*, then ask yourself:<br>Does this reflect what Mozilla promises to the world?<br>Does this reinforce the experiences and values Mozilla delivers?<br>Does this communicate the ‘right’ image to the world?<br><a href=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/06/9-1.jpg\"><img class=\"aligncenter wp-image-85 size-full\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/06/9-1.jpg\" width=\"2590\" height=\"4614\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/06/9-1.jpg 2590w, https://blog.mozilla.org/opendesign/files/2016/06/9-1-300x534.jpg 300w, https://blog.mozilla.org/opendesign/files/2016/06/9-1-600x1069.jpg 600w, https://blog.mozilla.org/opendesign/files/2016/06/9-1-1000x1781.jpg 1000w\" sizes=\"(max-width: 2590px) 100vw, 2590px\"></a><br>Please use the comments below to let us know what you think.</p><p>* The images you see on these boards are for illustrative purposes only. Don’t take offense if we’ve used an image of your company or project – please be flattered.</p>      ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-freedom/"},{"name":"David Ma","date":"2016-06-21T00:00:00.000Z","content":"       <p>I like Freedom because it’s probably the most universal desire for humans.  It can be used as “Freedom from” or “Freedom to” as well as a few other prepositions to expand on the narrative.  Plus, the root word is free.  And who doesn’t like free?</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-freedom/"},{"name":"Tim Murray (@Timotay)","date":"2016-06-21T00:00:00.000Z","content":"       <p>Thanks, David. Lots of agreement about the universality of “Freedom” as a theme, and the benefits to humanity that would come from a free, open, and equal Internet. Freedom works both at the human and systemic level. People in different parts of the world have told us, “I know what freedom feels like for me personally, and I can recognize its absence for other individuals and groups.” One consideration we’re weighing is how we ultimately would show (in our logo and related visuals) freedom without defaulting to showing its absence. If you have any ideas about this, we’re all ears.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-freedom/"},{"name":"David Ma","date":"2016-06-22T00:00:00.000Z","content":"       <p>Tim, good to know about the challenges with conveying freedom and the new logo.  There are 36 country flags that use (only) red, white and blue.  Some are red/white or blue/white.  Most are democracies.  Thus, maybe a color change is all that is needed?  Check out the mock image via the Dropbox link below.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-freedom/"},{"name":"Tim Murray (@Timotay)","date":"2016-06-22T00:00:00.000Z","content":"       <p>Thanks for posting this design idea, David. Congratulations for being the first to put words into visuals. Recognizing that many other flags use red, white, and blue as their colors, as someone who has grown up in the United States, it reads very patriotic, stars-and-stripes to me. Although the Mozilla home office is in the San Francisco bay area, we have 11 other offices and dozens of Mozilla communities operated by volunteers in cities and towns around the world. We are truly a global organization. My hunch is that our brand should reflect freedom without using colors that are likely be perceived as being a stand-in for America on a global stage. My question for you is, what sort of symbol beyond our wordmark would you see as a representation of freedom?</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-freedom/"},{"name":"André Jaenisch (@Ryuno-Ki)","date":"2016-06-29T00:00:00.000Z","content":"       <p>Since the topic came up on Open Design and will reach the deadline soon: <a href=\"https://github.com/mozilla/OpenDesign/issues/72\" rel=\"nofollow\">https://github.com/mozilla/OpenDesign/issues/72</a></p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-freedom/"},{"name":"Tim Murray (@Timotay)","date":"2016-06-29T00:00:00.000Z","content":"       <p>Thanks for reminding us that the github repo you identified is another way the community can contribute to Mozilla design. The issue in question asks our community to imagine what symbol(s) Mozilla might adopt to represent Internet freedom.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-freedom/"},{"name":"David Tenser","date":"2016-06-22T00:00:00.000Z","content":"       <p>Love the copy “Everyone wants a free web, right? Wrong.” Very powerful. The key here is really making the problems of the web clearly understood by people. </p> <p>Freedom is ambiguous and probably means a thousand things to a thousand people. I don’t know that it’s *the* theme we want to build our brand around, but it’s certainly an important aspect of it if we are able to explain what *we* mean with it. </p> <p>I think of Mozilla as fixing the web – pointing towards a better way of doing things, enabling people to benefit from that better way, and demonstrating to the whole industry that it can be done differently. Part of that is making it clear to everyone why the Internet of today isn’t great, and an equally important part is being seen as the leader in efforts towards fixing it. Some combo of “The Protector” and “For Freedom” perhaps?</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-freedom/"},{"name":"André Jaenisch (@Ryuno-Ki)","date":"2016-06-29T00:00:00.000Z","content":"       <p>“An Internet that is available to all, […] no[t] firewalled” – I relate firewall with the security tool which would mean that Mozilla is willing to expose me to virusses/trojans and that like.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-freedom/"},{"name":"OLIVER","date":"2016-06-22T00:00:00.000Z","content":"       <p>I like to be free,too, but lets say u want to pay a friend via ur Browser, u type ur words whatever and behind there is a virus, Spam Mail Trojaner, and it record it, i dont want to be that guy who will nail Mozilla down, because there aren’t secure! So, i think, this Kind of Case could be “filtered”, example, Youtube shouldn’t be filtered as a highly not secured Website, but ur Bank account! Stuff that’s really really important, for users, the Rest i didn’t care! It just like surfing the web! So i tnink, its the best way of being secure and otherwise be free! The other thing is Firefox should be fast and secure, but it also should be Intelligent, maybe like I sayd, two engines, one secured one is not! </p> <p>Or something like that way!</p> <p>Greetings, and i liked the work for years guys so keep it up!</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-freedom/"},{"name":"Eric Shepherd","date":"2016-06-23T00:00:00.000Z","content":"       <p>This one has some promise, but I think we have to be careful not to overdo it, too. Not everyone cares about this stuff (even if they should), so we need to strike a balance between the efforts to keep the Web free and our goal to be the user’s agent on the Web, helping them find and access what they need quickly and easily, in the most convenient way possible. It’s important not to pigeonhole ourselves into a single role (regardless of how many facets it has) unless we’re certain that it covers as many bases as possible.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-freedom/"},{"name":"Tim Murray (@Timotay)","date":"2016-06-23T00:00:00.000Z","content":"       <p>Thanks for commenting, Eric. We’ve been thinking about Firefox standing for the individual user on the Internet, while Mozilla leads thinking about the health of the Internet as an ecosystem. Firefox would be the user agent in that case. Could you see Mozilla standing for freedom – the freedom of the Internet to grow unchallenged by the power of a few, for instance?</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-freedom/"},{"name":"André Jaenisch (@Ryuno-Ki)","date":"2016-06-29T00:00:00.000Z","content":"       <p>“Open your source. Open your mind.” was a motto of Sabayon Linux (see <a href=\"https://de.wikipedia.org/wiki/Sabayon_Linux#/media/File:SabayonLinux-7-GNOME.png\" rel=\"nofollow\">https://de.wikipedia.org/wiki/Sabayon_Linux#/media/File:SabayonLinux-7-GNOME.png</a>).</p> <p>“Mozilla. Free the web.” could play along it.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-freedom/"}]