[{"name":"Tim Murray (@Timotay)","date":"2016-08-19T20:54:06.000Z","content":"    <p>The responses we’ve received to posting the initial design concepts for an updated Mozilla identity have exceeded our expectations. The passion from Mozillians in particular is coming through loud and clear. It’s awesome to witness—and exactly what an open design process should spark.</p><p>Some of the comments also suggest that many people have joined this initiative in progress and may not have enough context for why we are engaging in this work.</p><p>Since late 2014, we’ve periodically been fielding a global survey to understand how well Internet users recognize and perceive Mozilla and Firefox. The data has shown that while we are known, we’re not understood.</p><ul><li>Less than 30% of people polled know we do anything other than make Firefox.</li><li>Many confuse Mozilla with our Firefox browser.</li><li>Firefox does not register any distinct attributes from our closest competitor, Chrome.</li></ul><p>We can address these challenges by strengthening our core with renewed focus on Firefox, prototyping the future with agile Internet of Things experiments and revolutionary platform innovation, and growing our influence by being clear about the Internet issues we stand for. All efforts now underway.</p><p>To support these efforts and help clarify what Mozilla stands for requires visual assets reinforcing our purpose and vision. Our current visual toolkit for Mozilla is limited to a rather generic wordmark and small color palette. And so naturally, we’ve all filled that void with our own interpretations of how the brand should look.</p><p>Our brand will always need to be expressed across a variety of communities, projects, programs, events, and more. But without a strong foundation of a few clearly identifiable Mozilla assets that connect all of our different experiences, we are at a loss. The current proliferation of competing visual expressions contribute to the confusion that Internet users have about us.</p><p>For us to be able to succeed at the work we need to do, we need others to join us. To get others to join us, we need to be easier to find, identify and understand. That’s the net impact we’re seeking from this work.</p><p><b>Doubling down on open. </b></p><p>The design concepts being shared now are initial directions that will continue to be refined and that may spark new derivations. It’s highly unusual for work at this phase of development to be shown publicly and for a forum to exist to provide feedback before things are baked. Since we’re Mozilla, we’re leaning into our open-source ethos of transparency and participation.</p><p><strong>It’s also important to remember that we’re showing entire design systems here, not just logos.</strong> We’re pressure-testing which of these design directions can be expanded to fit the brilliant variety of programs, projects, events, and more that encompass Mozilla.</p><p>If you haven’t had a chance to read <a href=\"https://blog.mozilla.org/opendesign/branding-in-a-new-land/ ?\">earlier blog posts</a> about the formation of the narrative territories, have a look. This design work is built from a foundation of strategic thinking about where Mozilla is headed over the next five years, the makeup of our target audience, and what issues we care about and want to amplify. All done with an extraordinary level of openness.</p><p>We’re learning from the comments, especially the constructive ones, and are grateful that people are taking the time to write them. We’ll continue to share work as it evolves. Thanks to everyone who has engaged so far, and here’s to keeping the conversation going.</p>      ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Adrien Maston","date":"2016-08-19T00:00:00.000Z","content":"       <p>I think it’s very interesting, so here is a lengthy comment.<br> You can mentally add «&nbsp;I think that …&nbsp;» in the beginning of almost every sentence.<br> I did not for the sake of brevity and not being overly repetitive.</p> <p>#### The Eye<br> The intention behind this route is valid and straightforward but the execution is miles away.<br> This really says «&nbsp;Big Brother is watching you&nbsp;» and «&nbsp;Sauron’s Evil Eye&nbsp;». The black and yellow does not help.<br> I get the «&nbsp;watch out for you&nbsp;» sentiment but making a connection to this logo is more of a intellectual process, whereas the evil eye is a gut feeling, instantaneous like a reflex.</p> <p>Two eyes might help shifting from dictator to Internet’s friendly Sully. Or teeth (see t-shirt).<br> Not convinced this would be the right look anyway. It does take Mozilla’s history into account though. And you could argue that it makes sense to look like a friendly bestiary when most people knows you for something called Firefox.<br> I suspect that the designers at johnson banks knows it and that this route is made public as a «&nbsp;let’s check what people see in this one&nbsp;», that’s the whole point about the open design process.</p> <p>#### The Connector<br> Clear winner for me.<br> Strong concept and execution that embrace the values of Mozilla in a broad non-geeky way.<br> It has an Olympics feel in it (in a good way) which says a lot about celebrating humanism and human potentials.<br> It also takes multiple shapes without looking forced, making it flexible, even more coherent with the concept and very expressive (the «&nbsp;Maker Party&nbsp;» version is spot on).<br> The black background version is a node to NeXT, nice touch for an internet related entity like Mozilla.</p> <p>The «&nbsp;Developer Network&nbsp;» one (and «&nbsp;All Hands&nbsp;» one, to a lesser extent) is really subpar compared to the others.</p> <p>Not so found about the Privacy, Open Systems etc.<br> They look kinda random:</p> <p>– Privacy works in an (good) obvious way.<br> – Open Systems works by comparison to Privacy but does not make much sense alone.<br> – Web Literacy happens to form a «&nbsp;W&nbsp;» but is the only one depicted by a letter which feels like «&nbsp;that’s the only idea we had&nbsp;».<br> – Speaking Out may be some kind of open mouth. It mostly feels like «&nbsp;we had to pick a symbol from the logo, so…&nbsp;»</p> <p>Taking these symbols (if they are needed at all) from parts of the logo doesn’t add much and is far too restrictive.<br> It’s a solid starting point with lots of obvious ways to tweak it in its current form and see if it feels better (colors, thickness, ends and joins shape, backgrounds… ). The stroke width could use some work to look correct. Right now, the «&nbsp;o&nbsp;» looks thicker and «&nbsp;m&nbsp;» thinner even though they are not.</p> <p>#### The Open Button<br> The most uninspired of the whole to me. From the concept to the execution.<br> Yet another smiling figure. Smiling but looking sad.<br> It’s vague and says «&nbsp;digital tech stuff&nbsp;» in a dated way more than anything else.<br> It looks extracted from an 80’s signposting system: men’s room, information, locker, baby changing room.<br> Or an on/off switch on a tape recorder. Is it bad enough to switch Mozilla off ? I certainly hope not.<br> The type looks mismatched.<br> And why is the «&nbsp;Not closed&nbsp;» figure angry ?</p> <p>#### Protocol<br> Feels obvious in a geeky way.<br> Should Mozilla’s public face speak in a geeky way. I don’t think so. I think it should be broader.<br> It definitely works but I’m not convinced it’s the right tone for Mozilla to adopt when they need to make a statement of how great they still are to less and less people using Firefox.<br> The current execution looks really Microsoft-y. The blue doesn’t help.<br> The single color versions of the full name work better. They don’t emphasize M:// (or is it oza ?) and it’s not lacking.<br> The whole thing, with it’s safe blue and Helvetica light is too quiet.</p> <p>#### Wireframe<br> Very obvious execution of an obvious concept.<br> Not that it has to be a bad thing but in the particular case, the mariage of the symbol and the type really screams designer’s underground t-shirt brand if I may be caricatural. It sets it in a a trendy realm, which could be a very short-lived one.</p> <p>#### Impossible M<br> Nice concept but like the «&nbsp;Wireframe&nbsp;», the execution, from the patterns and stroke/fill color choices to the font and tracking, really sets it in trendyland with all its downsides: there are tons of logos and graphics like it right now as it’s one of the current best-seller to look «&nbsp;edgy&nbsp;», it doesn’t say much and it could be over 6 months from now.<br> All the derived material, like the WebMaker, MozFest etc. symbols and catch phrase posters, are just that times 1000.</p> <p>#### Flik Flak<br> Makes for cool illustrations and goodies but for a very complicated logo.<br> Like with the other routes, the derived symbols (MozFest, All Hands, Speaking Out etc.) look forced and superfluous.<br> It’s hard to decipher but it doesn’t lack in originality which is really what ties it to the concept behind it.<br> It has a slight dated look to it though and I am suspecting the color scheme.<br> It would be a shame to ditch it without some further rework though.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Tim Murray (@Timotay)","date":"2016-08-19T00:00:00.000Z","content":"       <p>Adrien, thanks for putting great care and consideration into this comment and for addressing what you see as the strengths and weaknesses of each design direction. Your feedback is specific and design-driven. Please continue to tune in as these designs evolve.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Adrien Maston","date":"2016-08-21T00:00:00.000Z","content":"       <p>I will and comment again… provided that I have something to say.</p> <p>And quoting phph :<br> « Your way of enticing people to participate and your pleasant-natured replies to all comments are very commendable! »</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Fernando","date":"2016-08-24T00:00:00.000Z","content":"       <p>I love the impossible M! Think big!</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"phph","date":"2016-08-20T00:00:00.000Z","content":"       <p>As a designer myself, I admire your openness in the design process. It is always hard to present early ideas to clients, let alone the whole (interested) world.</p> <p>Having followed your endeavour from the start I’m very excited to see how it continues to develop. Your way of enticing people to participate and your pleasant-natured replies to all comments are very commendable!</p> <p>Concerning the actual visual ideas I don’t want to repeat Adrien’s comments. I agree with him on most parts. Only »The Eye« remains my favourite from a gut feeling. To me it is funny and evokes a very positive emotion to Mozilla and its history. But seeing as the idea is to speak to a broader audience I agree it is not as suitable a solution as »The Connector«.</p> <p>Best wishes</p> <p>phph</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"gourdcaptain","date":"2016-08-20T00:00:00.000Z","content":"       <p>On the point of it being thought that all you do is Firefox – I checked the Mozilla page and it’s the only project listed. Not sure them knowing of anything else is surprising. You used to do Thunderbird, and that’s been dropped to community support, the only other one I can think of is Seamonkey, and that’s also a community supported project.</p> <p>On the logos themselves, I think they’re all… bad, which doesn’t have much to do with the need to rebrand itself (which I’m not convinced on.)<br> Good Fight is well.. I brought it up to friends on Internet chat and everyone immediately thought Eye of Sauron.<br> For the Internet of People just looks like a bunch of scribblings.<br> Choose Open is probably the least bad, but it doesn’t have anything to do with Mozilla in my mind and looks like some weird Emoji.<br> Protocol just looks bland and hard to read with the :// (it’s a gimmick title).<br> Wireframe World is also “weird and amateur”.<br> Impossible M looks like Word Art from Word 97.<br> And Flik Flak is… something weird.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"gourdcaptain","date":"2016-08-20T00:00:00.000Z","content":"       <p>Wait the Flik Flak spells out Mozilla? I had to read other comments to even pick that up… So probably not great.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Myn","date":"2016-08-20T00:00:00.000Z","content":"       <p>From the given possibilities, I can most easily associate Mozilla with “The Impossible M”. The isometric geometry allows to create icons and logos with consistent and easily recognizable style and overall design looks sufficiently different from others. I’d argue a limited colour palette (e.g. some shades of blue and orange from Firefox logo, maybe red from dino head) could be used to associate this impossible geometry with Mozilla in the eyes of ordinary people. For me, a shaded variant with less saturated colours of “The Impossible M” could do well in many applications, simply because it allows to create useful graphical elements without being too abstract, while having consistent style.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Paul","date":"2016-08-20T00:00:00.000Z","content":"       <p>Firefox itself is not a good brand. A fox has logically nothing to do with the web. Time to rebrand to Spider!:<br> <a href=\"https://wiki.mozilla.org/User:Broccauley/Rebrand_to_Spider\" rel=\"nofollow\">https://wiki.mozilla.org/User:Broccauley/Rebrand_to_Spider</a></p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Janis Greenspan (@jgreenspan)","date":"2016-08-22T00:00:00.000Z","content":"       <p>Thanks for your input, Paul, and for the Spider suggestion.  You definitely highlight the opportunity to create an identity that represents all of the things Mozilla is, rather than reinforcing the confusion between Mozilla and Firefox.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Albert","date":"2016-09-10T00:00:00.000Z","content":"       <p>Ha! While a spider might make more sense – I know at least five people how would stop using Firefox with that logo due to phobia ;)</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Zach","date":"2016-08-20T00:00:00.000Z","content":"       <p>I think your main problem with brand recognition is that you only made two things the average internet user would care about (Firefox and Thunderbird) and you already killed one of them.</p> <p>The average Internet user couldn’t care less about Internet of Things, platforms and web standards. I would think that anyone nerdy enough to care about that stuff already knows who you all are.</p> <p>In other words, do something the average Internet user cares about if you want expanded brand recognition. Like making Firefox faster and better (not by copying the worst aspects of chrome). I used to use Firefox, but once you started copying chrome I saw no reason to use the slower less user friendly browser any more. You successfully removed every reason I had to use Firefox over any other browser out there.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"J.B","date":"2016-08-20T00:00:00.000Z","content":"       <p>I apologize, but I was extremely not a fan of any of these possibilities. </p> <p>You all obiviously have such passion. None of that comes through! A logo should be launch the message at you, be something that’s instantly recogizeable. None of that is here at all for any of the logos. It’s all a confusing jumble. There’s nothing that yells out at me what you all are here for. There’s a reason simple logos are “in” right now, and it’s because it instantly evokes the feeling and message hopefully desired for the  company/foundation etc. None of that is here now, and I really hope you find something that does, otherwise you really won’t have that instant “identification” that more clear logos elucidate.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"C.","date":"2016-08-21T00:00:00.000Z","content":"       <p>IMHO you should attempt to evolve the current logo, i.e. keep the font face, keep the colours and capitalization. Change only one thing, maybe add just one thing. Maybe bring back the dino. </p> <p>The new logos are all very different from the current one, they don’t really have any connection to it. I’d be surprised seeing one of those logos one day and thinking it was the same organization.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"zweiohrmensch","date":"2016-08-21T00:00:00.000Z","content":"       <p>Hi!<br> First of all: sorry for my not perfect English, I am not a native speaker. But I want to share my thoughts.<br> A – The Eye: I like the design and the idea of the eye because it remembers me to the Mozilla Dinosaur. But it’s difficult to read “Mozilla” and I think it’s important that “Mozilla” is easy zu read.<br> B – The Connector: it’s even a lot more difficult to read the name “Mozilla” in the logo and that’s a big problem in my opinion.<br> C – Open Button: it looks like a outlet. :/ I don’t like this design direction.<br> D – Protocol: It’s nice but not very spectacular. What I really like is the slogan “Old ideals. New ideas”. Maybe this can be reused for whatever design will be chosen.<br> E – Wireframe World: I think the Mozilla logo could be better, it’s not really great, but from all suggestions it works best as design SYSTEM in combination with the other logos.<br> F – Impossible M: it’s nice. Maybe a bit too retro style, but nice.<br> G – Flik Flak: too complex.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Vik","date":"2016-08-21T00:00:00.000Z","content":"       <p>Please, PLEASE. Just leave old logo. Mozilla is open, and there’s no need trying to keep up with Explorer, Chromium, or any other browser. So many other fields for time, money and energy.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Tim Murray (@Timotay)","date":"2016-08-21T00:00:00.000Z","content":"       <p>Thanks, Vik. This design exercise is for Mozilla, the nonprofit behind the Firefox open-source browser. Mozilla works to keep the Internet fair and equal for all. For more detail on the work Mozilla does in the world, please visit <a href=\"https://mozilla.org\" rel=\"nofollow\">https://mozilla.org</a>.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Tom Lundin","date":"2016-08-21T00:00:00.000Z","content":"       <p>Here are a few “big-picture” comments on the logo designs. My main crit is that many of these logos are a stark conceptual departure from your stated focus on “people,” because they emphasize the “techy” components of technology.</p> <p>Here’s why:  A focus on people implies an emphasis on what technology can help them achieve. It is an aspirational focus. People use technology only because it helps them to connect, to achieve, to succeed, to learn, to find meaning, to find community, and more.</p> <p>If you emphasize the mechanisms that underlie technology — protocols, scaffolding, power buttons, etc. — you are focusing on the minutiae of HOW technology works, as opposed to why people actually use it.</p> <p>Sure, some tech-geeks might be more intrigued by the mechanisms of technology rather than the emotional needs it can fulfill, but by focusing on that aspect of Mozilla, you’re limiting the image you portray to providing tools for the betterment of techies … not ALL PEOPLE, yes?</p> <p>But it’s a touchy balance … Mozilla is a foundation that is clearly immersed in technology, and ignoring it altogether could leave you with a generic image that could be just as relevant to a provider of, say, health care services.</p> <p>But I think you’ll do well to de-emphasize the tech in the design choices, even at the risk of being a tad generic. People will have a visceral response to whatever logo you choose; better to err on the side of warmth than technological coolness.</p> <p>That being said, my comments on the specific designs:</p> <p>1. The Eye. Most people have an aversion to reptilian eyes; it’s probably imprinted on our DNA as our ancestors sought to avoid deadly run-ins with venomous reptiles, or being eaten alive by alligators and crocodiles.</p> <p>Plus, most people associate reptiles with cold-bloodedness or just “coldness” — an unattractive property. Think of a soft bunny. Now think of a monitor lizard. In your mind you are drawn to one, and are compelled to avoid the other. Reptiles don’t make you scream “warm and fuzzy” — they just make you scream.</p> <p>The eye = No.</p> <p>2. The Connector. Ahhh … this is my favorite. It provides a very distinctive connection between the symbology of tribalism — a people-centric concept — and circuit traces and program paths — the technology aspect. And “openness” is symbolized in the logo by non of the lines connecting to each other, and being able to reorganized in many different configurations.</p> <p>Finally, the fact that the logo very subtly spells Mozilla gives it one of the key characteristics of a good logo: ambiguity — and the “aha!” factor of discovery and delight.</p> <p>The connector = big yes from me.</p> <p>3. Open button. This logo emphasizes a mechanism of technology, as I mentioned in my big-picture comments above. Despite its ability to be reconfigured, it is still at its core a power button, and does not emphasize the concept of “peopleness.”</p> <p>The open button = No.</p> <p>4. Protocol. Same comments as 3., above. Technology mechanism-based, and not people-based. Also, while the use of the “slash-dot” notation is clever, it does not have the same discovery and delight factor that, say, The Connector does. It’s just a tad _too_ obvious.</p> <p>Protocol = No.</p> <p>5. Wireframe world. This is kind of okay, but again, it emphasizes _structure_ over peopleness. The wireframe is evocative of openness, which is a good association, and also implies a technology aspect, but on balance, there isn’t much that is aspiration about this mark.</p> <p>Wireframe world = No.</p> <p>6. The Impossible M. Aside from the optical-illusion fun of the design, it looks more like a rejected MTV logo design from the ’80s, with its pop art-like Ben Day dots and Roy Lichtenstein colors. As art, it works, but it doesn’t really _say_ anything about Mozilla’s values.</p> <p>The Impossible M = A half-hearted No. The other half is Yes for whimsy.</p> <p>7. Flik Flak. I kind of like the Transformers-like expansion, and the fact that it, too, spells Mozilla — although I thought the letters were a little harder to discern than those in The Connector. Points for symbolizing openness (reconfiguration), whimsy, and perhaps a nod to peopleness with its implication of something built by community. But negative points for complexity. I feel this mark would be difficult to decipher at smaller sizes, and hence comes across more as confusing than delightful.</p> <p>Flik Flak = Another half-hearted No.</p> <p>Hope these comments help. Opinions are subjective, and YMMV! LOL.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Sabrina","date":"2016-08-23T00:00:00.000Z","content":"       <p>The logo aside, I’m more curious about the application in which the final product will manifest. Mozilla is a screen based brand and ultimately the very nature of the product is based on the internet, a non-physical experience.</p> <p>So, I’m curious, why are all of the applications so basic? </p> <p>The brand should be less about the logo and more about how it lives in a digital space. A cap and t-shirt are all good and fine but feels like a missed opportunity to not focus more on the actual product experience. And to add to that, brand is increasingly less about a logo and more focused on interaction and experience.</p> <p>Feels impossible to judge any of this visual development without seeing it in it’s natural place. Thoughts?</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Tim Murray (@Timotay)","date":"2016-08-23T00:00:00.000Z","content":"       <p>It’s a great question, Sabrina. Thanks for asking it. In this first round of initial concepts, we’re seeing which aspect of the Mozilla story we might want to lead with in words and visuals. Our agency partner johnson banks has done some preliminary studies of how some of these designs might animate or be influenced by the Web, and we’re confident that interaction and animation are possible for each. Given that we’ll be distilling these seven choices down to approximately three, we’ll likely save further work in that direction for a smaller subset of choices. Thanks for the reminder that most of this work will be seen on a screen and that motion will be a part of how the brand is expressed.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Adrian day","date":"2016-08-25T00:00:00.000Z","content":"       <p>This exercise in audience participation has had great coverage but I’m concerned about the approach. A brand identity exists to represent and communicate the underlying brand. That brand has a positioning, a proposition and a personality – to express that brand through the identity the designers need to understand the brand in depth. The public don’t have that depth of understanding and aren’t experienced in judging how well an identity captures the brand (indeed clients often find it hard).  Sure, research the final shortlist of identities with key stakeholders to check for negatives but choosing a brand identity is not like choosing a piece of art or home furnishings or clothes.  Johnson Banks is a very good firm who have created some great identities; I very much doubt the final design will represent the brand better because the people have chosen.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Janis Greenspan (@jgreenspan)","date":"2016-08-25T00:00:00.000Z","content":"       <p>Thanks so much for your thoughtful input, Adrian.  This exercise has been informative both in terms of content and process.  You bring up a good point that there are lots of different kinds of feedback.  This is one of the reasons that we aren’t running a survey, we don’t think voting is an appropriate way to add value to the project, sharing thoughts and opinions is.  We’re synthesizing all of the thoughts and opinions, filtering them through the brand positioning and strategy.  Great point.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Sebastian","date":"2016-08-25T00:00:00.000Z","content":"       <p>Somehow I’m disappointed about all the initial concepts. Even though I was excited about a new brand identity when I heard about it. The word mark is very basic and just doesn’t work in a lot of areas.</p> <p>Maybe I am just disappointed because I was secretly hoping the dinosaur would come back in some form. Thinking more about it I actually wonder why Mozilla does not embrace it: It’s all over the place, a bunch of people already associate it with Mozilla and personally I think it can convey the message(s) Mozilla has to say. However it is outdated and is in need for a fresh look and guidelines (not reducing it to an eye).</p> <p>The other thing that is disconcerting for me is that there’s no connection between the current word mark, colors and style. It’s like the goal was to create something that is as far away from everything already existing as possible.</p> <p>Attached images are from: <a href=\"http://thewebrocks.com/dinocards/#dino1\" rel=\"nofollow\">http://thewebrocks.com/dinocards/#dino1</a></p> <div class=\"comment-image-box\"> <p class=\"comment-image-reloaded\"><a class=\"cir-image-link image-id-353\" href=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/08/thedino.png\"><img width=\"600\" height=\"410\" src=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/08/thedino-600x410.png\" class=\"attachment-baseline-mini-grid-thumb size-baseline-mini-grid-thumb\" alt=\"thedino\" sizes=\"(max-width: 768px) 600px, (max-width: 1000px) 160px, 300px\"></a></p> </div>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Jim","date":"2016-08-25T00:00:00.000Z","content":"       <p>Ok, hold on here. I understand that Mozilla technically does more than Firefox, but that’s seriously the only project I could find from a quick browse on the homepage. What happened to Sunbird, Thunderbird, FileZilla, and the numerous other projects to be found here not so many years ago? Honestly, Firefox never screamed Mozilla at me so much as the products I can’t find any longer. That 30% figure seems kind of high given this.</p> <p>Am I being optimistic, or are some of these wonderful tools coming back to center stage?</p> <p>Also, no eye. That thing freaks me out without the societal implications.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Tim Murray (@Timotay)","date":"2016-08-28T00:00:00.000Z","content":"       <p>Thanks for sharing your perspective, Jim. This brand identity exploration is the final step in a months-long process that’s included organizational strategy (a 5-year plan), research to learn who follows Mozilla today and who might be interested in joining us in the future, a definition of the core issues we want to communicate about, a refined understanding of our position in the market of ideas, and work on our brand personality and tone. When you visit Mozilla.org in a few months, we hope that will present a clearer view of our purpose in the world through our people, technology, and products. So while we’ll showcase innovative new tools, we’ll also tell a more complete Mozilla story with the help of our brand identity. Thanks again for being a part of this conversation.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Teradyne Ezeri","date":"2016-08-30T00:00:00.000Z","content":"       <p>I hate to say this, but that sounded like a mass of marketing and buzzwords, not something representative of a project for “the people of the web”. In fact, it honestly sounded like something that came through a PR department, rather than a member of the Mozilla community.</p> <p>Mozilla’s greatest asset is its community, made of people from around the world and from all sorts of backgrounds. People who butt heads and speak bluntly, without obscuring the message with paragraphs of corporate jargon. In fact, it’s that bluntly open attitude that’s managed to help Mozilla become a protector of both privacy and openness on the web itself.</p> <p>Maybe that’s why some people are rather put off by a lot of this, because I know this very post I’m replying to is what made me realize why I’m irked. It feels like this is just part of a corporate attempt to make Mozilla into a business, and the use of very business-oriented speech regarding this push to choose a new brand design language doesn’t help that image at all. </p> <p>As a long-time fan and advocate of Mozilla (even when I complain very openly about mistakes and missteps along the way), I see someone who is approaching this from a distance as part of “business as usual”, rather than a loose and casual member of Mozilla’s community. Not seeing that casual attitude in your replies—or some of your posts—makes it feel like this is something the community is only participating in, rather than a campaign that’s driven by actual Mozillians.</p> <p>That’s just my 2 pence, though. Take it as you will.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Tim Murray (@Timotay)","date":"2016-08-31T00:00:00.000Z","content":"       <p>Hi Teradyne, </p> <p>First, I’m sorry. I failed to write simply to get the point across. I have left you with a feeling that I have an agenda that goes against what’s good for Mozilla. That was not my intention. I hope that one day we can meet in person instead of through pixels. I’d like to learn more about your experience with Mozilla and share mine with you. </p> <p>Let me introduce myself. My name is Tim and I am a Mozillian. I have been a Firefox user from the early days, and Mozilla staff member for more than a year. I came to Mozilla to help more people recognize us and understand what we do. That is what I have to offer this movement.</p> <p>Like any disciplines, marketing and branding use particular words to mean certain things. In my attempt to describe the process that got us here, to this step of exploring what our brand might look like, I made a lazy choice to use unfamiliar terms. I’ll try to be more clear this time.</p> <p>Mozilla must evolve how we talk about ourselves. Research conducted around the world shows that people don’t understand what we do (aside from making Firefox) and why we are here. Our community of volunteer contributors, our belief in putting people before profit, our role in keeping the Internet open — these are mostly invisible to our audience despite how passionately we believe in them.</p> <p>Our brand – not just how we look but what we talk about and how we say it – is a tool to help people understand us. While our community is helping to shape the brand, we are also tapping into designers outside the community, as well as current and potential users and supporters. Like open-source code, open design requires a combination of experience and many minds working together.  </p> <p>Thanks for reminding me to speak more clearly. Please let me know if this reply has not made a difference, and I’ll keep trying until it does.  </p> <p>I am grateful to be a Mozillian and to have been welcomed to link arms in this effort. I in turn look forward to greeting newcomers, making room for them, and discovering what talents they have. There are enough chairs at this table for everyone. Take care.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Teradyne Ezeri","date":"2016-08-31T00:00:00.000Z","content":"       <p>Thank you for making this a little more personal, and a little less corporate. I’m posting my full thoughts regarding the designs, and it’s good to see a post that feels more “human” than “business”.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Rackskop","date":"2016-08-25T00:00:00.000Z","content":"       <p>While I can understand the thinking behind this search I agree on one hand with gourdcaptain that the lack of knowledge may be the result of lack of actual projects being communicated to the public or even lack of projects themselves and then on the other hand I feel like this is a spec progress with novice contestants which will result in a fail if not consulted by professional guidance.</p> <p>You got a really strong text logo with a top notch typeface and I don’t see why you would want to change that. As it is, it can be 50 years or more from now.</p> <p>Furthermore even for a first concept a lot of the showcased approaches lack thought if it wasn’t for the contextual explanation. Almost none of these logos could stand for themselves without being accompanied by the additional word mark. There’s interesting ideas about the metaphor, but the logo is a visual representation of your work. If you’re a carpenter that could be a hammer, if you’re a painter that could be a brush. You think this sounds old, simple minded and ugly? Well just draw a nice one weight stroke brush logo with a hipster touch to it and it will be awesome but only for a few years of hype.</p> <p>That said “the connector” and the “flik flak” are strong visual concepts (not new in any way) with huge flexible potential but just as much can it be a complete fail if not executed by a very capable graphic designer who does a lot of pattern design.</p> <p>I don’t quite understand why you wouldn’t approach the online design communities with this (well don’t know if you did but to be honest the results don’t seem like it) I bet there’s quite a few of top notch designers out there who would love to gift some of their work time to this open source project (there’s a lot who wouldn’t as well). Hell there’s even people doing redesigns for projects that didn’t even ask for it, and some of them do them quite well.</p> <p>Sooo…if I had to vote I’d vote for…none. Keep the word mark and get marketing…Maybe find a very simple logo for the mother of the fox(!) to accompany the word mark. That would relate and make sense. But I guess it’s a bit late for that.</p> <p>Good luck! I hope you don’t release something without proper consultation from experts. Sounds elitist? I don’t care! Because I really like Mozilla and their history.</p> <p>Best regards</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Tim Murray (@Timotay)","date":"2016-08-26T00:00:00.000Z","content":"       <p>Thanks for your comment Rackstop, and your support of Mozilla. If you have the inclination and want to learn more about how this process came about, and the selection of our agency partner johnson banks with whom we’re working on this open design project, please have a look at some of the earlier posts in this blog. While the work you’re viewing has not been generated by our community, it has been informed by comments made on earlier posts about what story Mozilla wants to lead with as it reintroduces itself to the world. Our final design selection will be the wrapper for Mozilla stories about the people, technology and products that are making the future Internet. It’s the final step in a process that has included business strategy, market analysis, consumer research, positioning, and brand personality. Thanks again for being a part of this conversation.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Rackskop","date":"2016-08-26T00:00:00.000Z","content":"       <p>Thanks for guiding me here Tim, I do see clearly now. Sorry for the offense. I agree with other people before me. I personally have had situations getting out of control because I had the first meetings with more than one or two responsible persons/clients even more so when my concepts weren’t absolutely strong and I myself convinced of them which makes things easier to sell/present. And here is you (the client) asking a broad public for their opinion on a variety of first ideas.<br> Others as well said it: Very brave move to publish this. I hope you don’t get confused in the process.</p> <p>Still so, the first concepts don’t relate in my opinion. Sebastian mentioned the dinosaur which I already had forgotten. That could be history to work on. Also I’ll repeat myself saying that you shouldn’t just trash your very polished word mark with the lowercase “m”. Lots of big firms don’t need logos. Just their name. It’s their brand mark.</p> <p>I’d say to Johnson Banks: “Keep it simple!”. You’re trying too hard. Look at their website. The prominent overall visual impression is you! It’s the word mark “mozilla”. That just works!</p> <p>Don’t know if this was mentioned before: If you want to have something connecting every past and future thing, as the head brand of things like FireFox, ThunderBird and SeaMonkey why not visualize the mother/head/origin of elements or animals? Something along those lines and name future events/projects accordingly. Just not too bloated. Not too abstract.</p> <p>This will be a very interesting process to follow for many people. Hope you get what you deserve in the long run. Don’t be shy to demand things over our public heads.</p> <p>Sincerely</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Teradyne Ezeri","date":"2016-08-31T00:00:00.000Z","content":"       <p>I’ve finally given my thoughts for each design on their respective pages, but I’d like to take a moment to mention something. First, I’d like to share what one of my boyfriends said about this subject:</p> <p>“Hello Mozilla. My friend has asked me to put a word in about the redesign project you are going through, and as I am not a UX designer or anything of the sort, I guess you could say my perspective is from that of a user/consumer. So here’s my two cents.</p> <p>You say that people only think of Mozilla as ‘the guys that make firefox’, and while this may be true in many aspects, these designs you are showing me tell me..well..nothing about Mozilla. They all look business like rather than personable, as you say you want to be seen. I look at those and wonder ‘what does any of this have to do with Mozilla?’.</p> <p>You have two mascots. The Firefox and Mozilla himself. You incorporated Firefox not only into the logo, but into many of the visuals on pages where Firefox itself is downloaded, and where you have information on it.</p> <p>Why do you ignore the little dinosaur that has grown with your company? Does he not represent you anymore? I would think that Mozilla the mascot would be more expressive than businesslike designs. After all, with all these designs you’ve shown me, I get no ‘feel’ of the company. Instead, what I feel is ‘well that’s boring’. </p> <p>Again, I’m no visual designer, just a consumer/user. But if you want me to feel the ‘Mozilla meaning’ whenever I visit/use something of yours, I’d like to think you want ‘this is who we are’ to be more than something that says ‘business as usual’.”</p> <p>With that passed along, I want to echo something that he said: The designs don’t feel like “Mozilla”. Rather, for me, they don’t feel like Mozilla _on their own_. Each of them fail when used individually, but when used together properly, they could form much more amazing designs. Much like the community itself having people who specialize in individual fields, combining some of them can make a greater “whole”.</p> <p>Try combining “The Impossible M”‘s logos with the general design of “The Connector”, or “Protocol”‘s main logo and theme with “The Impossible M”‘s project-specific logos. I think they’d look much better, and possibly be able to better convey Mozilla’s “brand” together than they could on their own.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Oge","date":"2016-09-15T00:00:00.000Z","content":"       <p>I love firefox, it’s great and brandable; It becomes great via experience.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"},{"name":"Tim Murray (@Timotay)","date":"2016-09-16T00:00:00.000Z","content":"       <p>Thanks for using Firefox, Oge! This work relates to the Mozilla brand, not to Firefox. Mozilla does much more than make an open-source browser. To learn more, please visit <a href=\"https://mozilla.org\" rel=\"nofollow\">https://mozilla.org</a>.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/now-were-talking/"}]