[{"name":"Tim Murray (@Timotay)","date":"2016-03-04T18:49:39.000Z","content":"        <p><strong><em>“It’s about time!”</em></strong></p><p><strong><em>“Didn’t you already do that?”</em></strong></p><p><strong><em>“It’s not broken, so why fix it?”</em></strong></p><p>When Mozillians hear that we’re updating the Mozilla brand identity, they respond with enthusiasm, impatience and confusion in equal measure. A brand identity – &nbsp;logo, tone, tagline, typeface &nbsp;– isn’t something to be trifled with, especially with a brand as well respected as Mozilla.</p><p>Here’s what’s happening.</p><p>Back in late 2014, the creative team began working on a new look for Mozilla, a so-called living logo. The graphic heartbeat of this logo came from real-time data about our engagement with the world. Having a brand identity that reflected the daily number of Bugzilla requests, Mozilla contributors, and Firefox users, for instance, was a brilliant idea. Except that, in the end, it couldn’t be made to work. Chalk that experience up to good learning.</p><p>Fast forward to today. As you heard Chris say onstage in Orlando, our mission and vision are now clearer and stronger than before. We’ve built&nbsp; a new brand position for Mozilla: <b>being a true personal advocate for online life. </b>We promise to advocate for people both within their online experience and on their behalf for the health of the Internet.</p><p>From that solid foundation, we’re ready to explore how our brand will look and sound in the world, reinforcing what we believe and what we can deliver. A 2016 goal for Mozilla is to Grow Our Influence in the world, and a new identity will make it easier.</p><p><b>Why are we doing this now?</b></p><p>Brands need to evolve to stay relevant. Introducing a refreshed identity will be a milestone for Mozilla, will provide a new badge of belonging to our movement, and will help tell the world what we stand for. When more people grok our mission, they will want to walk shoulder to shoulder with us and contribute more. Yes!</p><p>The need for a new Mozilla identity is also long overdue (see posts below). The &nbsp;word “Mozilla” and a handful of muted colors are no match for modern communication. Lacking an icon to represent our brand in social media, for instance, we have shown up as a heart, a whimsical unicorn, and even a famous candy. (Mozilla melts in your mouth, not in your hands?) Our whole organization, especially our Mozilla global communities, is eager for direction and a bigger toolkit of creative assets.</p><p>Like everything at Mozilla, this will be open source, including:</p><ul><li>An invitation to contribute. If you have an idea for what the Mozilla brand identity should look like, please write to me, send me a sketch or shoot a video. We’ll formalize design challenges through our <a href=\"https://github.com/mozilla/Community-Design\">Community Design github repo</a> as well.</li></ul><ul><li>A Brand Advisory Group. Made up of a cross-section of Mozillians, this group will bring different viewpoints and expertise to the table as we review our work in progress.</li></ul><ul><li>Access to working documents. Those who are interested and disclosed will be invited to view strategy, positioning, and briefing docs not available publicly.</li></ul><ul><li>An opportunity to geek out on branding stuff on the Engagement# Projects/<a href=\"https://wiki.mozilla.org/Engagement#Projects\">2016_Brand_Identity_Initiative</a> on the Mozilla wiki.</li></ul><p><b>What’s next?</b></p><p>We’re now selecting an agency partner for this work. Following a few rounds of creative review (highlights posted here), we hope to have a new Mozilla identity defined and ready to share later this year.</p><p>Oh, and we’re also starting to think about the Firefox identity. But that will have to wait for our next post.</p><p>Meanwhile, the comments box awaits your cursor.</p><p>&nbsp;</p>      ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/creative/2016/03/04/mozilla-is-getting-a-new-brand-look/"}]