[
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-09-16T00:05:31.000Z",
    "content": "    <div>Since posting the seven initial design directions for the Mozilla brand identity three weeks ago, we’ve continued to shape the work. Guided by where Mozilla is headed strategically, principles of good design, and the feedback we’ve received through this open process, today we release four design contenders. These will continue to be refined over the course of the next two weeks, then put through global consumer testing. We expect a brand identity recommendation to emerge in October.</div><div><img class=\"alignleft size-full wp-image-462\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/jb_Mozilla_first_round_all_up.jpg\" alt=\"mj_tm_Moz_Nashville_edits for new pics.key\" width=\"720\" height=\"411\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/09/jb_Mozilla_first_round_all_up.jpg 720w, https://blog.mozilla.org/opendesign/files/2016/09/jb_Mozilla_first_round_all_up-300x171.jpg 300w, https://blog.mozilla.org/opendesign/files/2016/09/jb_Mozilla_first_round_all_up-600x343.jpg 600w\" sizes=\"(max-width: 720px) 100vw, 720px\"></div><p>If you’re just joining this process, you can get oriented <a href=\"https://blog.mozilla.org/opendesign/designing-in-the-open/\">here</a> and <a href=\"https://blog.mozilla.org/opendesign/now-were-talking/\">here. </a> We’re&nbsp; grateful that this process has sparked such interest among Mozillians, those who care about Mozilla, and the global design community—dozens of articles, hundreds of tweets, thousands of comments, and perhaps tens of thousands of words of feedback. As believers in transparency at Mozilla, we consider this a success.</p><p>Thanks to all of you who have added your voice to the conversation. Your many constructive comments and suggestions have helped us chart a path forward. Some of you will find that your favored design directions have been let go in the pursuit of something better. We hope you’ll find a design here that you feel best represents Mozilla today and tomorrow.</p><p><img class=\"alignleft size-full wp-image-461\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/jb_Mozilla_first_round_all_up_slashed.jpg\" alt=\"mj_tm_Moz_Nashville_edits for new pics.key\" width=\"1500\" height=\"933\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/09/jb_Mozilla_first_round_all_up_slashed.jpg 1500w, https://blog.mozilla.org/opendesign/files/2016/09/jb_Mozilla_first_round_all_up_slashed-300x187.jpg 300w, https://blog.mozilla.org/opendesign/files/2016/09/jb_Mozilla_first_round_all_up_slashed-600x373.jpg 600w, https://blog.mozilla.org/opendesign/files/2016/09/jb_Mozilla_first_round_all_up_slashed-1000x622.jpg 1000w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"></p><div><b>Some that we’ve left behind.</b></div><div>Of our original seven, four have fallen by the wayside, one has remained intact and two others have directly led to new ideas. We have let go <a href=\"https://blog.mozilla.org/opendesign/design-route-c-the-open-button/\">The Open Button</a>, which upon further study we found lacked a clear connection to Mozilla’s purpose, and <a href=\"https://blog.mozilla.org/opendesign/design-route-g-flik-flak/\">Flik Flak</a>, which had its fervent supporters but was either too complex, or too similar to other things, depending on your point of view.</div><p>For many, The Impossible M was an early favorite, but we discovered that it was just too close to other design treatments already in the public domain. The Connector stayed in the running for some time, but was eventually overtaken by new ideas (and always slightly suffered from being a bit too complex).</p><p><strong>What we resolved to do next.</strong><br>Working in tandem with our London agency partner johnson banks and making the most of our time zone difference nearly around the clock, we agreed to redirect efforts toward these design goals:</p><ul><li>Focusing first on the core marks, particularly on their visual simplicity, before figuring out how they extend into design systems.</li><li>Exploring the dinosaur. From the blog feedback, it was clear that we had permission to link more directly back to the former dinosaur logo. Aside from The Eye, what other paleo elements might we explore?</li><li>Celebrating the Internet. Rather than seeking ways to render the Internet in three dimensions (as Wireframe World and Flik-Flak had bravely attempted to do), might be influenced by the random beauty of the Internet works and how people use it?</li><li>Refining and simplifying the two routes, Protocol and Wireframe World, that showed the most promise in the first round.</li></ul><div><b>How the work links to the core narratives</b></div><div>At this stage of the project, we’re down to four overarching narratives, three from the original set and a new one:</div><p><strong>The Pioneers:&nbsp;</strong>This is still a strong and resonant territory, and one that works well with at least one of the final four.<br><strong>Taking a stand: </strong>This positioning emerged directly from our earliest discussions and is still very strong.<br><strong>The maker spirit: </strong>We’ve seen from the first round, the community of Mozillians is vocal and engaged and is key to the organization going forward.<br><strong>The Health of the Internet:</strong> This is a new idea that posits Mozilla is a guardian and promoter of the Internet’s overall well-being.</p><div><strong>The Final Four</strong></div><div>Below is our continued work in progress on the four refined identity directions that we’ll take into testing with our key audiences. <strong>Please c</strong><strong>lick on the image to be taken to a page revealing the related design system, and make individual comments there.</strong> If you wish to compare and contrast these designs, please do so in the comments section below.</div><div></div><div><strong>Route One: Protocol</strong></div><div><a href=\"https://blog.mozilla.org/opendesign/route-one-protocol/\"><img class=\"alignleft size-full wp-image-460\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/Protocol_master_logo-2.gif\" alt=\"protocol_master_logo\" width=\"1920\" height=\"1080\"></a></div><div></div><div><strong>&nbsp;</strong></div><div><strong>Route 2: Burst</strong></div><div><a href=\"https://blog.mozilla.org/opendesign/route-three-burst/\"><img class=\"alignleft size-full wp-image-421\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/Burst_rotating.gif\" alt=\"burst_rotating\" width=\"820\" height=\"586\"></a></div><div></div><div><strong>Route 3: Flame</strong></div><div><a href=\"https://blog.mozilla.org/opendesign/round-two-flame/\"><img class=\"alignleft size-full wp-image-444\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/Flame_flicker.gif\" alt=\"flame_flicker\" width=\"1069\" height=\"1065\"></a></div><div></div><div></div><div><strong>Route 4: Dino 2.0</strong></div><div><a href=\"https://blog.mozilla.org/opendesign/route-four-dino-2-0/\"><img class=\"alignleft size-full wp-image-436\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/Dino_2.0_chomping1.gif\" alt=\"dino_2-0_chomping1\" width=\"1128\" height=\"1076\"></a>So there you have it: four final directions. Let us know what you think!</div><div></div>      ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Tehmul Ghyara",
    "date": "2016-09-15T00:00:00.000Z",
    "content": "       <p>Dino 2.0 combined with Protocol :)</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Justen Stall",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>Yeah if there was a logical way to blend elements of a dinosaur into Protocol, that would be awesome</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Filippo Gianessi",
    "date": "2016-09-23T00:00:00.000Z",
    "content": "       <p>I agree, but maybe the dino is too related to google chrome, if I think of dinosaurs plus browsers, I think to the chrome’s offline mini-game.. Don’t know, just a thought I had!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Sinchan",
    "date": "2016-09-25T00:00:00.000Z",
    "content": "       <p>How about this combo of Dino + Protocol?</p> <div class=\"comment-image-box\"> <p class=\"comment-image-reloaded\"><a class=\"cir-image-link image-id-479\" href=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/mozillalogo.png\"><img width=\"223\" height=\"100\" src=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/mozillalogo.png\" class=\"attachment-baseline-mini-grid-thumb size-baseline-mini-grid-thumb\" alt=\"mozillalogo\" sizes=\"(max-width: 768px) 600px, (max-width: 1000px) 160px, 300px\"></a></p> </div>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Sinchan",
    "date": "2016-09-25T00:00:00.000Z",
    "content": "       <p>Higher res version!</p> <div class=\"comment-image-box\"> <p class=\"comment-image-reloaded\"><a class=\"cir-image-link image-id-480\" href=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/mozillalogo-1.png\"><img width=\"600\" height=\"300\" src=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/mozillalogo-1-600x300.png\" class=\"attachment-baseline-mini-grid-thumb size-baseline-mini-grid-thumb\" alt=\"mozillalogo-1\" sizes=\"(max-width: 768px) 600px, (max-width: 1000px) 160px, 300px\"></a></p> </div>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Leônidas",
    "date": "2016-09-22T00:00:00.000Z",
    "content": "       <p>THIS!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Ybalrid",
    "date": "2016-09-22T00:00:00.000Z",
    "content": "       <p>Great idea!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Dustin Emory",
    "date": "2016-09-25T00:00:00.000Z",
    "content": "       <p>Yes! Exactly what I was thinking as well.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "nnethercote",
    "date": "2016-09-16T00:00:00.000Z",
    "content": "       <p>Round 2 is a lot stronger than round 1! Good to see.</p> <p>Burst does nothing for me. Busy, uninspiring, doesn’t mean anything. The other three are all pretty good. Though Dino 2.0 looks like a stapler, and might be too cute for its own good, and age badly. Protocol was my favourite from the first round, and I still like it a lot. Flame looks good, but I’m not sure about the connection to Mozilla.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Seth Angel",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>Burst while I agree with you that it’s busy, it’s pretty obvious that the different colored bursts are connected in a large “M” which forms the center of the logo.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Gerald",
    "date": "2016-09-16T00:00:00.000Z",
    "content": "       <p>First impressions, from best to worst:<br> 1. Protocol: Still one of my favorite ones, thank you for exploring it further.<br> 3. Flame: I really like the look &amp; animation, but I have difficulty seeing the ‘M’ in it.<br> 4. Dino stapler: Meh, a bit too simple. Childish-looking?<br> 2. Burst: Headache-inducing for me. Literally, I can’t look at them for longer than a few seconds! :-(</p> <p>Is it ok to pinch some of the discarded designs? They’d make nice t-shirts! (Personal printing of course.) If yes, could you please store high-def versions somewhere, e.g.: assets.mozilla.org?</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Michelle Marovich",
    "date": "2016-09-16T00:00:00.000Z",
    "content": "       <p>I love bringing back the Dino.  I’d vote for that in a heartbeat.<br> But on first glance the current design is Wilson’s red stapler from Office Space.  I can’t unsee the stapler, which seems to be pretty antiquated for an internet organization. </p> <p>The flame idea is nice but, like Burst, it doesn’t say anything to me.  The animation is busy and Burst also hurts my eyes.  </p> <p>I’m left with Protocol as the only really solid choice out of these 4.  I wish it incorporated  the Dino color scheme in some way.  </p> <p>I do appreciate your process, patience and willingness to engage Tim, we are definitely getting somewhere!</p> <p>Protocol is my current only choice then.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "esphen",
    "date": "2016-09-16T00:00:00.000Z",
    "content": "       <p>Great to see the return of the dino! I always loved that guy. Also, I feel red is Mozilla’s colour. Hopefully you will explore variations of that logo</p> <p>Though protocol is promising, the blue is a bit dominant, and it still has issues with looking eerily similar to the curl logo</p> <p>The other two logos are just not good enough for mozilla!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Gene Wood",
    "date": "2016-09-16T00:00:00.000Z",
    "content": "       <p>I agree with nnethercote that this round is much better than the first.</p> <p>Burst : This doesn’t speak to me, it seems very abstract<br> Dino 2.0 : This looks too childish and I don’t think sends the right message about Mozilla<br> Protocol 2.0 : This one is ok, I like the idea, the blue and white doesn’t look great to me<br> Flame : I like this one, if I had a vote I’d say this is the way to go.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Camden Narzt",
    "date": "2016-09-16T00:00:00.000Z",
    "content": "       <p>My opinions for what they’re worth:</p> <p>Protocol: Still my favorite.<br> Flame: Reminds me of Tinder, not a good thing.<br> Dino: Looks like a stapler, need to add at least one tooth.<br> Burst: Scrolling that down the page gives me a headache.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Theo Albers",
    "date": "2016-09-16T00:00:00.000Z",
    "content": "       <p>I like simple designs, so that leaves Protocol and Dino 2.0. I think red is a bad choice, since <a href=\"https://www.quora.com/Why-is-red-colour-associated-with-danger\" rel=\"nofollow\">https://www.quora.com/Why-is-red-colour-associated-with-danger</a>. Blue could be associated with no risks, boring.<br> I’m a big fan of the Firefox logo especially because of the world association.<br> What about the Protocol logo, but without blue background and with some nice font / color.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Kal",
    "date": "2016-09-22T00:00:00.000Z",
    "content": "       <p>Except red is also known to draw in the most customers. Red is the best color choice for company logos, with blue being a good second … at least that was what I read a few years ago.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Les Orchard",
    "date": "2016-09-16T00:00:00.000Z",
    "content": "       <p>Burst &amp; Flame look like fun HTML5 Canvas demos, but not what I’d really want to use as a logo. Burst also hurts my eyes with the moire patterns, FWIW. </p> <p>Protocol is nice &amp; old-school, kind of against the grain of a lot of modern browsers hiding the http:// in the URL bar. Still, nice emphasis on the web in our DNA</p> <p>Dino, I like the best, because I’ve always loved the Mozilla dinosaur and have been sad &amp; disappointed when I hear word that our branding plans get farther &amp; farther away from those roots.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Regnard Raquedan",
    "date": "2016-09-16T00:00:00.000Z",
    "content": "       <p>How I would rank it:</p> <p>1 – Dino 2.0<br> 2 – Protocol<br> 3 – Flame<br> X – Burst</p> <p>While the Dino looks a bit childish, it exudes the friendly, accessible, and open values of Mozilla. Protocol looks a bit cooler, but there is an aspect of pretentiousness that divides a line between techies and non-techies.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Nathan Bylok",
    "date": "2016-09-16T00:00:00.000Z",
    "content": "       <p>This second round definitely shows a lot of refinement and I am all for positing that Mozilla being a guardian and protector of the web!</p> <p>Of these four I see Protocol and Dino as the strongest identities going forward. Burst and Flame, I feel, have at best abstract associations with Mozilla’s mission, and could just as easily work for brands associated with music, marketing, etc. Flame also reminds me of Drupal’s logo, if we are speaking to associations.</p> <p>Of the two I like, Dino is my absolute favourite! First impressions are of a brand with a lot of personality and memorability. It will be very easy for people to recall this logo, and the identity that can be built around it will be personable and captivating, to say nothing of going back to Mozilla’s roots (I had, full disclosure, thought the last iteration of Dino to be conceptually the weakest of its bunch and had advocated for other concepts in that round). That said, I agree with the comments above in that it may be too childish at present. Some exploration of the personality of that dino is in order!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Nathan Bylok",
    "date": "2016-09-16T00:00:00.000Z",
    "content": "       <p>First sentence should be:<br> This second round definitely shows a lot of refinement and I am all for positing that Mozilla is a guardian and protector of the web!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Allen Meyer",
    "date": "2016-09-16T00:00:00.000Z",
    "content": "       <p>Protocol: This has the feeling of inevitability about it. It is a strong, playful and well, a bit safe. It is a vast improvement over the current word mark. I am a bit concerned the entire visual language is mostly typographic based and perhaps a bit impersonal. Which leads me to:</p> <p>Dino 2.0: As much as I loved the graphic strength of the first version, I was deeply concerned about unintended associations. Dino 2.0 really challenges the status quo and is memorable. There is something a bit too childish about it, it’s gone too far from the first version, which leads me to:</p> <p>I’m with Temul here: Protocol + Dino 2.0 mashup!!!</p> <p>The other two:<br> Flame: The M in the flame is just not recognizable. If you want to play the negative space game, take a look at the FedEx logo/arrow mash-up for how this works. Fire: Lovely symbolism, but gosh, a bit too common, unless we want to have a strong relationship to FIREfox.</p> <p>Burst: Great strategic thinking here but the execution is kind of an art school exercise that hurts my eyes.</p> <p>One last thought: I’m attaching an image here from an email newsletter I got (the origin of which I’ve forgotten, I did not create it). I keep wondering, how is the new Mozilla logo going to look in the ecosystem of tech brands? I think a version of Protocol or Dino is going really stand out</p> <div class=\"comment-image-box\"> <p class=\"comment-image-reloaded\"><a class=\"cir-image-link image-id-472\" href=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/inside-design-hero.jpg\"><img width=\"600\" height=\"410\" src=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/inside-design-hero-600x410.jpg\" class=\"attachment-baseline-mini-grid-thumb size-baseline-mini-grid-thumb\" alt=\"inside-design-hero\" sizes=\"(max-width: 768px) 600px, (max-width: 1000px) 160px, 300px\"></a></p> </div>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Karla Hernandez",
    "date": "2016-09-22T00:00:00.000Z",
    "content": "       <p>Yo podria estar de acuerdo con esto un mashup de protocol y dino podria ser una mejor propuesta… aunque en lo personal ninguna me gusta. Como miembro mozilla no me identifico con niguna ni aun despues de leer el significado…</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Kal",
    "date": "2016-09-22T00:00:00.000Z",
    "content": "       <p>If they were to remove the background/outline from Protocol, it would fit in with those in that image perfectly. It could be very professional then.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Wesley",
    "date": "2016-09-16T00:00:00.000Z",
    "content": "       <p>I think that protocol is still my favourite, but I’d like to see it in the same color red that Dino 2.0 is, that way we can keep part of the original brand.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Pandeli",
    "date": "2016-09-17T00:00:00.000Z",
    "content": "       <p>Protocol</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "zweiohrmensch",
    "date": "2016-09-17T00:00:00.000Z",
    "content": "       <p>Protocol 2.0: still love like the idea. I think it’s the best idea. I really love it in the animated context like the Vimeo video. But please complete lowercase. ;) But in my opinion red is the Mozilla color and the logo should not be blue.</p> <p>Flame: It’s not bad as logo, but I don’t see the connection to Mozilla, not even the “M” of Mozilla.</p> <p>Burst: The worst of the four logos in my opinion.</p> <p>Dino 2.0: I love the return of the Dino! :) I don’t know if the dinosaur has to look like in this proposal, but the idea of bringing back the dinosaur is great! And it has the right color. ;)</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Andrei Petcu",
    "date": "2016-09-17T00:00:00.000Z",
    "content": "       <p>1 Protocol<br> 2 Dino</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Merowinger",
    "date": "2016-09-18T00:00:00.000Z",
    "content": "       <p>I like “Flame” a lot. Burst is not bad too.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "jack",
    "date": "2016-09-18T00:00:00.000Z",
    "content": "       <p>please choose logo that<br> – goes naturally with other image like Adobe.<br> – symbols new innovation</p> <p>“the protocol” is looks too old.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Erin Houseman",
    "date": "2016-09-18T00:00:00.000Z",
    "content": "       <p>This is such a dangerous way to evolve a brandmark and I feel for Johnson Banks to have to work like this. They will be rebranding in another 18 months. Design is subjective. People are adverse to change and will vote with what they know. Disappointing, Mozilla.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-09-20T00:00:00.000Z",
    "content": "       <p>Hi Erin, </p> <p>Thanks for contributing your point of view and for your empathy for our brilliant design partner johnson banks. One of the values in the <a href=\"https://www.mozilla.org/en-US/about/manifesto/\" rel=\"nofollow\">Mozilla Manifesto</a> points to how important we feel transparency and participation are to fostering trust and community. We are obligated to conduct this Open Design process in full view; we wouldn’t have it any other way; and johnson banks eagerly joined us in trying something different.  </p> <p>How should designers react to an ever more connected world? Do we continue to create in isolation or might we look for ways to include others in our creative process? We hope that this experiment may offer some clarity around those questions. We are not crowd-sourcing a solution or voting on a result here. No one has been asked to do spec work. And in addition to this online solicitation of comments, we’re holding live crit sessions and will be conducting a global consumer survey starting next week. All of these sources of feedback are valuable as we determine our path forward. We are making good progress. Although it may look messy, what design process at this phase doesn’t? </p> <p>Thanks for coming along for the ride. It will be interesting to see where we end up!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Riccardo",
    "date": "2016-09-19T00:00:00.000Z",
    "content": "       <p>Protocol</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "y6nH",
    "date": "2016-09-19T00:00:00.000Z",
    "content": "       <p>I like Flame as a thing, and it obviously links into the Firefox brand. This iteration isn’t strong enough, but maybe with a stronger “M” it would be a contender. Splitting it into dots doesn’t necessarily help.</p> <p>Protocol works, it’s nice and simple, but I find the blue really unpleasant. I get that it’s the default link colour, but it’s ugly and difficult to pair with other colours. Mozilla Red please!</p> <p>Dino2 is my favourite at this stage. Strong colours, and anything with a face draws the eye. But it’s too simple a form, it looks too much like an industrial product – I was thinking jack-knife instead of stapler, until it moved.</p> <p>Burst – nope. Looks boring and doesn’t scale.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Jim Cook",
    "date": "2016-09-19T00:00:00.000Z",
    "content": "       <p>Protocol. The logo and the “M:” is strong.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Sebastian Castiblanco Franco",
    "date": "2016-09-19T00:00:00.000Z",
    "content": "       <p>Protocol looks closer to what someone is expecting when is presented to Mozilla, other exercises are nice to explore, like BURST, but I think there are more experimental and less connected with a solid top-of-mind concept about this company.</p> <p>Although I love the BURST interactions shown in the video, the connected-negative M is an excepcional finding and does the job for me, this is the strongest road after Protocol, if BURST makes itself playable (and customizable) for the audience like shown in the video, it will give the sense of open, personalization, and adaptability. Concepts that are obviously taken in care by Mozilla.</p> <p>In conclusion:<br> Protocol: Strong visuals at time present, clear objectives and understanding, excellent visual execution and familiar.</p> <p>BURST: A step pushing forward, innovative, breaking the rules, daring and evolutive. Maybe a little hard to understand at first, but an opportunity waiting his chance. </p> <p>With that said, I’m happy that this options are stronger and it’s nice to see a great work in the background.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Nico",
    "date": "2016-09-19T00:00:00.000Z",
    "content": "       <p>Seriously: Burst &amp; Falme… I don’t even recognise Mozilla and its strong brand in it.</p> <p>Dino 2.0 is a more funny idea, but… I’ve the feeling of seeing a crocodile, not a dino.</p> <p>Protocol idea stays my favorite, but the execution REALLY needs to be improved, I think it was better in the first round.  :-\\</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Emily",
    "date": "2016-09-19T00:00:00.000Z",
    "content": "       <p>Dino! Such a strong branding tie-in. The others are all so generic. But agree it needs to be more dinosaur and less crocodile/stapler. The eye animation is super fun. I loved the first round dino too. Maybe there can be some fusion between that iteration and this one.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Alex Davis",
    "date": "2016-09-19T00:00:00.000Z",
    "content": "       <p>My favorites in order:<br> 1) The dino! Easy to read and back to our roots but now that someone said it looks like a stapler, I can’t help but see that too. lol Still my fav though. :)<br> 2) Moz://a . Although very geeky, it does remind me about how Mozilla tries to set standards in the web world. I can’t help but wonder why we deviated from red with this one. Seems like too many tech companies have blue text logos. (Twitter, Facebook, LinkedIn, etc.)<br> 3) Burst. Too busy. It doesn’t resonate with anything I know or associate to Mozilla.<br> 4) Flame. It’s pretty but I don’t see an M and I don’t know how anyone is suppose to associate this to Mozilla. Flames with Firefox, maybe… but flames with Mozilla, I don’t see it. I also wonder how much of its pazazz will be lost without the animation.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Ryan",
    "date": "2016-09-19T00:00:00.000Z",
    "content": "       <p>I’ve heard that over half of the code in Firefox is from volunteers.</p> <p>Much in the way that Unilever’s new brand identity reflects their multitude of brands, I think it would be great if the Mozilla logo could reflect how we’re composed of community.</p> <p>Schools of fish assuming a larger form?<br> Inter-locking part forming into a dino head?<br> Many Davids versus the Goliaths?</p> <p>I’m not sure. But at Mozilla, the whole of our community is greater than the sum of its parts. Would be nice to see this reflected (and obviously complement whatever is happening with the Firefox brand identity)</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Brad Werth",
    "date": "2016-09-19T00:00:00.000Z",
    "content": "       <p>1) Flame looks best and ties into our most familiar product. I also like the orange in the color treatments.<br> 2) Dino is fine but I feel like it needs teeth, literally and figuratively.<br> 3) Protocol feels like just another wordmark and I can’t see the advantages of adopting it. We already use “moz” as a preface on lots of things, and adding the colon and slashes doesn’t gain us much. If we’re going to reference protocols used in browsers, then the block serif font also feels out of place. The per-character color highlight around the letters is also unlike anything seen in the URL bars that we’re referencing. In summary, it’s a wordmark that kinda looks like a protocol (remember those?) but not really.<br> 4) Burst is not appealing at all. The colors look like fireworks, the lines look bad at small sizes, and the “M” is lost unless it’s paired with “Mozilla”, in which case what is it really adding to the text?</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Brad Werth",
    "date": "2016-09-19T00:00:00.000Z",
    "content": "       <p>From the post:<br> Exploring the dinosaur. From the blog feedback, it was clear that we had permission to link more directly back to the former dinosaur logo. Aside from The Eye, what other paleo elements might we explore?</p> <p>A dino footprint. If it’s got three toes and is facing downward, you could even make it evoke an “M”.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "André Jaenisch (@Ryuno-Ki)",
    "date": "2016-09-29T00:00:00.000Z",
    "content": "       <p>So an upside-down version of the attached image (it’s the logo of Sabayon Linux)?</p> <div class=\"comment-image-box\"> <p class=\"comment-image-reloaded\"><a class=\"cir-image-link image-id-485\" href=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/sabayon_5.4_logo.png\"><img width=\"300\" height=\"300\" src=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/sabayon_5.4_logo.png\" class=\"attachment-baseline-mini-grid-thumb size-baseline-mini-grid-thumb\" alt=\"sabayon_5.4_logo\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/09/sabayon_5.4_logo.png 300w, https://blog.mozilla.org/opendesign/files/2016/09/sabayon_5.4_logo-150x150.png 150w, https://blog.mozilla.org/opendesign/files/2016/09/sabayon_5.4_logo-32x32.png 32w, https://blog.mozilla.org/opendesign/files/2016/09/sabayon_5.4_logo-50x50.png 50w, https://blog.mozilla.org/opendesign/files/2016/09/sabayon_5.4_logo-64x64.png 64w, https://blog.mozilla.org/opendesign/files/2016/09/sabayon_5.4_logo-96x96.png 96w, https://blog.mozilla.org/opendesign/files/2016/09/sabayon_5.4_logo-128x128.png 128w, https://blog.mozilla.org/opendesign/files/2016/09/sabayon_5.4_logo-45x45.png 45w\" sizes=\"(max-width: 768px) 600px, (max-width: 1000px) 160px, 300px\"></a></p> </div>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Sarah Beth",
    "date": "2016-09-19T00:00:00.000Z",
    "content": "       <p>I appreciate incorporating the dinosaur that was inspired from the roots of Mozilla, but I feel there could be another way to incorporate it that isn’t necessarily in the logo itself (after all, branding and the visual identity is about more than the logo). Looking back at the problem with your visual identity in the first place, it could be helpful to look from a larger perspective and keep the logo simple without specific imagery. </p> <p>I do agree that this iteration of the dinosaur looks like a stapler. I also agree that when I think of Mozilla, I immediately think of warmer colors like red and orange. Exploring colors can be part of the last stage, but as far as form, the protocol concept seems the strongest and left a lasting impression on me. </p> <p>We really appreciate that you are keeping the discussion on your rebrand open to the public.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Jake",
    "date": "2016-09-19T00:00:00.000Z",
    "content": "       <p>Dino:<br> Looks like a stapler. Maybe an alligator at a push. Has no personality.</p> <p>Burst:<br> Ugly. Colours clash. Bland.</p> <p>Flame:<br> It’s a flame. Just a flame. Perhaps 13-year-old me would have thought it was cool.</p> <p>Protocol:<br> It’s got a colon and forward slashes because internet. Didn’t we drop this unsubtle nonsense in the 90s?</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Tenzin Jashar",
    "date": "2016-09-19T00:00:00.000Z",
    "content": "       <p>Allen Meyer brings up a good point about how the new logo will look in comparison to the logos of other software/tech companies.</p> <p>Protocol: Why associate your brand with an element that your developers have purposely hid in the FireFox browser address bar?</p> <p>Burst: Reminds me of a sales chart with figures that are ultimately trending downward.</p> <p>Flame: Will it scale well? How will it look on other mediums besides digital?</p> <p>Dino 2.0 :  This logo has the most promise. I like the use of your iconic dinosaur in this logo, but I echo the sentiment of others that it looks like a stapler. I also agree with others that it has a very juvenile feel to it.</p> <p>All in all, this set of designs trump the first set by miles. I hope that your corporation is able to find the logo that genuinely displays your desires and hopes for the future as well as your reverence towards past accomplishments.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Mark Lenthall",
    "date": "2016-09-20T00:00:00.000Z",
    "content": "       <p>Protocol – A vast majority of your audience won’t know or care what this means.<br> Burst – Did you guys take this from my local fireworks night flyer?<br> Flame – Will look dated within 24 hours of being released.<br> Dino 2.0 – Dinosaurs eat things.</p> <p>I may be being harsh, but none of the first round really got me going, and I’m still struggling to get over that hurdle in this second iteration.</p> <p>If the dinosaur thing is developed, it needs to be more subtle otherwise you’re just harking back to the past rather than looking to the future.</p> <p>Conceptually, the flame is the strongest as it seems to work from whichever viewpoint you choose and resonates with human beings, but it’s execution needs to be smarter.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "George Triadafillou",
    "date": "2016-09-20T00:00:00.000Z",
    "content": "       <p>Protocol is the definite route. The M: styling works well for social media and scales well for smaller screens (like phones) and smaller size Merchandise or branded items that are small or large. Things such as Profile photos on social media work well with the M:,  resolution and size wouldn’t be a problem. The M: would be easily recognized by users. People would look at it and think “That M followed by a colon. Oh! That’s Mozilla!” Protocol is also much easier to use on different colored backgrounds. I think it could be refined a bit but overall is definitely a good match for the brand.</p> <p>Burst is a definite no. It doesnt scale well and would look bad on mobile devices. It’s multiple colors can also make it difficult to work with different colored backgrounds. The m isn’t as instantly recognizable either.</p> <p>Flame Dino 2.0. isn’t a bad option but once again doesn’t work as well as Protocol for scaling etc. It kind of reminds me of a toy store too.</p> <p>Flame is nice but it represents itself. It’s a flame and doesn’t really feel relative to Mozilla or at least original to it. The average person would look at it and think Fire, or burning, or flammable.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Manuel",
    "date": "2016-09-20T00:00:00.000Z",
    "content": "       <p>Route 3 the flame is my favorite. Second is route 4, the dino.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Yorel",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>You should consider taking a real graphic design studio!<br> This is really bad, all idea are too literally, the fonts are badly design, there is no researches on a specific color, all logos look like they came out of the 90s.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "IknowShit",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>PR0T0C0L.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Yat",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>Also agree that Dino 2.0 looks too much like an upside down stapler. Especially when he closes his mouth and opens it again. Otherwise I do quite like it, although it does look a bit childish.<br> Burst kind of looks very bland and unexciting.<br> Flame reminds me of the dots/square that go up and down when you listen to music. Don’t love it or hate it.<br> Protocol is my favourite. Immediately obvious what Mozilla is all about. The coded-type look makes it seem like Mozilla is a fundamental part of the web.<br> This is so fun. I love Johnson Banks.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Greg K Nicholson",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>Mozilla is a red dinosaur.</p> <p>If we can’t use a variation of the old red dinosaur logo (for some reason that I haven’t yet seen stated publicly – is there one? what is it?), then this one will do.</p> <p>I like the interpretation as a megaphone – we’re all about communication and giving a bigger voice to smaller groups. If we could tweak the main Dino 2.0 logo so that it always looks a little more like a megaphone, I’d be sold.</p> <p>I’d really be disappointed if there was no clear lineage from the Hack poster to our new logo.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Nathan",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>Thanks for elaborating on each logo; reading through the separate summaries and the explorations of how the logos would work in different contexts was helpful.</p> <p>I don’t understand how Flame works as a logo; there’s nothing in there that’s readily identifiable as belonging to Mozilla.</p> <p>Burst is eye-catching, but the overlapping circles look way too busy, and if you don’t have the connected circle centers spelling out letters (as in the examples for countries, or even Mozilla-associated events), then there’s very little tying the logos back to Mozilla.</p> <p>My first reaction to Dino was, as people have noted above, the Office Space stapler…but Dino stands out in its “remixes” for country communities and other efforts (MDN, All-Hands, etc.).  The remixes really capture the nature of the events or communities while still integrating a strong Mozilla visual identity.  I’d almost pick Dino on the strength of the remixes alone.</p> <p>I like Protocol just because of my engineering bent, and its remixes work pretty well, especially the “M:” bit.  It is pretty focused on just one aspect of Mozilla’s existence, though, and I’m unsure how many people readily identify with protocols nowadays…</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Stephen Bell",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>Honestly, what will come out of this? How can you possibly take on all these comments and end up with any creative integrity? It brings to mind the quote….’ A camel<br> Is a horse designed by committee’ What I REALLY want to know as a potential consumer is what Mozilla think represents them and their vision best. Take some ownership, make a decision and get on with it!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Lico",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>I loved the protocol and dino ones, and completed disliked the others.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "dan",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>Route One: Protocol</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Mirela",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>Protocol. It is simple and easy to remember/recognize, but with a tech funk -because of the://.<br> Congrats to the whole process and the teams involved!!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Warren Croce",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>Protocol, hands down. It’s what logo design is about – creating an intelligent, delightful montage of seemingly disparate elements.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Glenn",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>1 more vote for protocol! It drives at the tradition behind the Mozilla brand most. The other logos are great, but remind me of other companies through their colors and thematic elements. Protocol is the only one that’s pure Mozilla.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "punctum35",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>“protocol” was not my top choice during the initial 6, however, given these 4 new options I must favor “protocol”.<br> route 2 is simply too busy<br> route 3 makes me think of yet another music streaming app<br> route 4 reminds me of saturday morning cartoons:)</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Burt",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>So I think people are saying something like this…</p> <div class=\"comment-image-box\"> <p class=\"comment-image-reloaded\"><a class=\"cir-image-link image-id-477\" href=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/ScreenShot2016-09-21at10.16.19PM.png\"><img width=\"600\" height=\"410\" src=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/ScreenShot2016-09-21at10.16.19PM-600x410.png\" class=\"attachment-baseline-mini-grid-thumb size-baseline-mini-grid-thumb\" alt=\"ScreenShot2016-09-21at10.16.19PM\" sizes=\"(max-width: 768px) 600px, (max-width: 1000px) 160px, 300px\"></a></p> </div>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Ben Lunsford",
    "date": "2016-09-24T00:00:00.000Z",
    "content": "       <p>DING! DING! DING!!</p> <p>Burt has it exactly right. I love this logo. Green is a better color than red, ‘specially for a dino (and it goes without saying that the dinosaur concept should be preserved). The protocol lettering is a perfect fit.</p> <p>Thank you for allowing our input.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Guillaume",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>Protocol’s got my vote, but Flame could be my favorite if the ‘M’ was more obvious. I saw it after a while and it was like a kid discovery, I like it !<br> Dino 2 is nice and easy but a bit naive.<br> And Burst seems too far from what it means (and also hurts my eyes)…</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "John",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>Definitely the Dino, but it needs a little refining to make the connection with the old Dino logo (more T-rexy). Protocol means nothing to non-tech people, aka most people.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "AirElemental",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>I really think these four are an improvement over the previous seven. My thoughts:</p> <p>Burst: It took me a while to see the M, and it is painful to look at.<br> Dino 2.0: Looks more like a red stapler. I don’t really like it.<br> Protocol: Really neat! Not sure about the color, but definitely better than the Dino’s color.<br> Flame: I really like this one as just an image, but the animation makes it a bit busy for me. I also think the negative space looks like a buff arm flexing. Pretty cool.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Hildy J",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>Protocol is the best of the four, as is. But I’d like to see Burst redone with meshing gears, representing meaningful activity, instead of busy and meaningless “bursts”.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Chris Jorgensen",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>I agree with what has been said by several others, some kind of combination of dino and protocol would be great. It would be difficult to use the colours together though. I like the bright blue colour in protocol, but how does it relate to the Mozilla brand identity people already know? The dino as it is now looks a bit too simplistic, something hinting a bit more of the original would be great.</p> <p>The two last entires burst and flame don’t really relate to you as well as the two others in my opinion. I think burst is also a bit too complex for a logo and while the flame is a powerful symbol, and used well by e.g. Amnesty International and UNHRC it does not have the same connection to you as the dino. If you must use it go with a dino with a torch :)</p> <p>Are you going to experiment with different fonts also? I am not sure the serif font in protocol is the best choice.</p> <p>I am looking forward to seeing the next iterations!</p> <p>Chris</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Enrico",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>I really like both Protocol and Dino, I can’t tell which one I prefer.</p> <p>Flame is a nice logo, but it looks totally unrelated with Mozilla.</p> <p>I don’t like Burst: it looks weird on the screen, like those optical illusions where you see a still picture moving (and the final effect is unpleasant).</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Jason",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>There is no doubt that Protocol is the strongest contender. Clean. Versatile. Universal. Clear.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Kosmonaut",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>Protocol: love the concept! Almost perfect! I would just change the color as blue logos are everywhere. (no red also, sry :P)<br> Burst:  please don’t! It makes my eyes hurt! Badly!!!<br> Flame: meh! really?<br> Dino: cute but that’s just it. Like many others said before, it looks juvenile.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Jana DeWitt",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>burst.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Magdalena",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>My favorite is Protocol, it shows what Mozilla is all about and might last longer than the other logos that follow the latest trends.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Laura",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>As they are, Protocol is my top choice but I really don’t like the blue. Dino is too childlike (an the stapler thing is hard to unsee) – Perhaps making the eye larger and/or lengthening the double ls (ll) to create teeth might change things? Plus, a proper dinosaur should be green! :) Burst ad Flame are too abstract and really could be anything.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Geoffrey Ledingham",
    "date": "2016-09-21T00:00:00.000Z",
    "content": "       <p>The Protocol is the best of the bunch but being from Canada, I can’t disassociate it with The Movie Network channel logo (see attached)</p> <div class=\"comment-image-box\"> <p class=\"comment-image-reloaded\"><a class=\"cir-image-link image-id-478\" href=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/The_Movie_Network.gif\"><img width=\"200\" height=\"200\" src=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/The_Movie_Network.gif\" class=\"attachment-baseline-mini-grid-thumb size-baseline-mini-grid-thumb\" alt=\"The_Movie_Network\" sizes=\"(max-width: 768px) 600px, (max-width: 1000px) 160px, 300px\"></a></p> </div>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Francesco",
    "date": "2016-09-22T00:00:00.000Z",
    "content": "       <p>The fireworks from a pure design perspective are shit: there’s o way you are going to display that correctly on a small scale, there are too many details (apart from the fact that personally don’t like it).<br> The dino I don’t understand what stands for. Also looks very childish.<br> The fire is nice, although the “pixelate” effect is been used a lot… and again, it loses a lot on small scales.</p> <p>I find the protocol version brilliant. It convey a strong message with super simple details. Just lovely. That’s what real graphic design is about.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Damijan",
    "date": "2016-09-22T00:00:00.000Z",
    "content": "       <p>Flame, no doubt. Looks cool and simple and it is related to FireFox that is still main product.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Jason Lustig",
    "date": "2016-09-22T00:00:00.000Z",
    "content": "       <p>Protocol all the way. While still not a super strong branding identity (will it be a classic in 80 years?) At least it’s clean, tied to the purpose, and I like the serif’d font a lot better than the version from round 1 in that those serifs contribute to a more solid, lasting, and perhaps classic feel. Sans-serif feels too “now” and won’t stick around. Flame seems random even if pretty (and using the dots is cool if arbitrary), burst makes no real sense (I know it spells an “M” but who cares if it’s that distracting) – the spinning makes me think of gears, but they have no obvious mechanical relationship to each other and it also seems meaningless related to Mozilla’s purpose. Dino 2 is cute (ish) but the heavy bottom jaw is distracting and visually unbalanced, and the purpose again meaningless other than to be a dinosaur (and yes, I really actually am wearing dinosaur socks to work today even as I type that).</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Wilhelm",
    "date": "2016-09-22T00:00:00.000Z",
    "content": "       <p>Protocol is great right now, will still have that impact in 5 years? </p> <p>The Dino concept is fun, but I feel it needs  to be explored quite further to reach a point more timeless anesthetic. </p> <p>Burst is one of those 5 minute illustrator experiments we all did, and liked for 30 seconds before moving on to something with substance. </p> <p>Flame is too similar to every other flame-ish and pixel-ish logo out there. </p> <p>Cheers</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Paul Hooper",
    "date": "2016-09-22T00:00:00.000Z",
    "content": "       <p>Looks like you’ve probably got the solution in Protocol. </p> <p>As others have said, the animated M Flame and the fireworks 5, whilst attractive, are not really relevant to the casual viewer and could be anything, whilst the dino is fun, but is not a ‘zilla’ to me and more a Barney or even alligator. </p> <p>I do suggest though that whilst Protocol can have many different guises, it should not become overcomplicated and too fractured. Its effectiveness is derived from its simplicity and visual pun. I understand that the designers are trying to illustrate it’s future flexibility and that may well be demonstrated in what goes on around the wordmark itself, but on the whole the core I feel should remain strong and relatively consistent. Any ‘fracture’ of the identity should be well reasoned and for a specific and planned effect.</p> <p>Take it or leave it  :// )</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Laura Moraiti",
    "date": "2016-09-22T00:00:00.000Z",
    "content": "       <p>Protocol seems by far the most solid one in the bunch. Clearly shouts “Mozilla” and connects with the internet… The flame unfortunatelly is too far out there to be tied to anything internet-related. The M made out of stars gives an advertising agency vibe with the multicolor styling. And finally the dyno, is cute as a mascot but not main logo.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Max",
    "date": "2016-09-22T00:00:00.000Z",
    "content": "       <p>Dino 2.0 works well as an icon, recognizable even as a small image. It’s an appropriate image, given that the name is still “Mozilla.” I see the red stapler, and if anything that’s positive for me.</p> <p>I like Protocol too, but not as much. The other two don’t work for me.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "John",
    "date": "2016-09-22T00:00:00.000Z",
    "content": "       <p>Make the bursts on the M a mouse over processing effect. The the mouse hits a joint, a quick burst happens at that point. The gradient M on its own with out the pin wheels would be quite nice.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Sparkle",
    "date": "2016-09-22T00:00:00.000Z",
    "content": "       <p>– Protocol I think is best. Very strong in my opinion (though I don’t know if the blue background needs to not be a rectangle).<br> – Fond of Dino, but I see why many people see it as childish. It’s a bit harder to associate it with a serious company.<br> – Burst is just a very unappealing logo. I find it unpleasant to look at.<br> – Flame – meh. It’s a good graphic, but I don’t think it’s a strong enough contender.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Kal",
    "date": "2016-09-22T00:00:00.000Z",
    "content": "       <p>Sorry but these are all just bad.</p> <p>Protocol, though, is the least bad and could be a great brand with some different colors and lose the thick blocky background/outline. Just use the words/symbols themselves.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Kal",
    "date": "2016-09-22T00:00:00.000Z",
    "content": "       <p>Also, I just showed these logos to everyone in my chat channel, and they collectively said “Ew! Wtf.” Just something to think about.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Kit Cambridge",
    "date": "2016-09-22T00:00:00.000Z",
    "content": "       <p>I like the dino; it feels playful and approachable, especially with the wink! It lends itself well to different colors, too. Thanks so much for engaging with everyone on this, and for your openness to feedback, Tim. It’s really appreciated!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Ricky Barbosa",
    "date": "2016-09-23T00:00:00.000Z",
    "content": "       <p>Protocol all the way. I doubt that any users could take any of the other three seriously.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Snape",
    "date": "2016-09-23T00:00:00.000Z",
    "content": "       <p>Burst is really sad, not even a logo attempt. It wont scale, print and people cant read it. Should have left it in on the Illustrator art board of death. Deleting all Mozilla related items just because you thought for one second that it would work as a logo.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Matthew Anderson",
    "date": "2016-09-23T00:00:00.000Z",
    "content": "       <p>Protocol is amazing.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "G B",
    "date": "2016-09-24T00:00:00.000Z",
    "content": "       <p>Protocol, all the way. Dino is cute and all, but it’s flatter that Protocol. It communicates less.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Keith Kirkwood",
    "date": "2016-09-24T00:00:00.000Z",
    "content": "       <p>Protocol without a doubt</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "sa",
    "date": "2016-09-24T00:00:00.000Z",
    "content": "       <p>I’d definitely go with Protocol<br> it’s an intuitive visual reference for what the brand represents</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Alan Hart",
    "date": "2016-09-24T00:00:00.000Z",
    "content": "       <p>I like Dino the best. Protocol is fine but looks quite corporate and you can’t tell quite what it is. Dino updates the heritage. The others are a no-go for me.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Dan",
    "date": "2016-09-25T00:00:00.000Z",
    "content": "       <p>Protocol, but with the colouring and font from Dino! (White on red).</p> <p>White on blue looks very clinical / medical in my mind.</p> <p>Burst is too noisy, and makes weird patterns when scrolling.</p> <p>Flame looks nice, but I couldn’t see the M at all, I was drawn into the negative space and trying to work out what that was.</p> <p>I really like the font and colours of Dino, but it does look like a stapler.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "JP",
    "date": "2016-09-25T00:00:00.000Z",
    "content": "       <p>Protocol in a different color. (That blue on white -&gt; MS Word from the days of DOS).</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Kara Hartman",
    "date": "2016-09-25T00:00:00.000Z",
    "content": "       <p>I like Dino.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "J.A.",
    "date": "2016-09-25T00:00:00.000Z",
    "content": "       <p>Protocol is my favorite of the bunch. Like others before me, though, I’m not sold on the blue. Perhaps a reddish-orange? A color that gives a nod to the much loved Firefox logo.</p> <p>A fellow interwebbers $0.02.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Grayson Rosato",
    "date": "2016-09-25T00:00:00.000Z",
    "content": "       <p>Love Protocol. Clear while still being flexible.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "VP",
    "date": "2016-09-25T00:00:00.000Z",
    "content": "       <p>Dino:<br> Looks like it would be perfect for a children’s brand. It’s cute and utterly boring. If it evolved into something more mature and potentially dangerous, then maybe it could represent a brand that saw itself as a protector of the internet. Besides, there is the inherent issue of dinosaurs and extinction, despite all previous connections with the Mozilla brand…</p> <p>Burst:<br> I seem to be in the minority, but I like the subtle movement and the M. Of all of them, it reminds me of another tech company in a highly positive way. When you update iOS, the gears in the icon slowly rotate. If you aren’t paying attention, you never notice it. I’ve always loved that subtle attention to detail. Does it make crazy moiré patterns when you scroll? Yes. Is there something that’s maybe a bit too art school or graphic design project about it? Without a doubt. But, this stands out as both a still image and an animation in a way the others don’t.</p> <p>Flame:<br> It’s a flame. If the flame resembled a fox, or a fox appeared while the flames were moving, then it resolved into an M, you might have something. As it is, it’s no good.</p> <p>Protocol:<br> It’s got a colon and forward slashes because internet. Reminds me of way too many ads, news transitions, even the date/location text that you see all the time in movies. Go ahead and make it green letters on a black background, and we’ll all go ‘Oh, the Matrix!’ Plus, it’s boring and ugly. Just no.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Nigel Boor",
    "date": "2016-09-26T00:00:00.000Z",
    "content": "       <p>I think Protocol works on so many levels and the M: is such an obvious sub element to use in smaller situations.   Not a fan of the block outline but it does not greatly offend the eye – just a personal preference for cleaner, text only approach.<br> Dino is OK and maybe more “fun” than Protocol but the eye does not work as sucessfully as a sub element since it less obviously [M:]ozilla.<br> Both work really well as static or animated versions.<br> Sorry but I really dislike Burst – it just confuses the eye and I can see all sorts of problems with unexpected effects on varying resolutions colour depths and screen sizes.<br> Flame – just don’t see it without looking hard. A logo needs to hit you, even if its in your peripheral vision &amp; this one doesn’t. A bit like stereograms – some will see it, the rest of us will go “huh?”</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Sonja van der Westhuizen",
    "date": "2016-09-26T00:00:00.000Z",
    "content": "       <p>Apologies for falling into the process at this late stage and probably repeating what might already have been said.</p> <p>Although I’m not crazy about Protocol, it wins hands down when it comes to longevity and at least it’s recognisable as a logo. All the logos are animated, but one has to take into account how effective they will be if they need to be used as static images. </p> <p>Burst will lose its efficiency and so, unfortunately, will Dino. I agree with the stapler resemblance – maybe not quite the association you want?  Flame just looks like a random animation. There doesn’t seem to be any clear corporate identity.</p> <p>I would suggest that the blue in Protocol be replaced by red or orange for a stronger effect and possibly a more modern font.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Tommy Duhn",
    "date": "2016-09-26T00:00:00.000Z",
    "content": "       <p>Dino is half decent. Protocol is not bad, but I think it may be too geeky, and I don’t know if Mozilla can afford to niche-itself to death right now.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Peter Atcheson",
    "date": "2016-09-26T00:00:00.000Z",
    "content": "       <p>There can only be one… Moz://a for the win!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Martin",
    "date": "2016-09-27T00:00:00.000Z",
    "content": "       <p>Initial thought: meh.<br> After viewing the design systems: Better than meh.<br> If Dino 2.0 could be adapted to be closer to the original tyrannosaur head shape (shorter, thinner bottom jaw, and perhaps a rounder noggin’) and a slight modification of the type (feels too totalitarian at the moment) this could work.</p> <p>Flame – design system can run the gamut – which is good…maintains a pop art vibe, truly flexible…slightly unreadable (though the version with the small dots to larger dots on the t-shirt works).  Maybe the M but not as a flame?</p> <p>The Star Burst – really has a lot going for it…some refining could push this over the top…fewer spokes and thicker lines both for the M and the bursts could help…but adding text over top of this makes it very noisy.  As a design system very good…as a logo…refinement needed.</p> <p>Protocol…good ol’ corporate blue…the most used color in the book. Maybe softer edges…and if you knock out the text so it’s see through (representing mozilla’s transparency) this might work. And use your moz red. :)</p> <p>Frankly, the current word mark for me is bang on. With an icon attached, it might then have more punch…and then re-boot your home page to express your product offerings a little clearer, would go a long way to “re-branding” for me. When I hit your front page I’m sort of left guessing as to what you provide…it feels like your hiding everything behind a word with no explanation. </p> <p>(You kind of explain it in your blurb.. ” Using the web as the platform, we build open, innovative technologies that allow developers to work free of closed, corporate ecosystems and create faster, safer web experiences for us all. ” You make technologies?…and then you list things like Rust and Servo with no explanation as to what they are…and I guess you have a browser? Don’t get me wrong – the page is pretty and well thought out…just I have no idea what’s what.  A few more explanatory notes would be helpful).</p> <p>Here’s hoping your rebrand kicks in the clarity. Intrigued to see where you go.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "liuche",
    "date": "2016-09-27T00:00:00.000Z",
    "content": "       <p>Flame: I looked at the detailed version of Flame, and I actually find it to be fairly consistent with some of the other open source logos – I don’t understand why the “mozilla” part of that logo was cut out, because in its current form on this post, there is no discernible link to Mozilla at all. That being said, perhaps if the logo needs the “mozilla” text, perhaps it’s not distinctive enough.</p> <p>I think one of the main reasons everyone is very pro-Protocol is that it is the only reasonable logo that actually says “Mozilla” (the Dino looks so childish I can’t really take it seriously). I’d suggest updating the Flame in this post to include the grey “mozilla” that’s present in the detailed Flame blog post – I think the current version is extremely confusing and actually kind of misleading.<br> —<br> Protocol: This logo is tying Mozilla to browsers, and since we are trying to move Mozilla to a bigger space than just Firefox, this really seems counterproductive. I like the visual pun, I like the nod to browsers, but this really shouldn’t be the logo because it’s regressing the mission by boxing it into a smaller space. Please talk to some Mozilla leadership, or listen to Mitchell Baker’s talks about going beyond the browser, or talk to some high level product people – tying the brand more tightly to browsers is *not* going to help further the Mozilla mission. I’ve commented more earlier in the thread so I won’t repeat myself any more here.<br> —<br> Burst: I looked at the detailed post about Burst, and I find the thumbnail versions to be quite nice, because the “M” for Mozilla is clear and stands out, and even looks a little like a constellation. However, in the large version that’s up here, the line bursts are overwhelming and detract as well as distract from the underlying “M” of the logo. It’s nearly impossible to focus on the M, which I think is a failure of this logo. Perhaps a different version would work, but not in its current incarnation.<br> —<br> Dino: This is just so childish, I can’t take it seriously. I like the Dino, I think it looks cute, but this version would be better suited to a funny sticker rather than the overarching logo of a global company devoted to fighting for the openness of the web. The animations in the extended blog post really just confirm my feeling that this is kind of a cutsey rebranding, and I really don’t think internet privacy and user choice and open web can effectively be represented as “cute”.<br> —</p> <p>In general, I think there’s a lot of pushback from the community because these logos just seem random and don’t do a good job of relating to the Mozilla mission, and at best seem to only fixate on a tiny part of it. It’s so myopic that I am starting to feel uncomfortable about whether the company that we have hired/partnered with actually understands the breadth and depth that Mozilla encompasses.</p> <p>If anything, I’d really just prefer the current logo, because in a lot of ways, it doesn’t pigeonhole Mozilla into one of these tiny categories, and also isn’t so vague as to seem like nothing but a vain, meaningless “brand facelift”. I guess I feel like a rebrand should help focus the world on what Mozilla stands for, and these either seem overly focused on one tiny aspect of Mozilla, or don’t mean anything at all.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-09-27T00:00:00.000Z",
    "content": "       <p>Thanks for sharing your thoughts Iiuche. I’d be curious to hear what you consider to be the current logo for Mozilla. The wordmark that says “Mozilla?” The most successful brand identities do indeed suggest the purpose of an organization in the world. A logo also plays a role in driving recognition, so that over time, one associates the symbol with the brand. One could argue that Protocol and Dino 2.0 are the more recognizable of the four designs, while Burst and Flame begin to suggest the overall purpose of Mozilla (championing the health of the Internet and being the keeper of the flame, respectively). In general as time passes, recognition comes from repeated exposure to a consistently applied brand identity. The Achilles heel of our past approach, in which teams, locales, and initiatives have been encouraged to make up their own identities, is that these many different looks contribute to confusion about what Mozilla does, believes, and stands for. If you had to select one image to convey the totality of Mozilla, what would it be? Thanks again.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "liuche",
    "date": "2016-09-29T00:00:00.000Z",
    "content": "       <p>“Burst and Flame begin to suggest the overall purpose of Mozilla (championing the health of the Internet and being the keeper of the flame, respectively).”</p> <p>I agree that those characteristics are consistent with what Mozilla represents, but at the same time, merely “suggesting it” doesn’t seem enough for a brand! I think the sign of good branding is not having to explain the details of why your logo or brand reflects your company/values.</p> <p>Going along that thread, I actually think using a red dinosaur to convey the totality of Mozilla is great – it matches the name, it’s distinctive, and its consistent with the history of Mozilla’s branding (which truly does appeal to Mozillians). But the cutsey-ness of this iteration completely over-rotates on the “accessible” and “friendly” facet to the point of obliterating the more meaningful (and distinctive) roles that I personally think Mozilla stands for and should try to communicate more broadly.</p> <p>Mozilla embodies an advocate, a guardian, and a guide for those navigating the web and the Internet (and fights for open technology and standards behind the scenes). Being accessible and approachable needs to be part of that, but it should not be the only aspect we portray. Perhaps other people on this thread put it best, but this dinosaur needs some teeth! (To be clear, I’m definitely not advocating literally just adding teeth – that’s just lazy.) Where are the more important roles of being an advocate, being a protector, the reasons to trust Mozilla being represented in this branding? I think building on the dinosaur is fantastic, and the friendliness and accessibleness is something that was lacking in the previous Mozilla browser dinosaur – but there are some key characteristics of Mozilla that don’t seem to have been represented clearly in any of these brand suggestions.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "liuche",
    "date": "2016-09-27T00:00:00.000Z",
    "content": "       <p>Also, what about the logos that johnson banks did here? The teeth/M one on the bottom right seems less pigeonholed than any of the others.<br> <a href=\"http://johnsonbanks.co.uk/thoughtfortheweek/files/jb_Mozilla_Dino_investigation_2.jpg\" rel=\"nofollow\">http://johnsonbanks.co.uk/thoughtfortheweek/files/jb_Mozilla_Dino_investigation_2.jpg</a></p> <div class=\"comment-image-box\"> <p class=\"comment-image-reloaded\"><a class=\"cir-image-link image-id-481\" href=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/jb_Mozilla_Dino_investigation_2-1.jpg\"><img width=\"555\" height=\"328\" src=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/jb_Mozilla_Dino_investigation_2-1.jpg\" class=\"attachment-baseline-mini-grid-thumb size-baseline-mini-grid-thumb\" alt=\"mj_tm_Moz_Nashville_edits for new pics.key\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/09/jb_Mozilla_Dino_investigation_2-1.jpg 555w, https://blog.mozilla.org/opendesign/files/2016/09/jb_Mozilla_Dino_investigation_2-1-300x177.jpg 300w, https://blog.mozilla.org/opendesign/files/2016/09/jb_Mozilla_Dino_investigation_2-1-425x251.jpg 425w\" sizes=\"(max-width: 768px) 600px, (max-width: 1000px) 160px, 300px\"></a></p> </div>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Grace",
    "date": "2016-09-29T00:00:00.000Z",
    "content": "       <p>Super cool. Love the graphics. But as a logo is kind of hard to make sense of…..</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Nikko",
    "date": "2016-09-28T00:00:00.000Z",
    "content": "       <p>They all look odd, keep the current logo.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-09-28T00:00:00.000Z",
    "content": "       <p>Hi Nikko! Thanks for your comment. What do you consider Mozilla’s current logo?</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Grace",
    "date": "2016-09-29T00:00:00.000Z",
    "content": "       <p>Protocol definitely.<br> Clean, smart, memorable, scalable, most definitely ownable. I can see longevity in this design whereas the other approaches could be interesting but not as recognizable and class as Protocol .</p> <p>The combinations of Protocol and Dinos in the previous comments seem very interesting but become too complex to process at a glance. Mashing too many layers of information is trying too hard to be smart. Logo 101 tells us a strong logo is one that convery one genius idea. One!</p> <p>Love the work so far. Protocol is great!! Dino 1.0 is great too with lots of personality…. not a huge fan of Dino 2.0</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Sam",
    "date": "2016-09-29T00:00:00.000Z",
    "content": "       <p>After thinking about all of these designs, this is what I’ve come to.</p> <p>Dino 2.0 – While I can tell there was a good amount of creative effort put into this one, but I really don’t have much of anything positive to say for it. When I asked people I know about the four logos, this one got little attention, and what it did get wasn’t very positive. All-in-all, this odd looking and slightly unsettling thing doesn’t say much to me about Mozilla – other than “weird”.</p> <p>Burst – This one exists. It’s a graph thing. The description for it sounds very corporate and it looks like a line graph. It doesn’t really say much about Mozilla unless you plan on becoming an analytics company. It scales across different screens oddly and it’s apparently made people’s eyes feel weird. It exists, I don’t like it much and I don’t see much creative potential with it. It doesn’t look ugly or creepy and it doesn’t leave a really bad impression. It just doesn’t leave much of an impression at all.</p> <p>Flame – Warm, flexible, and modern. That’s what came to mind when I looked at this logo. After the previous generation of design concepts I was pleasantly surprised by this one (as well as Protocol 2.0). It’s neat and seems to be a favorite among people I show it to. The logo is nice to look at and the narrative fits Mozilla very well. The flame just works, and of course it fits well with Firefox too. I struggled to find any criticism for it. The only thing I’ve come up with for a negative is that you didn’t use the Mozilla fonts. Flame would look fine next to the trusty old Meta Bold wordmark, and I should maybe remind you that “re-branding” doesn’t mean “get rid of all resemblance to old branding”. Fonts aside, this is a great design route and I would be very happy to see Mozilla go with it.</p> <p>Protocol 2.0 – While I wasn’t as much of a fan of it at first, especially the first version, this one has grown on me. It’s professional and clean, without feeling too cold or corporate. It was my Graphic Design Teacher’s favorite (Flame being his second) and I can pretty well see why. While I still can’t say that I like this one better than Flame, I can say that I like it.</p> <p>Between Flame and Protocol 2.0, I prefer flame, but I’d be happy to see Mozilla use either. That said, I do hope you don’t leave your trusty fonts out in the cold. They’re readable and they stand out in a sea of generic serif and sans-serif fonts. The current fonts have this wonderful balance of modernism and class, mixed with a little personality. Just wanted to mention them to be sure you weren’t planning on getting rid of them. This typography is huge part of Mozilla’s brand, which is why I felt the need to talk about it here.</p> <p>Back to logos – After careful consideration, here’s how I rate each design:<br> Flame – very good<br> Protocol 2.0 – also good<br> Burst – So forgettable I had to stop and remember what the name of it was<br> Dino 2.0 – Let’s not do that please</p> <p>Thanks for reading, I’ve been wanting to express all this for a while.<br> I hope that even though I’m not a professional programmer, I can contribute something.</p> <p>–\tSam</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "amanda",
    "date": "2016-10-04T00:00:00.000Z",
    "content": "       <p>Definitely Protocol or Dino 2.0 for me. Both are brilliant in their own right and own-able as a brandmark. </p> <p>Other two are a bit generic, not an own-able/unique asset to Mozilla.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  },
  {
    "name": "Joshua Vizzacco",
    "date": "2016-10-06T00:00:00.000Z",
    "content": "       <p>Protocol all the way! </p> <p>Lets get down to design basics and what is most useable across all platforms / marketing materials. The fact that Protocol has a icon as its starting point gives this logo flexibility where the others do not. Even when it comes down to how these marks would scale down to smaller sizes – there is only one option. Its nice to let us contribute our thoughts but come on, there is only one option here.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/progress-in-the-making/"
  }
]
