[
  {
    "name": "Michael Johnson",
    "date": "2016-06-11T04:53:50.000Z",
    "content": "    <p>We’ve been talking to the famous global non-profit <a href=\"https://www.mozilla.org/en-US/\" target=\"_blank\">Mozilla</a> about their brand and how it could adapt and evolve. Now that’s not much of a shock – brand consultancy talks to potential client about new project? There’s nothing new to see here, ladies and gentlemen, move along.</p><p>But, before you do, consider this – have you ever seen a big re-brand carried out in public – right out in the open? With all of its processes, stages, wrong turns, reboots and results out there for everyone to applaud, critique or chastise?</p><p>I’m betting the answer is no.</p><p>Because branding and brand identity is a process best carried out behind closed doors – within, not without. With tightly controlled parameters, a carefully curated project team and a hand-selected brand consultant in tow. Yes?</p><p>Well, yes. . . usually.</p><p>The steps normally start with research, followed by ‘narrative’ work that concentrates on an organization’s verbal brand, before moving on to its visual brand and all that it entails.</p><p>Sometimes it’s a beautiful, breezy process that skips along in a matter of weeks. Often it’s bruising and political. It can demand as much diplomacy as design, and a rhino-like hide to deal with the knock-backs. (Just last week we finally had a route signed off by a global NGO twenty-six months after we wrote our first proposal).</p><p>Now, imagine that you were to do all of that, but do it in the open. Imagine that you were to pry open branding’s ‘black box’, replace its opaque walls with glass or even remove them altogether. Imagine a process where each stage is published, in the open, and all can comment, freely.</p><p>That’s exactly what we’re about to do.<img class=\"size-medium wp-image-21 alignleft\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/06/dmb_logo_orange-300x154.jpg\" alt=\"dmb_logo_orange\" width=\"300\" height=\"154\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/06/dmb_logo_orange-300x154.jpg 300w, https://blog.mozilla.org/opendesign/files/2016/06/dmb_logo_orange-600x308.jpg 600w, https://blog.mozilla.org/opendesign/files/2016/06/dmb_logo_orange-1000x513.jpg 1000w\" sizes=\"(max-width: 300px) 100vw, 300px\"></p><p>It’s fair to say that there’s very little precedent for this. Normally re-brands arrive, fully formed, like the Aol re-jig a few years back. Some, like the Airbnb project, ride a wave of controversy for a while (remember the ‘does-my-symbol-look-like-your-genitals’ <a href=\"http://blog.airbnb.com/belo-report-new-airbnb-symbol-infographic/\" target=\"_blank\">story</a>?) but the furor usually dies down pretty quick.</p><p><img class=\"wp-image-22 size-medium alignleft\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/06/jb_arkitypo_2000_150-220x300.jpg\" alt=\"jb_arkitypo_2000_150\" width=\"220\" height=\"300\"></p><p>Genuine precedent for someone re-branding in the open is hard to find. Continuum did publish several stages of its design work on Design Museum Boston’s new brand on the <a href=\"http://www.core77.com/posts/17027/open-for-branding-continuums-transparent-design-project-for-design-museum-boston-17027\" target=\"_blank\">Core77 blog</a> back in 2011.</p><p style=\"text-align: left;\">Here in London, we’ve shared the design stages of projects such as this one for <a href=\"http://johnsonbanks.co.uk/exhibitions-and-3d/glenfiddich-barrel-art/\" target=\"_blank\">Glenfiddich</a>, or our work on an experimental 3-D typeface with <a href=\"http://johnsonbanks.co.uk/thoughtfortheweek/arkitypo-the-final-alphabet/\" target=\"_blank\">Ravensbourne</a>. But those were ‘design’ projects, not brands.</p><p><img class=\"size-medium wp-image-23 alignright\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/06/jb_glenfiddich_2000_150-300x178.jpg\" alt=\"\" width=\"300\" height=\"178\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/06/jb_glenfiddich_2000_150-300x178.jpg 300w, https://blog.mozilla.org/opendesign/files/2016/06/jb_glenfiddich_2000_150-600x356.jpg 600w, https://blog.mozilla.org/opendesign/files/2016/06/jb_glenfiddich_2000_150-1000x594.jpg 1000w\" sizes=\"(max-width: 300px) 100vw, 300px\"></p><p style=\"text-align: left;\">So why is the branding process so protected?</p><p>Some of this is down to branding’s new power. Now that understanding of what branding can do has seeped upwards from the marketing department to the boardroom, Chief Executives, Chairs and their boards are much more involved. They want to be integrated into the process – not just presented with a “fait accompli”.</p><p>But add greater corporate involvement to wider public awareness of branding and that equals increased risk. Consider the pummeling that brand changes can now receive online – the outcry over</p><p>Gap’s proposed <a href=\"http://www.underconsideration.com/brandnew/archives/dont_mind_the_gap_or_the_square.php#.V1p-gFMrK3A\" target=\"_blank\">change</a> to its blue square , or those seemingly inevitable ‘my four-year-old daughter could have done that’ comments? Just the simplest of changes to a symbol can cause an uproar, even if the proposed amendments are minor. Opt for full-on revolution and most of hell can open up and consume all concerned (well, OK not quite, but believe me it feels pretty bad when a re-brand gets mauled).</p><p>Knowing all of this, with all the known hurdles ahead of us (and imagining the ones we don’t yet know, to paraphrase Mr Rumsfeld), why consider re-branding in the open?</p><p>Well, for starters, Mozilla is a pioneer of open-source, the new normal for coding that we all now take for granted. One coder stands on the shoulders of another and we all get better software as a result. If it makes sense to code collaboratively, in the open, why not design in the open too?</p><p>Second, in an age of ‘agile’ and ‘lean’ management, why wait for six months to listen to feedback – why not try shorter design ‘sprints’, then share and test as we go along?</p><p>Third, this is an organization with over a thousand employees and a vast global community of volunteers who know Mozilla far better than us. It is far more reciprocal to involve and to listen, rather than to command and to tell once a decision has been made.</p><p>This project could make us all think afresh about the branding business. It will certainly open the eyes of thousands to how a robust design process is carried out. And perhaps, just perhaps, it will make millions see that ‘branding’ is about much, much more than just a logo.</p><p><em>Michael Johnson:</em></p><p style=\"text-align: left;\"><em>Strategy and Creative Director of j<a href=\"http://johnsonbanks.co.uk/\">ohnson banks</a>, a brand consultancy based in London with clients across the globe</em></p>      ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/designing-in-the-open/"
  },
  {
    "name": "bunkywu",
    "date": "2016-06-16T19:32:00.000Z",
    "content": "       <p>It’s a brave new world. Good luck to you, good sir!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/designing-in-the-open/"
  },
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-06-21T16:14:00.000Z",
    "content": "       <p>Thanks for the encouragement!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/designing-in-the-open/"
  },
  {
    "name": "Anatoliy Omelchenko",
    "date": "2016-07-02T08:08:00.000Z",
    "content": "       <p>How I can participate in logo design?</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/designing-in-the-open/"
  },
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-07-07T23:04:00.000Z",
    "content": "       <p>Hi, Anatolly. As we continue to refine our creative strategy and begin our design process, if you would like to post a link to a blog or site with logo ideas, feel free to do so once you’ve read the About section of the site. Thanks for participating!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/designing-in-the-open/"
  },
  {
    "name": "Salvo Nicolosi",
    "date": "2016-07-06T14:21:00.000Z",
    "content": "       <p>Please be sure to include, invite or encourage submissions by well known “sources” of creative talent such as Behance, Dribble, DeviantArt… and possibily even single and associates branding professionals! Keep on like that, Mozilla!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/designing-in-the-open/"
  },
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-07-07T22:12:00.000Z",
    "content": "       <p>Thanks for the encouragement, Salvo. Please feel free to share with  your creative network as well!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/designing-in-the-open/"
  },
  {
    "name": "Edward",
    "date": "2016-07-10T14:01:00.000Z",
    "content": "       <p>I find the ordering of this blog confusing. To navigate from this post (June 10) I click ‘previous’ wich takes me to June 15). Should the label be ‘next?’</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/designing-in-the-open/"
  },
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-07-12T23:00:00.000Z",
    "content": "       <p>Thanks, Edward for catching this. We’ll have a look and improve the UX navigation.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/designing-in-the-open/"
  }
]
