[{"name":"Arianna Orland","date":"2016-09-12T20:30:06.000Z","content":"    <p>Like many of us in the design community, I’ve followed along in recent years as seemingly countless companies have undertaken the exciting and often fraught challenge of redesigning their visual identities. A quick glance at the<a href=\"http://www.underconsideration.com/brandnew/archives/type/before-after/index.php?page=19#.V7y-YBIrJE5\"> Before/After</a> section of<a href=\"http://www.underconsideration.com/brandnew/\"> Brand New</a>, the well-known design blog dedicated to the critique of such things, shows 216 projects chronicled year-to-date.</p><p>Some redesigns have been well received like<a href=\"http://www.fastcodesign.com/3050613/googles-new-logo-is-its-biggest-update-in-16-years\"> Google</a>’s, while others have drawn an enormous amount of criticism from both the design community and the general public, such as<a href=\"http://money.cnn.com/2016/02/02/news/companies/uber-logo-rebrand/\"> Uber</a>’s. These are interesting times for design as the critique of our work has moved from something those of us in the trade might discuss with colleagues over dinner, to something that anyone with an @handle and opinion can weigh in publicly over social media. On several occasions, this public discourse has taken such an extreme tone that Andrew Beck has described it as<a href=\"http://beckandstone.com/thought/on-design-criticism-inspiration-and-purpose.html\"> design crit as bloodsport</a>.</p><p><b>Designing in the Open</b></p><p>Earlier this year I began consulting with non-profit<a href=\"https://www.mozilla.org/en-US/\"> Mozilla</a> to tee up a logo redesign initiative. During that time, Mozilla’s Creative Director Tim Murray proposed the idea of<a href=\"https://blog.mozilla.org/opendesign/\"> designing in the open</a>. His vision was to build off of the<a href=\"https://en.wikipedia.org/wiki/Open-source_software\"> open source</a> principles that are bedrock to Mozilla by applying them to the end-to-end process of an identity redesign. The idea was to be as transparent as possible with the process, the initial concepts, the refinement and the outcome, and to have an open, public dialog with many people as possible along the way. He would engage the typical stakeholders one would expect, such as Mozilla’s senior leadership, as well as Mozilla’s 10,000+ strong<a href=\"https://www.mozilla.org/en-US/contribute/\"> volunteer community</a>. But Tim also wanted to reach beyond Mozillians. He invited not only the design community into the discussion, but anyone for whom the Mozilla mission – to keep the internet healthy, open and safe for all – resonates.</p><p>Initially, his proposal made me slightly uncomfortable. I felt a mix of caution and curiosity and I had to ask myself: why?</p><p><b>A Mix of Caution and Curiosity</b></p><p>I was concerned that opening up earlier stages of the design process to that kind of public commentary (think stakeholders at scale) would negatively affect the work. And my hesitancy was also rooted in a lack of understanding as to<a href=\"https://blog.mozilla.org/opendesign/about/\"> what Mozilla was asking</a> from the design community. I questioned how we as designers could meaningfully participate in a public dialog about design work. After all, by submitting a professional opinion on everything from initial thinking, to design exploration through concept and execution, <i>weren’t we engaging in a kind of spec work?</i></p><p>As for my curiosity, it was piqued by the opportunity to re-examine the methodology by which design outcomes are generated. Would a larger and more diverse conversation upfront in fact lead to a better outcome? And as design crit has gone mainstream and instantaneous thanks to social media, how can we show up in public conversations about design deliverables without compromising our point of view<a href=\"http://www.aiga.org/position-spec-work/\"> against spec work</a>?</p><p><b>Where Things Stand Now</b></p><p>The<a href=\"https://blog.mozilla.org/opendesign/\"> identity redesign</a> is now well underway.<a href=\"http://johnsonbanks.co.uk/\"> johnson banks</a> was selected as the agency partner and Mozilla has indeed undertaken a fully transparent, moderated, and public design process. The<a href=\"http://johnsonbanks.co.uk/thoughtfortheweek/our-first-design-routes-for-mozilla/\"> first round creative concepts</a> were shared a week ago and met with hundreds if not thousands of responses and a full news cycle in the<a href=\"https://www.creativereview.co.uk/mozilla-rebrand-seven-design-routes/\"> design press</a>.</p><p>While the end result of this unconventional approach remains uncertain, we do know that Tim and team created a process that is true to Mozilla’s open source beliefs and the<a href=\"https://www.mozilla.org/en-US/about/manifesto/\"> manifesto</a> that guides the company’s conduct. And we know they are willing to withstand the outcome even if it rises to the level of<i> bloodsport.</i> For that, they should be commended.</p><p>As for the questions raised about spec work and the Mozilla initiative, if you’re aligned with Mozilla’s mission and choose to provide critique then your participation as a practicing professional is an act of volunteerism. In their words…</p><p>“What we’re seeking is input on work that’s in process. We welcome your feedback in a form that suits you best, be it words, napkin sketches, or Morse Code. We simply want to incorporate as many perspectives and voices into this open design process as possible. We don’t take any single contribution lightly. We hope you’ll agree that by helping Mozilla communicate its purpose better through design, you’ll be helping improve the future Internet.”</p><p>As for the larger questions raised by increasing public dialog about design, it’s up to each of us personally to determine how we participate and when. But all industries experience change, design is no exception. By at least trying to understand Mozilla’s approach to this project and how it fits within a broader narrative, designers can use this as an opportunity to challenge long-held methodologies, and perhaps pave the way for new ones<b>.</b></p><p><a href=\"http://aigasf.org\"><img class=\"alignleft size-medium wp-image-392\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/AIGAsf_logo-300x120.jpg\" alt=\"aigasf_logo\" width=\"300\" height=\"120\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/09/AIGAsf_logo-300x120.jpg 300w, https://blog.mozilla.org/opendesign/files/2016/09/AIGAsf_logo.jpg 375w\" sizes=\"(max-width: 300px) 100vw, 300px\"></a></p><p><em>Republished with permission from AIGA SF / The Professional Association for Design<br></em></p><p>&nbsp;</p><p><em>Photo credit: Wikimedia Commons “And Phoebus’ Tresses Stream Athwart the Glade” </em></p>      ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/the-conversation-about-design-has-changed/"},{"name":"Oge","date":"2016-09-15T00:00:00.000Z","content":"       <p>Brand is a principle that starts from the ‘EYES’ . people have the tendency to form an opinion about on just first sight and as such DESIGN is practically impossible.<br> I remember when I started my blog, its looked awkward but as time goes on, we employed a full-time designer to handle our overall brand and guess what? The result was outstanding.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/the-conversation-about-design-has-changed/"},{"name":"Benjamin Evesham","date":"2016-09-18T00:00:00.000Z","content":"       <p>Brand starts from actions. Not visuals. The visual brand identity is simply one of the actions a brand undertakes. To suggest it starts with visuals / colours / logos is to be rooted in desperately of date thinking.  </p> <p>In regards to recognition : If anything the name is most important. One does not search for a logo online. We type in a name. We do not describe the colour system we talk of FedEx-ing… </p> <p>But it’s the brands actions that most influence how we see it. What’s it’s reputation is. Which is of course the essence of brand. Brand = reputation. Which is why this endeavour of open source branding is commendable. It’s Mozilla walking the walk. Even if the outcome is lack lustre. The process is authentic to the outlook of the organisation. </p> <p>My only worry. So far. The output looks amateur compared to the competitor set. Google. Yahoo. Even Bing. They all look infinatly slicker and more cohesive than the ‘Changeling’ marks developing here. </p> <p>I wonder. If we as a brand want to stand out. Be counted. Shouldn’t we avoid the norms set by the sector? If google is charming the planet with a new doodle every 15 mins. Should we try and flex as much. Or remain cool calm and collected. A single mark. One that can be trusted to deliver. Rather than flitting around trying to please everyone by accommodating their flags and every whim.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/the-conversation-about-design-has-changed/"}]