[{"name":"Michael Johnson","date":"2016-09-16T00:03:44.000Z","content":"    <p>This is a completely new direction. Whilst rooted in the ethos of the ‘Pioneer’ thinking it also crosses over into the ‘Taking a stand’ narratives. We started to think that a flame could be a powerful symbol of Mozilla’s determination to remain the beacon for an open, accessible and equal internet for all, and something that a community gathers around for warmth.</p><p>As we started to experiment with flame symbolism, one simple design won through which simply merges an ‘M’ and a flame. After some experimentation, we think a dot/pixellated form for this idea work nicely. It animates nicely, and might even be dynamically generated with lightweight code.</p><p>Here are some key slides showing applications out to sub-brands, community designs and merchandise.</p><p><img class=\"alignleft size-full wp-image-444\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/Flame_flicker.gif\" alt=\"flame_flicker\" width=\"1069\" height=\"1065\"></p><p><img class=\"alignleft size-large wp-image-442\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/jb_Mozilla-sept_D_flame_2-1024x724.jpg\" alt=\"jb_mozilla-sept_d_flame_2\" width=\"1024\" height=\"724\"><img class=\"alignleft size-large wp-image-441\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/jb_Mozilla-sept_D_flame_3-1024x724.jpg\" alt=\"jb_mozilla-sept_d_flame_3\" width=\"1024\" height=\"724\"><img class=\"alignleft size-large wp-image-440\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/jb_Mozilla-sept_D_flame_4-1024x724.jpg\" alt=\"jb_mozilla-sept_d_flame_4\" width=\"1024\" height=\"724\"><img class=\"alignleft size-large wp-image-439\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/jb_Mozilla-sept_D_flame_5-1024x724.jpg\" alt=\"jb_mozilla-sept_d_flame_5\" width=\"1024\" height=\"724\"><img class=\"alignleft size-large wp-image-438\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/jb_Mozilla-sept_D_flame_6-1024x724.jpg\" alt=\"jb_mozilla-sept_d_flame_6\" width=\"1024\" height=\"724\"><img class=\"alignleft size-large wp-image-437\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/jb_Mozilla-sept_D_flame_7-1024x724.jpg\" alt=\"jb_mozilla-sept_d_flame_7\" width=\"1024\" height=\"724\"></p><p>&nbsp;</p><p><iframe src=\"https://player.vimeo.com/video/182848582?loop=1&amp;title=0&amp;byline=0&amp;portrait=0\" width=\"820\" height=\"461\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p><p><span style=\"border-radius: 2px; text-indent: 20px; width: auto; padding: 0px 4px 0px 0px; text-align: center; font: bold 11px/20px 'Helvetica Neue',Helvetica,sans-serif; color: #ffffff; background: #bd081c  no-repeat scroll 3px 50% / 14px 14px; position: absolute; opacity: 1; z-index: 8675309; display: none; cursor: pointer; top: 410px; left: 20px;\">Save</span></p>      ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"Gervase Markham","date":"2016-09-16T00:00:00.000Z","content":"       <p>I can see this working. It’s neither the best nor the worst idea. The fact that it draws our organizational logo a bit closer to the Firefox logo and its design language has both pros and cons. I think we want Mozilla to be more than just Firefox – but it’s useful if we can leverage Firefox name recognition into an understanding of Mozilla. So…</p> <p>Gerv</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"Benjamin Smedberg","date":"2016-09-16T00:00:00.000Z","content":"       <p>I like the fact that the flame is related to the Firefox logo, but distinct.</p> <p>I personally didn’t see the “M” at all. After reading the explanation, I stared back at it and “found” the M if I looked hard enough, but I really doubt that it’s going to come across to most people. Maybe that’s ok, like the hidden arrow in the fedex logo?</p> <p>Other brainstormy thoughts:<br> * Variants of the logo which show that Mozilla is community by making the dots photos of people.<br> * Does this logo still look like a flame when it’s black-and-white/monochrome?<br> * My daughters would really love a sparkles/bling version of this!</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"Gervase Markham","date":"2016-09-21T00:00:00.000Z","content":"       <p>There’s an M? :-|</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"Paul Tincknell","date":"2016-09-21T00:00:00.000Z","content":"       <p>Really? There is an M? 😕<br> When I think of Mozilla I think of open source, privacy, and user flexibility – none which connote a flame. I think this one is a miss.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"Chris H-C","date":"2016-09-16T00:00:00.000Z","content":"       <p>I’m still trying to see what we’re trying to say with the negative space under the flame. It doesn’t occur to me to see the ‘M’ in the flame itself.</p> <p>It also isn’t too encouraging that this design requires a wordmark to explain it. If Mozilla were to become a globally-recognized brand so that our symbol is enough to evoke the entire concept (see Starbucks, and a certain hamburger joint starting with M) then it’d be okay… but Mozilla, by dint of its mission, will likely never be that visible.</p> <p>In my mind we need a brand that doesn’t need explaining. It can benefit from explanation and thought and consideration, but it _must_ stand on its own in its constituent parts.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"Merowinger","date":"2016-09-18T00:00:00.000Z","content":"       <p>Definitely my favourite.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"Brad Werth","date":"2016-09-19T00:00:00.000Z","content":"       <p>Very strong, but the “M” doesn’t come through. That may not be a problem since the flame connects back to our most well-known product via fire and the orange color. Once established, the flame will be recognizable and distinct and is very appealing on its own. This could be a design that bridges what we have to what we want to have. I like it a bunch.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"Li","date":"2016-09-19T00:00:00.000Z","content":"       <p>My favorite.  It has legs and I think a long future with flexible options.<br> Li MN</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"Tyler Netees","date":"2016-09-20T00:00:00.000Z","content":"       <p>I feel as though the wordmark needs to be integrated into the icon. I’ve loved all the designs so far, and this is my first comment. Keep doing what you do, JB!</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"Steve Fink","date":"2016-09-20T00:00:00.000Z","content":"       <p>I would never have seen the M had I not known to look for it.<br> Other than that, I kinda like it. For me, it’s between this and Protocol.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"Me","date":"2016-09-21T00:00:00.000Z","content":"       <p>This is really good! The flame could be more clearly in M-shape, but otherwise this is really good. This is the best of all I have seen in this process ( and I work as 3d designer/ animator so I guess I know something).</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"Will","date":"2016-09-21T00:00:00.000Z","content":"       <p>I really like this one. It is way better than the retro looking “fireworks” design. It’s appealing and as shown would be easy to be made to fit for certain occasions, sort of like the google doodle. This would give people something small and interesting to come back to, to see what is new today. I think the idea already mentioned of a version where it’s made up of people’s faces would be cool.</p> <p>This is a design that I could get behind and is still modern without looking overly retro, and simplistic like the rest of them. The color stands out from the black and is still rather recognizable.</p> <p>If the hidden M was a little more distinct it could add a bit to it where companies have a “hidden” meaning in their logo and so it gives added, free publicity for Mozilla.</p> <p>If there were a version adding some slight depth to the flame it could look better. A sort of just right amount. Not enough depth to make it distinctly 3D but at the same time it is not quite flat either. That probably will make it look a lot better.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"Aki Sasaki","date":"2016-09-21T00:00:00.000Z","content":"       <p>I think this is my favorite.  The circular pixelation could be one version, and there can be other variants.  It ties to the ‘spark’ theme before.  There’s a subtle M, but you don’t have to know it’s there, as long as the word ‘Mozilla’ is next to it or overlaid (AT&amp;T’s logo is recognizable, but doesn’t have an A in it; MasterCard doesn’t have an M, BMW and Mercedes have no B or M in their logos; I think the logo doesn’t have to have an M in it.)</p> <p>Also, the 4 entrants in this round are much improved over the first round; well done!</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"Enrico","date":"2016-09-21T00:00:00.000Z","content":"       <p>The logo itself is very nice and the animation is cool, but I cannot see the ‘M’. Moreover, I think would not recognize it immediately as Mozilla’s.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"H.D.Ozkan","date":"2016-09-21T00:00:00.000Z","content":"       <p>I think this one is the best among all others. I am not a graphical designer or a tech junkie, but just a simple internet user who has been loving Mozilla for a long time. Therefore I can not make technical comments, but can only comment by heart… I used to love that old fox and definitely will miss him. On the other hand, this design remains the colors of the old foxie. Those red, yellow and orange shades remind the old design and provide an emotional link with the past. It makes easier to accept and internalize the innovation. I found other designs much more “tech focused” and in my opinion blue/ green shades put distance between the brand and users. Flame design creates a “warm” feeling with the color &amp; shape, plus it still remains the tech perception by the dotted/ pixelled look. Conclusion : Go for the Flame (or the future versions, derived from this initial design) I loved it! :)</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"Arjav Mehta","date":"2016-09-22T00:00:00.000Z","content":"       <p>Most balanced option out there..  my favorite.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"Sam","date":"2016-09-22T00:00:00.000Z","content":"       <p>I very much like this one, I think it’s certainly stronger than any of the original seven concepts and the strongest of these four.<br> The symbolism in the flame is wonderful. It’s a shining light. The flame brings people together. The flame is open and bold. The flame is warm and bright. And how could you miss Mozilla FIREfox? (I know Mozilla is trying to differentiate itself from Firefox, but this connection’s not going to confuse anyone).</p> <p>The logo is very nice to look at, and stands out. I like that there’s still some of the red in it, though it’s not afraid to expand it’s pallate. The circular pixels give a modern touch without coming off as too geeky or too cold. The logo is warm and inviting, while hinting at power. It’s flexible, able to take on any color while still keeping it’s form and distinctiveness.</p> <p>I saw a few people say they didn’t see the M in the logo, but I liked it before I noticed anyway.</p> <p>I like this design. The warmth, the flexibility, the uniqueness, and it just looks good. I would also definitely wear it.</p> <p>Also one more thing:<br> Why not keep the current typeface for the wordmark? I can’t see a reason not to. It’s a very readable font and it’s been part of the wordmark for a while. Personally I think you should keep the typeface, but either way this design route is fantastic.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"RicosPaper","date":"2016-09-26T00:00:00.000Z","content":"       <p>This is the one</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"Seburo","date":"2016-09-28T00:00:00.000Z","content":"       <p>Hi</p> <p>I must admit that I am 50/50 with this one.  I too did not see the “M” and feel that Gerv makes some good points about the connection to the Firefox logo.</p> <p>Personally I think that the logo is a little inflexible.  Once we have zoomed into one of the dots at the start of a video, or recomposed the flame out of Mozillians faces, it could be a little restraining.</p> <p>But this is still not a bad design and a like the implied symbolism of many coming together to make something.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"Adrian Gaudebert","date":"2016-09-28T00:00:00.000Z","content":"       <p>This is by far my favorite. There are several reasons for that: </p> <p>1. It relates to existing things that carry values I like for Mozilla. The Firefox logo of course, which is already a very well esteemed brand, but it also makes me think of the Olympic flame and the original values of the Olympic games. </p> <p>2. I see Mozilla as a fire, I definitely agree with the notion of it being a “beacon” and a “warm place to gather around”. In my mind it plays well with our notion of community. </p> <p>3. Mozilla is also fighting, for the Open Web, for freedom on the Internet, for net neutrality, etc. The flame is a good symbol of such things. </p> <p>Also, I really like the sub-brands you are showing here. They look far better than all the others I have seen so far.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"Mathieu L.","date":"2016-09-29T00:00:00.000Z","content":"       <p>I really like it too, and agree with Adrian feedback. The derivations are awesome too!</p> <p>There is one subtle little thing that bothers me unconsciously: it reminds me a lot the logo of the French National Front. But I think we can learn to «unsee» that.</p> <div class=\"comment-image-box\"> <p class=\"comment-image-reloaded\"><a class=\"cir-image-link image-id-484\" href=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/67px-Logo_FN.svg_.png\"><img width=\"67\" height=\"146\" src=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/67px-Logo_FN.svg_.png\" class=\"attachment-baseline-mini-grid-thumb size-baseline-mini-grid-thumb\" alt=\"67px-Logo_FN.svg_\" sizes=\"(max-width: 768px) 600px, (max-width: 1000px) 160px, 300px\"></a></p> </div>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"André Jaenisch (@Ryuno-Ki)","date":"2016-09-29T00:00:00.000Z","content":"       <p>I assume, most people won’t recognise the “M” in the flame due to too few negative space in the middle of the flame. The middle part of the letter does not come through.</p> <p>Regarding the sub-brands. All hands looks like a flower. MozFest like the wings of an angel.</p> <p>I like the ASCII-Art in <a href=\"https://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/09/jb_Mozilla-sept_D_flame_7-1024x724.jpg\" rel=\"nofollow\">https://blog.mozilla.org/opendesign/files/2016/09/jb_Mozilla-sept_D_flame_7-1024×724.jpg</a> :-)</p> <p>Other than that, I would not pick this one as Mozilla’s new brand.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"Robert Kaiser","date":"2016-09-29T00:00:00.000Z","content":"       <p>First, I love the colors. That said, I wonder if the flame metaphor will make some people think that Mozilla is burning down everything else. That said, it feels good if we are to be a candle in the dark and even if our Manifesto and other messages spread like a flame – as long as it’s not a scorched earth thing.<br> I’m also not sure how unique flames are as logo imagery. so that probably needs a deeper look.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"},{"name":"amanda","date":"2016-10-04T00:00:00.000Z","content":"       <p>A bit generic, not really unique to Mozilla making it hard to own as a brand. Definitely better options in the top 4</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/round-two-flame/"}]