[{"name":"Tim Murray (@Timotay)","date":"2016-06-20T20:19:53.000Z","content":"    <p>Based on internal and external interviews, research, and our hypotheses about the future of Mozilla, we developed this discrete set of brand personality characteristics and related positioning statements. Our goal is to offer a launching-off point for further discovery, not to be an end in itself. The 7 thematic pathways will pressure test this thinking, and we’ll see what results.</p><p><a href=\"http://blog.mozilla.org/opendesign/files/2016/06/mozilla-jb_Our_Brand_Personality.jpg\"><img class=\"aligncenter wp-image-90 size-full\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/06/mozilla-jb_Our_Brand_Personality.jpg\" alt=\"mozilla-jb_Our_Brand_Personality.pdf\" width=\"1641\" height=\"2686\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/06/mozilla-jb_Our_Brand_Personality.jpg 1641w, https://blog.mozilla.org/opendesign/files/2016/06/mozilla-jb_Our_Brand_Personality-300x491.jpg 300w, https://blog.mozilla.org/opendesign/files/2016/06/mozilla-jb_Our_Brand_Personality-600x982.jpg 600w, https://blog.mozilla.org/opendesign/files/2016/06/mozilla-jb_Our_Brand_Personality-1000x1637.jpg 1000w\" sizes=\"(max-width: 1641px) 100vw, 1641px\"></a></p><p>&nbsp;</p>      ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/our-brand-personality/"},{"name":"Manuel Rico","date":"2016-07-02T00:00:00.000Z","content":"       <p>Unfortunately, I usually use Google Apps in my work and personal activities. However, I sometimes used Mozilla and I feel good about it.</p> <p>I agree with the definition of Mozilla suggested here, but I would like to see the comparison between Mozilla and competition. The -reason why- is that the comparison let us identify strengths and weaknesses of Mozilla. You must define how close the GAP first!</p> <p>Effectively positioning should:<br> a. Differentiate vs other Mozilla (Mac or PC)<br> b. Retain current users and attract non-users, giving them a -reason why- to continue using or to prefer Mozilla vs competitors<br> c. Connect people with the brand from the emotional point of view<br> d. You may need a new image (logo, etc.) consistent and aligned with the new definition of brand values ​​and essence. I mean a new identity system that reinforce the sense of the brand.<br> e. Translate business strategy in a very clear and simple way to all audiences</p> <p>Positioing statment should be easy to:<br> – understand<br> – believe<br> – remember<br> also should be relevant and most important…<br> – With rational and emotional benefits </p> <p>Thank you and congratulations for the initiative !!</p> <p>Manuel</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/our-brand-personality/"},{"name":"Tim Murray (@Timotay)","date":"2016-07-07T00:00:00.000Z","content":"       <p>Thanks, Manuel. You clearly have a great understanding of brand strategy and positioning. </p> <p>We agree that the ecosystems created by Google, Apple, Microsoft, and others are very enticing and can add a lot of value to individual users. Trying to convince people otherwise would be foolhardy. While each of these companies produces a browser product (Chrome, Safari, IE and Edge respectively) that competes with Firefox, that should not suggest that Mozilla is in the same competitive set as their parent companies. We are not in the business of creating closed systems designed to capture and hold users, nor is our business model dependent on providing access to the data of those users. As a nonprofit, open-source, collaborative organization we measure our worth differently, so direct comparisons to technology companies would not be accurate. We’ll never have their budgets. </p> <p>What we do have is a current audience of followers that is incredibly passionate and committed, and we’ve identified a much larger audience of people who live by their values offline, but have yet to apply those same values to their online lives. Once we reach those people and help them realize that they have a choice between complacency vs. empowerment, passive acceptance vs. active participation in the Internet, we know that we will grow. We have already proven that by being fearless advocates and showing the way through products like Firefox, we can influence big corporate players and expand the power of the Internet as a force of good.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/our-brand-personality/"}]