[{"name":"Tim Murray (@Timotay)","date":"2016-06-20T20:18:29.000Z","content":"    <p>This is theme one of a series of seven. We’ve developed these to help us decide on the future direction of the Mozilla brand, and now we want your thoughts as well.</p><p>This theme is all about equality and accessibility on the Internet, for everyone. Read the words, consider the pictures*, then ask yourself:</p><p>Does this reflect what Mozilla promises to the world?<br>Does this reinforce the experiences and values Mozilla delivers?<br>Does this communicate the ‘right’ image to the world?</p><p><a href=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/06/4-1.jpg\"><img class=\"aligncenter wp-image-80 size-full\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/06/4-1.jpg\" width=\"2590\" height=\"4499\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/06/4-1.jpg 2590w, https://blog.mozilla.org/opendesign/files/2016/06/4-1-300x521.jpg 300w, https://blog.mozilla.org/opendesign/files/2016/06/4-1-600x1042.jpg 600w, https://blog.mozilla.org/opendesign/files/2016/06/4-1-1000x1737.jpg 1000w\" sizes=\"(max-width: 2590px) 100vw, 2590px\"></a><br>Please use the comments below to let us know what you think.</p><p>* The images you see on these boards are for illustrative purposes only. Don’t take offense if we’ve used an image of your company or project – please be flattered.</p>      ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"},{"name":"Rob Pape","date":"2016-06-21T00:00:00.000Z","content":"       <p>A dynamic brand (Atom Bank) would suite Mozilla well. A changing element that can be individual an localised to a particular area and yet globally recognised, being for everyone in two deferent ways. Having this style of branding would give the “freedom” to change and adapt to particular platforms or products.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"},{"name":"Tim Murray (@Timotay)","date":"2016-06-21T00:00:00.000Z","content":"       <p>A consideration for us as an open-source, global organization is to develop a brand system that allows Mozilla communities in cities and towns around the world to participate creating their own version of our Mozilla identity without diluting the brand benefits that come from repeated exposure to a consistent brand. Stray too far, and the Mozilla brand becomes unrecognizable out in the world. Apply the brand system too rigidly, and our communities lose their unique flavor.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"},{"name":"Alex Salkever","date":"2016-06-21T00:00:00.000Z","content":"       <p>The concept of Internet for All is to me a bit too abstract and not really positive enough. I’d prefer a branding concept that tells me a bit more specifically about what the brand stands for…so more like “Making the Internet a Better Place for All”. What do you think? I’d love to hear what others have to say!</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"},{"name":"Tim Murray (@Timotay)","date":"2016-06-21T00:00:00.000Z","content":"       <p>I agree. For All was deliberately designed to be one of the softest and most passive of the 7 to provide stark contrast to other options. One of Mozilla’s roles in the world is to ensure that those who are just coming online (via their mobile device, in most cases) get to experience the wide-open web that many of us in places with advanced Internet enjoyed. Were we to move forward with this thematic direction, we’d have to be more direct than “better” to incorporate the idea of greater access.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"},{"name":"Anthony ‘Bud’ Florkoski","date":"2016-06-21T00:00:00.000Z","content":"       <p>Well,I am a avid computer user and at my age of 58 years am not inclined to use my phone or even my tablet to use the internet.My phone and  tablet mostly are used for email and a little texting (not much at all of the texting).<br> I like real estate when I use the web/internet.My laptop is a 17″ and my imac is a 27″.I note you Tim are using the mobile devices and see that will certainly be way an increasing number of people will be doing this.</p> <p>That said I like the concept and will be watching what Mozilla does in coming years.I have prefered Mozilla for some time and don’t plan to change that.</p> <p>I only wish I could contribute more some how. I do have some time daily ….</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"},{"name":"Tim Murray (@Timotay)","date":"2016-06-21T00:00:00.000Z","content":"       <p>Thanks for your support, Bud, and for being a loyal Firefox user. Firefox is much better known than Mozilla, and since Mozilla does much more than produce a web browser—including building technologies core to the Internet, working to maintain Net Neutrality and strong encryption, and teaching Web literacy around the world—we have a ways to go to reach its level of popularity. Your continued feedback and support are great contributions!</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"},{"name":"Priyanka Sharma","date":"2016-06-21T00:00:00.000Z","content":"       <p>I love the concept of global and personalized design. Most of the percentage of internet users is non-tech and it’s essential branding works in a way that’s not hard for them to understand. Also, the user base varies massively in geography, age, education, so it’s a challenge to see how the brand connects to them all.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"},{"name":"Tim Murray (@Timotay)","date":"2016-07-07T00:00:00.000Z","content":"       <p>Thanks, Priyanka (and sorry for the tardy reply to your comment)! I hope that as we begin to reach the concept phase, you’ll help us determine if the solutions we suggest will be well understood and well received beyond all borders.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"},{"name":"Stewie Griffin","date":"2016-06-22T00:00:00.000Z","content":"       <p>When Brendan Eich left Mozilla, I started to have doubts about the future of the foundation. And now Firefox loses users, and this is the way to change the situation? A change image will not change this. Mozilla needs a strong flagship and the flagship is Firefox.  Without this Mozilla it is not able to achieve any goals.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"},{"name":"Tim Murray (@Timotay)","date":"2016-06-22T00:00:00.000Z","content":"       <p>Hey Stewie, thanks taking the time to write. Refreshing the Mozilla brand identity is not a substitute for improvements in Firefox, which are happening as we speak. Agreed that Firefox, as the product for which Mozilla is best known, has an out-sized impact on how we are perceived. That said, we do so much more than produce a web browser, including developing core technologies like Rust, driving web literacy in the parts of the world that are just coming online, advocating for stronger encryption and net neutrality, and more. Most of this Mozilla work is unknown. While the Firefox experience gets better, we need to tell the Mozilla story too. Thanks for continuing to root for us.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"},{"name":"Axel Hecht","date":"2016-06-23T00:00:00.000Z","content":"       <p>I’m afraid that the inequalities among humans are dominated by physical access to the internet.<br> Mozilla can have an impact on two people from the same cultural background, and also to people that come to the internet.<br> But I don’t think that we can have real impact on whether people access the internet at all, or how affordable that is to them.</p> <p>For the campaigns we did along this theme in the past, they always felt awkward to me. For example the “internet === water” one makes me wonder how people in Africa relate to that.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"},{"name":"Tim Murray (@Timotay)","date":"2016-06-23T00:00:00.000Z","content":"       <p>Thanks, Axel. You’re right in that the role Mozilla plays is less about creating the infrastructure (e.g. cellular towers or wi-fi) through which people access the Internet. We’re more about ensuring a level playing field for Internet access, being a neutral and trusted guardian of the Internet, empowering people to use the Internet to gain knowledge and opportunity, and promoting Web literacy to create better digital citizens. The “Food. Water. Shelter. Internet.” campaign we ran earlier this year  was an attempt to speak to an urban U.S. audience (It didn’t run outside the U.S.) that hadn’t thought of the Internet as a global public resource or basic need worth protecting. The Internet not only follows on the heels of other basic needs but is increasingly critical to the delivery of basic needs to populations in need. Standing for “Internet For All” may be too reductive and lead people to assume we’re responsible for Internet infrastructure instead of guiding principles. Thanks for pointing that out.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"},{"name":"Fred Guth","date":"2016-06-28T00:00:00.000Z","content":"       <p>Not only can “Internet for All” be too reductive, it can also be confused with initiatives in the opposite direction.  </p> <p>Internet.org has this “Internet for All” positioning and, in my view, is contrary to what Mozilla stands for.  The problem is that there are millions who are getting connected and still don’t know what this internet Mozilla defends really is.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"},{"name":"Tim Murray (@Timotay)","date":"2016-06-29T00:00:00.000Z","content":"       <p>Thanks for pointing out the difference between access and understanding, Fred. Internet.org, the Facebook initiative to provide baseline access to only a limited range of Website services in India, may have temporarily subverted the language of “for all,” but we still believe in that principle. To your point, many people coming online for the first time do so with a smartphone. Asked if they are on the Internet, they often reply, “Yes, I’m on Facebook.” or “I use WhatsApp.” They are unaware that a universe of knowledge, connection, and opportunity exists outside of a handful of apps, and they have no idea that they personally are empowered to grow the future Internet. Our role is to educate and demonstrate that options exist to corporate consolidation. It should not become a new form of digital divide.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"},{"name":"Eric Shepherd","date":"2016-06-23T00:00:00.000Z","content":"       <p>This has some bits I like (the Web is for everyone) but I have a couple of concerns. I’ll admit, I’ve never been comfortable with any major branding or promotional campaigns that make our open source/non-profitness a key point. Even though it is, in fact, an important part of what Mozilla is, going on too much about how we’re open and free and non-profit and fighting for the little guy and defending liberty and justice for all can tread into the realm of sounding, well, hippy-dippy. This stuff is important, but there’s only so much you can talk about it before you start picturing hippies smoking weed and putting flowers in their hair while dancing barefoot in the park. :)</p> <p>Our brand needs to be something that says who we are without shoving messages down the throat of the audience. This is a common theme among my comments on these themes: a worry about being too powerful in messaging, in a way that overwhelms what we are when trying to say who we are, and overstates why we are in way that could be offputting to some people.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"},{"name":"Tim Murray (@Timotay)","date":"2016-06-23T00:00:00.000Z","content":"       <p>Thanks, Eric. Point well taken. Mozilla can be equally appealing to libertarians and progressives. While we don’t want deliberately to shut out people who share our values, we also don’t want to be so blandly amenable that we recede into the background. (Some have argued that we are not as relevant as we once were; I disagree but think we need to tell our story more strongly.) A strong brand will not appeal to everyone and that’s OK. We believe there is an enormous pool of people globally who want a freer, less commercial, more independent Internet experience if they have been online for a while, and others who just want to access a fair and equal Internet at all. People who take considered steps in their offline life (like voting, volunteering, and making environmental choices for instance) but have yet to apply those same values to their life online. Once they know Mozilla, they will want to become a part of our community and mission. Thanks for sparking this dialogue.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"},{"name":"Henry Dupont","date":"2016-06-25T00:00:00.000Z","content":"       <p>Here is a good, honest, sincere image change for you:</p> <p>Please cut all your ties with Google, starting with financing, letting Chrome developers touch Firefox, and copying the faults of Chrome.</p> <p>Please also let go of most marketing people, and any single person giving any credit to telemetry, particularly anyone saying idiocies like “our numbers say only a small percentage of our users use this feature, so we’ll remove it”, while your user share dropped from 30% to 10-15%, since 2011. Does it ring a bell? Like, you know, Firefox 3.7/4.0…? Telemetry is sickening, useless, and an insult to users. Before letting them go, please print a poster for them, which says “If your remove 100 features only 1% of your users use, you may lose up to every single one of your users”.</p> <p>Don’t also forget to let go of anyone calling himself a usability expert, who thinks removing the status bar, and replacing it with a pop-above, was a good idea. That’s just one of the many abominations in Firefox now, which are, by themselves, obvious proofs someone is 100% incompetent to say any word regarding usability or accessibility.</p> <p>Then go back to a usable, accessible, ergonomic, useful browser, which really values privacy and security, for your community of advanced users. That’s Firefox 3.6, with strictly selected changes from newer versions.</p> <p>Firefox is a browser by advanced users, for advanced users. These advanced users popularized the browser to their friends and family, to get to 30% user share. Then Google buys Firefox developers to make Chrome, and these developers come back to make Firefox a Chrome clone, shitting on advanced users. The advanced users stop talking about Firefox to their friends and family. Their friends and family install Chrome from the link on Google’s homepage, or even go back to IE/Edge, particularly the next time they buy a new computer. User share drops to 10-15%. Firefox devs: “We aren’t cloning Chrome fast enough, our browser is still targeted too much toward advanced users, we are losing all our basic users!”… duh…</p> <p>Money makes stupid and corrupt.</p> <p>(I won’t read replies, I’m too tired and lazy, have fun negating the truth).</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"},{"name":"Piradix","date":"2016-06-27T00:00:00.000Z","content":"       <p>All in english, did you write something in another language ? FR, DE …</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"},{"name":"Tim Murray (@Timotay)","date":"2016-06-27T00:00:00.000Z","content":"       <p>Thanks for raising this point, Piradix. We’ll connect with the Mozilla localization team to see if they have bandwidth to take this task on. </p> <p>The brief for this work calls for the refreshed brand identity to be a flexible system that works globally, embracing the dozens of Mozilla communities worldwide. The process of getting there has begun in English; I wish we had the resources at hand to publish simultaneously in major languages at least. </p> <p>Our localization team is made up mostly of volunteer contributors who translate and localize a great deal of Mozilla and Firefox communication. Their incredible work often goes unheralded and they welcome new contributors to lighten the load. If there’s anyone reading this blog who would like to contribute their time to the effort of making this blog more accessible in more languages, please let us know.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"},{"name":"André Jaenisch (@Ryuno-Ki)","date":"2016-06-29T00:00:00.000Z","content":"       <p>I’m involved as translator in the B2G OS Community project.<br> I helped on SuMo (support.mozilla.org) and MDN in the past, too.</p> <p>However, since these suggestions are composed of images I cannot imagine how I would be able to translate them. Blind users are cut out here entirely. The same problem I see with infographics: Too much information put into a giant image without a text representation.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"},{"name":"André Jaenisch (@Ryuno-Ki)","date":"2016-06-29T00:00:00.000Z","content":"       <p>I’m using Firefox since I got my own Internet connection :-)<br> But only in the younger past I learned to value the ability to connect to people all over the world. It helps me understand the boundaries of my culture (and vica versa).</p> <p>Don’t forget Thunderbird as a very well known Mozilla project as well (now maintained by the community).</p> <p>I’d like to see the Internet as enabler of understanding people from other parts of the world. I got the impressions, that we lost this view over the last decades – next to the decentral nature of the web. I hope Mozilla can play a role in getting back there.</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"},{"name":"abbas","date":"2016-07-14T00:00:00.000Z","content":"       <p>I send to your email my works .please see that</p>     ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/for-all/"}]