[
  {
    "name": "Michael Johnson",
    "date": "2016-07-05T19:00:28.000Z",
    "content": "    <p>After the fusillade of recent posts and articles on this open design project, it&nbsp; occurred to me that we hadn’t really shared in detail the issues that Mozilla face. So this piece digs a little deeper into the obstacles and opportunities facing the organization.</p><p>Like many, we weren’t completely clear who Mozilla were when they contacted us earlier in the year. Yes, we knew the name and of course we know and use Firefox, but how the two were interrelated wasn’t clear. And the fact that Mozilla is a non-profit? Completely passed us by.</p><p>After a brief bit of research, especially within the tech community, we realized that Mozilla was seen by some as a hero of the Internet. They had stood up to ‘Internet Explorer’ (in the days when Microsoft controlled most of the world’s browsing) and were one of the pioneers of ‘open source’. They are a non-profit in an Internet world that is increasingly closed, tracked and monetized.</p><p>This is a great back story, and helps explains the residual goodwill that we encounter in virtually every conversation we have. Yet, somewhere along the way, Mozilla’s ‘reason to be’ got a little lost. If your answer to the question ‘why are you here?’ is ‘to keep updating Firefox’, well that’s not much of a response. Especially when Firefox is caught in a browser war with the very powerful and extremely well funded Chrome.</p><p>But, there’s no doubt that to the tech community, affection remains – and they would ‘come back’, if encouraged to do so.</p><p>Currently, the majority of the world’s population couldn’t give two hoots about who is watching their searches, why those ads keep following them and what a walled garden means, let alone who waters it. But, just as hundreds of thousands choose to read The Guardian on paper and millions in pixels, there’s clearly a segment of the world that does care how they use the Internet, and how the Internet uses them. In simple terms – there’s an audience out there who cares about this stuff, and in a world slowly waking up to online issues, it’s a growing one.</p><p>So it’s no great surprise that Mozilla’s team has been looking hard at how they want to verbally define the organization going forward, which led to the seven themes we shared a week ago (and the tweaks we’ve already started to make).</p><p><img class=\"wp-image-111 size-large aligncenter\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/07/Mozilla_themes_overview-1024x677.png\" alt=\"Mozilla_themes_overview\" width=\"1024\" height=\"677\">If that’s the work in progress on the ‘verbal’ definition of Mozilla, what about the visual? Well, from a naming perspective, ‘Mozilla’ is great – it’s short, memorable and, typographically tasty (what with that ‘z’ and all).</p><p><img class=\"wp-image-113 size-medium aligncenter\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/07/Mozilla_Audit_logo-300x116.jpg\" alt=\"Mozilla_Audit_logo\" width=\"300\" height=\"116\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/07/Mozilla_Audit_logo-300x116.jpg 300w, https://blog.mozilla.org/opendesign/files/2016/07/Mozilla_Audit_logo-600x232.jpg 600w, https://blog.mozilla.org/opendesign/files/2016/07/Mozilla_Audit_logo-1000x387.jpg 1000w, https://blog.mozilla.org/opendesign/files/2016/07/Mozilla_Audit_logo.jpg 1500w\" sizes=\"(max-width: 300px) 100vw, 300px\">What many don’t realize is that the name was a combination of ‘Mosaic killer’ and ‘Godzilla’ (Mosaic being one of the earliest non-open source browsers). For many years its identity was led by a dinosaur, drawn by Shepard Fairey, way before his Obama/Hope fame, and it’s little surprise that Mozilla communities across the world adopted or created variants on the dinosaur/lizard theme with gusto.</p><p><img class=\"aligncenter size-large wp-image-114\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/07/Mozilla_Audit_dino_etc-1024x297.jpg\" alt=\"Mozilla_Audit_dino_etc\" width=\"1024\" height=\"297\">A few years ago, a decision was taken to retire the dinosaur, replaced by a fairly corporate looking design system. Slowly things started to look more neutral and less edgy – which is odd for an organization with some pretty hard hitting things to say.</p><p><img class=\"aligncenter wp-image-115 size-large\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/07/Mozilla_Audit_online-1024x638.jpg\" alt=\"Mozilla_Audit_online\" width=\"1024\" height=\"638\">It had staked most of its visual estate on a grey piece of lower-case type, written in Meta – once described as the ‘Helvetica of the 90s’ – and the feisty edge of Mozilla’s communications and messaging began to lose their punch.</p><p><img class=\"aligncenter size-medium wp-image-116\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/07/Mozilla_Audit_other_meta-300x199.jpg\" alt=\"Mozilla_Audit_other_meta\" width=\"300\" height=\"199\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/07/Mozilla_Audit_other_meta-300x199.jpg 300w, https://blog.mozilla.org/opendesign/files/2016/07/Mozilla_Audit_other_meta-600x398.jpg 600w, https://blog.mozilla.org/opendesign/files/2016/07/Mozilla_Audit_other_meta-1000x663.jpg 1000w, https://blog.mozilla.org/opendesign/files/2016/07/Mozilla_Audit_other_meta.jpg 1500w\" sizes=\"(max-width: 300px) 100vw, 300px\">Now, 18 years ago Meta was truly the meta-typeface, and I too used it on everything, just like the rest of the world. But that’s part of the problem – if everyone from Mumsnet to furniture manufacturers and children’s charities use the same typography, you’re not going to stand out.<br>And the lack of an official symbol of any kind is also a handicap. Many digital brands now combine word marks (think of the Twitter and Instagram) with symbols that encapsulate their brands down into tiny icons (Twitter’s bird and Instagram’s camera). These are identity systems that can cope with any environment and every need, writ large on a billboard or battling it out at 48 pixels. The closest Mozilla has come is a red heart (but that might be a little tricky to trademark) and the occasional use of the lowercase ‘m’ from the word mark.</p><p><img class=\"aligncenter wp-image-117 size-large\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/07/Mozilla_Audit_architecture-1024x711.jpg\" alt=\"Mozilla_Audit_architecture\" width=\"1024\" height=\"711\">Couple typographic neutrality and the vacuum created by the lack of a symbol with the happy chaos that is the organization’s brand architecture…</p><p><img class=\"aligncenter wp-image-118 size-large\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/07/Mozilla_Audit_subbrands-1024x842.jpg\" alt=\"Mozilla_Audit_subbrands\" width=\"1024\" height=\"842\">…its sub-brands…</p><p><img class=\"size-medium wp-image-119 alignnone\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/07/Mozilla_Audit_colours-300x243.jpg\" alt=\"Mozilla_Audit_colours\" width=\"300\" height=\"243\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/07/Mozilla_Audit_colours-300x243.jpg 300w, https://blog.mozilla.org/opendesign/files/2016/07/Mozilla_Audit_colours-600x486.jpg 600w, https://blog.mozilla.org/opendesign/files/2016/07/Mozilla_Audit_colours-1000x809.jpg 1000w, https://blog.mozilla.org/opendesign/files/2016/07/Mozilla_Audit_colours.jpg 1500w\" sizes=\"(max-width: 300px) 100vw, 300px\"><img class=\"size-medium wp-image-120 alignnone\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/07/Mozilla_Audit_grads_tabs-300x188.jpg\" alt=\"Mozilla_Audit_grads_tabs\" width=\"300\" height=\"188\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/07/Mozilla_Audit_grads_tabs-300x188.jpg 300w, https://blog.mozilla.org/opendesign/files/2016/07/Mozilla_Audit_grads_tabs-600x376.jpg 600w, https://blog.mozilla.org/opendesign/files/2016/07/Mozilla_Audit_grads_tabs-1000x627.jpg 1000w, https://blog.mozilla.org/opendesign/files/2016/07/Mozilla_Audit_grads_tabs.jpg 1500w\" sizes=\"(max-width: 300px) 100vw, 300px\"></p><p>…and a gradient rich house style which is looking a little behind the times.</p><p><img class=\"aligncenter size-large wp-image-121\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/07/Mozilla_Audit_communities-1024x703.jpg\" alt=\"Mozilla_Audit_communities\" width=\"1024\" height=\"703\">Without any clear branding system and the lack of direction from HQ, community identities began to switch back and forth between dinosaurs, lizards, foxes and, er, elephants. Not their fault, by any means, just the classic behavioral tics of a wide-spread organization struggling to keep its branding<br>consistent.</p><p>You’re hopefully starting to see that something is needed here. What that ‘something’ is? That’s to be decided, and goes hand-in-hand with the verbal narrative work.</p><p>Since we’re working at speed, it seems likely that we’ll edit our themes down to two to three directions then start to explore those visually, making sure that we <a href=\"https://blog.mozilla.org/opendesign/what-weve-learned-so-farand-why-we-deserve-a-dope-slap/\">dial up the positivity</a> along the way.</p><p>Watch this space.</p>      ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/going-deeper-into-mozillas-identity-problem/"
  },
  {
    "name": "Edward Allanby",
    "date": "2016-07-12T15:02:00.000Z",
    "content": "       <p>I agree – all those inconsistent marks are a head fuck and for sure things need to be easier to understand, but conversely all the randomness does say ‘freedom’ and taps into the non-hierarchical ‘open for all’ character described in your themes. </p> <p>There is something adorable about the mish-mash – It feels like there are all these do-it-your-selfers in control.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/going-deeper-into-mozillas-identity-problem/"
  },
  {
    "name": "Tim Murray (@Timotay)",
    "date": "2016-07-12T22:55:00.000Z",
    "content": "       <p>Yes, our Mozilla communities around the world know a lot about what brand identity will resonate for their locality, they have a lot of passion to create, and this is awesome. Most of these marks were made this way because no guidelines existed to suggest otherwise. Once informed that there’s a benefit to the Mozilla they love in aiming their creativity in one general direction, they are eager to help. Our ultimate goal is to create a brand system that allows the freedom to participate while still contributing toward a consistent, recognizable Mozilla brand. This may not be easy but it’s worth a shot! Stay tuned to see if collectively we can pull it off.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/going-deeper-into-mozillas-identity-problem/"
  },
  {
    "name": "Gervase Markham",
    "date": "2016-07-19T06:59:00.000Z",
    "content": "       <p>Whatever happens, bring back the dino. He’s awesome, he’s different, he can be either scary or cute depending on the occasion (see some of Sean’s drawings) and despite the attempt to ditch him, he’s living on in the hearts and unofficial logos of thousands of Mozillians. Even the recent Friends and Family Day 2016 t-shirt had cute foxes and dinos around a fire. We can make it work!</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/going-deeper-into-mozillas-identity-problem/"
  }
]
