[
  {
    "name": "Michael Johnson",
    "date": "2016-08-12T19:01:42.000Z",
    "content": "    <p style=\"text-align: left;\">It’s been a little quiet around here for a week or so because we’ve had our heads down agreeing the final verbal themes for the Mozilla brand project.</p><p style=\"text-align: left;\">Six weeks ago we shared our initial seven themes, and then took hundreds of comments from the Mozillians at the All Hands conference in London. We gathered some useful comments online, plus some invaluable feedback internally – especially about upping the positivity and doing more with the whole principle of ‘open’.</p><p style=\"text-align: left;\"><img class=\"aligncenter size-medium wp-image-139\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/08/thegoodfight-300x280.jpg\" alt=\"thegoodfight\" width=\"300\" height=\"280\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/08/thegoodfight-300x280.jpg 300w, https://blog.mozilla.org/opendesign/files/2016/08/thegoodfight-600x561.jpg 600w, https://blog.mozilla.org/opendesign/files/2016/08/thegoodfight-1000x934.jpg 1000w, https://blog.mozilla.org/opendesign/files/2016/08/thegoodfight.jpg 1477w\" sizes=\"(max-width: 300px) 100vw, 300px\">So now we’re ready to share our final five thematic options.</p><p style=\"text-align: left;\"><strong>Taking a stand</strong></p><p style=\"text-align: left;\">Right from the off there’s been a desire to play to Mozilla’s non-profit strengths, amplify its voice and turn up the volume. Previously this overall direction was more about what Mozilla were fighting against – we’ve turned this to be more about what Mozilla are fighting for.</p><p style=\"text-align: left;\"><strong>Theme 1: The Good Fight</strong><br>Sometimes you have to fight for what you believe in. Mozilla believes in an open, equal, accessible Internet – for everyone. One that makes us active creators, not passive receivers. One that works for the benefit of the many, not the few. We’re ready to take a stand, link arms with others who share our view of the future, and provide tools and opportunities for those who need them. You can wish for a better web, and a better world. Or you can get involved and make it happen.</p><p style=\"text-align: left;\"><img class=\"aligncenter size-medium wp-image-137\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/08/fortheinternetofpeople_2-1-300x288.jpg\" alt=\"fortheinternetofpeople_2\" width=\"300\" height=\"288\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/08/fortheinternetofpeople_2-1-300x288.jpg 300w, https://blog.mozilla.org/opendesign/files/2016/08/fortheinternetofpeople_2-1-600x575.jpg 600w, https://blog.mozilla.org/opendesign/files/2016/08/fortheinternetofpeople_2-1-1000x959.jpg 1000w, https://blog.mozilla.org/opendesign/files/2016/08/fortheinternetofpeople_2-1-32x32.jpg 32w, https://blog.mozilla.org/opendesign/files/2016/08/fortheinternetofpeople_2-1.jpg 1478w\" sizes=\"(max-width: 300px) 100vw, 300px\"><br><strong>Positive impact on humanity</strong><br>Another realization after our first stage of work was that we’d become too mired in geek-speak and weren’t successfully explaining how a healthy Internet helps everyone. So theme two concentrates on people, not machines.</p><p style=\"text-align: left;\"><strong>Theme 2: For the Internet of People</strong><br>Mozilla believes that the Internet should work for people – and the best way to achieve that is to give people the power to shape the Internet. At its best, the Internet is humanity’s greatest invention. It has the ability to connect human minds and free human potential on a scale never seen before. But we need to keep it open, always. We need to distribute power widely, not divide it narrowly. We need to build bridges, not walls. The future of the Internet is amazing, as long as it remains the Internet of People.</p><p style=\"text-align: left;\"><img class=\"aligncenter size-medium wp-image-136\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/08/chooseopen-300x255.jpg\" alt=\"chooseopen\" width=\"300\" height=\"255\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/08/chooseopen-300x255.jpg 300w, https://blog.mozilla.org/opendesign/files/2016/08/chooseopen-600x510.jpg 600w, https://blog.mozilla.org/opendesign/files/2016/08/chooseopen-1000x851.jpg 1000w\" sizes=\"(max-width: 300px) 100vw, 300px\"><br><strong>About ‘Open’</strong><br>We had a sneaking suspicion that we’d buried the whole debate about ‘open’ too deep in the first tranche of work. So the third theme addresses this head on.</p><p style=\"text-align: left;\"><strong>Theme 3: Choose open</strong><br>The future of the internet can be open, or closed. We choose open. We choose an internet that is equal and accessible by default. Open to ideas, open to collaboration, open to everyone. But it isn’t a choice we can make alone. An open web is something we all have to choose together. And it involves many other choices. The tools we use. The products we support. The way we behave online. Those choices can be complex, but the guiding principle should always be simple. Choose open.</p><p style=\"text-align: left;\"><img class=\"aligncenter size-medium wp-image-135\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/08/betterinternetstartshere-300x284.jpg\" alt=\"betterinternetstartshere\" width=\"300\" height=\"284\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/08/betterinternetstartshere-300x284.jpg 300w, https://blog.mozilla.org/opendesign/files/2016/08/betterinternetstartshere-600x567.jpg 600w, https://blog.mozilla.org/opendesign/files/2016/08/betterinternetstartshere-1000x946.jpg 1000w\" sizes=\"(max-width: 300px) 100vw, 300px\"><br><strong>The pioneers</strong><br>In our discussions at the Mozilla London All Hands meeting, and since, we’ve been talking about Mozilla’s pioneering role in the early development of the Internet, and ever since. So theme four looks hard at this (and brings back some of that grit as well, just for good measure).</p><p style=\"text-align: left;\"><strong>Theme 4: With you from the start</strong><br>Mozilla was, is, and always will be on the side of those who want a better, freer, more open Internet. In the early days, we were among those helping to embed principles of openness and accessibility into the web’s DNA. Now those principles matter more than ever. We need an Internet that works wonders for the many, not just the few. We need to stand by the founding ideals of the Internet, and carry them forward into new products, platforms, conversations, and great ideas. We’ve been with you from the start. And we’re just getting started.</p><p style=\"text-align: left;\"><img class=\"aligncenter size-medium wp-image-138\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/08/mavericksunited-297x300.jpg\" alt=\"mavericksunited\" width=\"297\" height=\"300\"><br><strong>The maker community</strong><br>Last, but definitely not least, we wanted a clearer idea that summed up the dynamic online community worldwide that Mozilla represents. Now that we’ve met hundreds of them in person, we wanted something that verbally did them justice.</p><p style=\"text-align: left;\"><strong>Theme 5: Mavericks, united</strong><br>The Internet belongs to mavericks and independent spirits. It’s the sum total of millions of people working towards something greater than themselves. We believe the independent spirit that founded the Internet is vital to its future. But being independent doesn’t mean being alone. We bring together free thinkers, makers and doers from around the world. We create the tools, platforms, conversations, and momentum to make great things happen. We’re not waiting for the future of the Internet to be decided by others. It’s ours to invent.</p><p style=\"text-align: left;\">What’s next? Well, in parallel to agreeing all of the above, we’ve started the design routes that go with each one. With a bit of luck, we’ll be ready to share our first thoughts on that very soon.</p>      ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/and-then-there-were-five/"
  },
  {
    "name": "عبدالرحمن الشياب",
    "date": "2016-08-20T05:26:00.000Z",
    "content": "       <p>They were all complicated and bad choices, I like it to be simple.</p>     ",
    "event_type": "Mozilla Blog",
    "source": "https://blog.mozilla.org/opendesign/and-then-there-were-five/"
  }
]
