[{"name":"Elio Qoshi (@elioqoshi)","date":"2016-06-15T10:58:26.000Z","content":"    <p>I would never have thought that one day I’d be a designer for open source projects. That was so 4 years ago at least.</p><p>Why? Because I used to start practically every sentence with the pronoun “I” (as I have with this very blog post even). It’s not completely unjustified that we designers have gained quite a reputation as stubborn perfectionists with a sprinkle of arrogance on top.</p><p><a href=\"https://en.wikipedia.org/wiki/How_to_Win_Friends_and_Influence_People\">Dale Carnegie noted in 1936 </a>that most conversations between people start with the pronoun “I”. Being self-centered is a &nbsp;part of human nature, especially for designers.However, that doesn’t mean that we should keep it that way when we can use this feature for not only the greater good, but even to our advantage</p><p>Same applies to design as well.</p><p>Instead of taking traditional design processes for &nbsp;granted like everyone does, why not try to doubt it for a moment? At Mozilla we haven’t been exactly famous for doing things the way major corporations do, so design shouldn’t be any different in that regard.</p><p>This is the core sentiment of Mozilla Community Design, a great example of tapping &nbsp;into the power of an open community. &nbsp;We are extending and improving &nbsp;visual design all across Mozilla in a similar transparent manner to how &nbsp;developers contribute to &nbsp;an open source project. Although this doesn’t come naturally to many designers, it is a much needed approach in a non-profit organization like Mozilla that depends on volunteer contributors.</p><h1><strong>Kicking off Mozilla Community Design&nbsp;</strong></h1><p><img class=\"size-medium wp-image-31 alignright\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/06/81f5ccaa-049d-11e6-8a15-e6b350192b95-300x300.jpg\" alt=\"81f5ccaa-049d-11e6-8a15-e6b350192b95\" width=\"300\" height=\"300\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/06/81f5ccaa-049d-11e6-8a15-e6b350192b95-300x300.jpg 300w, https://blog.mozilla.org/opendesign/files/2016/06/81f5ccaa-049d-11e6-8a15-e6b350192b95-150x150.jpg 150w, https://blog.mozilla.org/opendesign/files/2016/06/81f5ccaa-049d-11e6-8a15-e6b350192b95-600x600.jpg 600w, https://blog.mozilla.org/opendesign/files/2016/06/81f5ccaa-049d-11e6-8a15-e6b350192b95.jpg 1000w, https://blog.mozilla.org/opendesign/files/2016/06/81f5ccaa-049d-11e6-8a15-e6b350192b95-32x32.jpg 32w, https://blog.mozilla.org/opendesign/files/2016/06/81f5ccaa-049d-11e6-8a15-e6b350192b95-50x50.jpg 50w, https://blog.mozilla.org/opendesign/files/2016/06/81f5ccaa-049d-11e6-8a15-e6b350192b95-64x64.jpg 64w, https://blog.mozilla.org/opendesign/files/2016/06/81f5ccaa-049d-11e6-8a15-e6b350192b95-96x96.jpg 96w, https://blog.mozilla.org/opendesign/files/2016/06/81f5ccaa-049d-11e6-8a15-e6b350192b95-128x128.jpg 128w, https://blog.mozilla.org/opendesign/files/2016/06/81f5ccaa-049d-11e6-8a15-e6b350192b95-45x45.jpg 45w\" sizes=\"(max-width: 300px) 100vw, 300px\"></p><p>With the help of the Participation team at Mozilla, &nbsp;with Lucy Harris leading the effort from the staff side, we were finally able to gather a great number of Mozilla volunteers and staff to join the Community Design kickoff in January 2016</p><p>The result was highly inspirational: 27 Mozillians attended the first Community Design call, among them Visual Designers and UX and Creative Leads from across various teams at Mozilla. I was humbled to be part of the core effort , the same kind of initiative that once inspired me to join Mozilla.</p><p>The tools used in Community Design aim to empower openness as well. Mozilla staff (and other contributors like me) can file requests on the <a href=\"https://github.com/mozilla/Community-Design\">GitHub</a> repo, and any designer who wishes can easily take them on.</p><p>This allows for a quick contribution path for new contributors in a decentralized manner.</p><p>Different labels determine what kind of context issues have, neatly sorted in UX, IX, UI and general Graphic Design, to allow contributors from various backgrounds to jump in.</p><p>Monthly meetings allow us to sum-up the work we have been doing in the past weeks and to build community as designers.</p><p>As of today, we have processed more than 40 design requests through &nbsp;the combined power of the community. It was clear that we had reached critical mass.Volunteers will continue to take an irreplaceable part in shaping the vision of the new Mozilla brand to the benefit of millions of people around the world.</p><h1><b>Shaping the future</b></h1><h1><b><img class=\"size-medium wp-image-34 alignleft\" src=\"http://ffp4g1ylyit3jdyti1hqcvtb-wpengine.netdna-ssl.com/opendesign/files/2016/06/Screen-Shot-2016-06-15-at-2.40.17-AM-300x128.png\" alt=\"Screen Shot 2016-06-15 at 2.40.17 AM\" width=\"300\" height=\"128\" srcset=\"https://blog.mozilla.org/opendesign/files/2016/06/Screen-Shot-2016-06-15-at-2.40.17-AM-300x128.png 300w, https://blog.mozilla.org/opendesign/files/2016/06/Screen-Shot-2016-06-15-at-2.40.17-AM-600x257.png 600w, https://blog.mozilla.org/opendesign/files/2016/06/Screen-Shot-2016-06-15-at-2.40.17-AM-1000x428.png 1000w\" sizes=\"(max-width: 300px) 100vw, 300px\"></b></h1><p>Of course it’s not all pixie dust and silver bullets. We have still a great way to go to empower designers to enjoy the same openness so many other functional teams at Mozilla experience.</p><p>We are aiming to have open office hours weekly engaging staff and design contributors alike, as well as design sprints to catch up on work in a very concentrated way.</p><p>A personal inspiration of mine is the<a href=\"http://opensourcedesign.net/\"> Open Source Design community</a>, which never ceases to amaze me with its determination and support towards designers and developers in open source alike. They have been able to strike a great balance between open source and great design, a philosophy which we borrowed for Mozilla Community Design as well. Sharing is caring.</p><p>So next time you are hesitating to open source an already “established” process of yours, remember that we are open sourcing design. So you can probably do it too.</p><p>Did you notice the absence of a certain “I” pronoun here?</p><p><em>Written by Elio Qoshi</em></p>      ","event_type":"Mozilla Blog","source":"https://blog.mozilla.org/opendesign/empowering-open-design-by-involving-the-community/"}]